{
    "id": "US20140331345",
    "authors": [
        "Qingran Kong",
        "Meiling Wu",
        "Zhonghua Liu"
    ],
    "title": "SEQUENCE OF PORCINE ROSA26 LOCUS AND METHODS OF USING THE SAME",
    "date": "2013-05-04 00:00:00",
    "abstract": "The present invention provides a 5 kb sequence of porcine ROSA26 locus, which can be used for site-specific integration of an exogenous gene into a pig genome. The present invention also provides a gene targeting vector with a 3′ and 5′ arm of the porcine ROSA26 sequence, wherein a target gene can be inserted between the 3′ and 5′ arm sequence. The gene targeting vector can be used to generate transgenic pigs with stable and ubiquitous expression of the target gene.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "CROSS-REFERENCES AND RELATED APPLICATIONS",
                    "paragraphs": [
                        "This application claims priority of Chinese Application No. 201210134764.0, entitled “ The sequence of porcine ROSA26 locus and methods of using the same”, filed May 4, 2012, which is herein incorporated by reference in its entirety."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "claim priority of Chinese Application"
                    ],
                    "num_characters": 233,
                    "outline_medium": [
                        "claim priority of Chinese Application"
                    ],
                    "outline_short": [
                        "claim priority of Chinese Application"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "1. Field of the Invention",
                        "The present invention relates to the field of genetic engineering, and more particularly relates to methods of targeting endogenous and exogenous genes to transgenic animals through homologous recombination.",
                        "2. Description of the Related Art",
                        "Over the past decade, transgenic technology has developed rapidly and been widely applied to different areas. Combined with cloning technology, it makes possible for bringing transgenic animals from basic research to industrial production. Expressing target genes stably and efficiently in transgenic animals has been a great challenge for its application in industrial production. One important factor affecting the expression efficiency of a target gene is integration sites of target genes in host genomes. Therefore, identification and characterization of sequences associated with high efficiency integration and stable expression of target genes is very important for industrial application of transgenic animals.",
                        "The ROSA26 was originally identified as a ubiquitous marker in a retroviral gene-trapping screen in mouse embryonic stem cells. The promoter for ROSA26 gene was found to drive widespread expression of transgenes, and the promoter region and the first intron of the ROSA26 forward transcript has been established as the preferred integration site for the high targeting efficiency and the ubiquitous expression of reporter genes in transgenic mice. There are many transgenic mice reported, such as Zambrowicz et al (Disruption of overlapping transcripts in the ROSA beta geo 26 gene trap strain leads to widespread expression of beta-galactosidase in mouse embryos and hematopoietic cells. Proc Natl Acad Sci USA, 1997, 94(8): 3789-3794), Kisseberth et al (Ubiquitous expression of marker transgenes in mice and rats. Dev Biol, 1999, 214(1): 128-138). In 2007, Trion et al. have documented the identification and characterization of a human homolog of the mouse Rosa26 locus in human embryonic stem cells and demonstrated that transgenes can be readily introduced and broadly expressed in the different lineages of human cells via homologous recombination at the human Rosa26 locus (Trion et al. Identification and targeting of the ROSA26 locus in human embryonic stem cells. Nat Biotechnol, 2005, 25: 1477-1482). Although, the ROSA26 gene has been used widely in transgenic mice, there is no application of ROSA26 gene in transgenic livestock.",
                        "The previous studies of transgenic livestock largely rely on random integration of target genes into the livestock genome. This can be problematic as transgenes introduced into random sites with multiple copies are often subjected to position effect variegation (PEV) and repeat-induced gene silencing (RIGS). The method causes the high variability of expression which frequently happens by random integration due to transgenes inserted at random and at various copy numbers into the host genome. In addition, multiple transgene copies and unpredicted integration sites also makes it difficult for identification of transgenic animals, which has been an obstacle for widespread usage of transgenic animals in industrial production. Research shows that targeted transgensis though homologous recombination can provide a solution to the problems above. However, targeted transgensis has only been applied successfully in transgenic mice, fewer in other transgenic livestock, especially no application in transgenic pigs.",
                        "There is a need for identifying genomic locus with high homologous combination frequency and ubiquitous transcriptional activity in pigs. The present invention satisfies this need and provides other benefits as well."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to genetic engineering",
                        "describe transgenic technology",
                        "motivate ROSA26 gene",
                        "summarize ROSA26 gene in mice",
                        "limitations of transgenic livestock",
                        "motivate targeted transgensis",
                        "identify need for genomic locus"
                    ],
                    "num_characters": 3673,
                    "outline_medium": [
                        "introduce genetic engineering",
                        "limitations of transgenic technology",
                        "motivate ROSA26 locus"
                    ],
                    "outline_short": [
                        "motivate transgenic technology"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "The present invention provides a method for site-specific integration of target genes at porcine Rosa26 locus, which solves the problem of unstable and inefficient expression of target genes in transgenic pigs. Using the sequence of mouse Rosa locus as a template to search the pig genome sequence database, a sequence homologous to moue Rosa26 locus is identified in the pig genome. The identified porcine Rosa26 locus, mapped to pig chromosome 13, includes a promoter, a first exon, a first intron, and a second exon.",
                        "In one embodiment, the present invention provides an isolated nucleotide sequence of porcine ROSA26 gene for site-specific gene targeting, comprising one sequence selected from the group consisting of:\n\n\n- - 1) a nucleotide sequence set forth in SEQ ID NO:1 (porcine Rosa26\n    locus);\n  - 2) a nucleotide sequence that can hybrid to the DNA sequence of SEQ\n    ID NO: 1 under stringent hybridization conditions; and\n  - 3) a nucleotide sequence having at least 95% sequence identity with\n    SEQ ID NO: 1.",
                        "In another embodiment, the present invention provides a gene targeting vector for site-specific integration and stable expression of a target gene in a transgenic animal, wherein the gene targeting vector comprises a 5′ arm and a 3′ arm of the porcine Rosa26 locus and the target gene is inserted between the 5′ arm and 3′ arm of the porcine Rosa26 locus. The 3′ arm and 5′ arm can be, for example, 3.6 kb and 1.4 kb in length, respectively. In a preferred embodiment, the present invention provides a gene targeting plasmid with a DNA sequence set forth in SEQ ID NO:2.",
                        "In another embodiment, The present invention provides a method for site-specific integration and stable expression of a target gene in transgenic animals, comprising the steps of:\n\n\n- - 1) construct a gene targeting vector, wherein the gene targeting\n    vector comprises the target gene inserted between a 5′ arm and 3′\n    arm of the porcine Rosa26 locus;\n  - 2) use the gene targeting vector to make a transgenic animal,\n    wherein the target gene is site-specifically integrated and stably\n    expressed in the transgenic animal.",
                        "In a preferred embodiment, the transgenic animals are transgenic pigs and the gene targeting vector comprises the DNA sequence of SEQ ID NO:2.",
                        "The present invention provides a 5 kb sequence of porcine ROSA26 locus that can be effectively used for site-specific integration and stable expression of target genes in pigs. The present invention provides a method of using the porcine ROSA26 sequence to insert a target gene into a transgenic pig, which can protect the target gene from immune-mediated rejection and epigenetic modification, enabling the target gene to be expressed stably and efficiently in large livestock animals like pigs."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "provide method for site-specific integration",
                        "identify porcine Rosa26 locus",
                        "describe isolated nucleotide sequence",
                        "describe gene targeting vector",
                        "provide method for site-specific integration"
                    ],
                    "num_characters": 2777,
                    "outline_medium": [
                        "describe porcine Rosa26 locus",
                        "embodiment of gene targeting vector"
                    ],
                    "outline_short": [
                        "describe site-specific integration method"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [
                        "The present invention can be better understood and illustrated by the following examples. The following examples were provided by way of illustration only, and not by way of limitation."
                    ],
                    "subsections": [
                        {
                            "title": "The Sequence of Porcine ROSA26 Locus",
                            "paragraphs": [
                                "The sequence of porcine ROSA26 locus is set forth in SEQ ID NO: 1. The porcine ROSA26 sequence can be used in a gene targeting vector (as described below) to specifically target a single copy of exogenous gene to a homologous ROSA26 locus in pig genome and drive stable and ubiquitous expression of the exogenous gene. DNA sequences that can hybridize with porcine ROSA16 gene under stringent hybridization conditions (e.g. hybridization temperature: Tm-10° C. to Tm-15° C.), which can be used to promote expression of target genes, are also included in the scope of the presently claimed invention. Also included are DNA sequences with high sequence identity (>=90%) with the porcine ROSA25 sequence of SEQ ID NO:1."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "set forth the sequence of porcine ROSA26 locus"
                            ],
                            "num_characters": 716,
                            "outline_medium": [
                                "describe porcine ROSA26 sequence and its use in gene targeting vector"
                            ],
                            "outline_short": [
                                "describe porcine ROSA26 sequence and its use in gene targeting vector"
                            ]
                        },
                        {
                            "title": "Identification of the Porcine ROSA26 Sequence",
                            "paragraphs": [
                                "The ROSA26 gene was mapped to chromosome 13 in pig genome by a BLAST search of genomic sequences homologous to mouse ROSA26 sequence (Zambrowicz B. et al. Disruption of overlapping transcripts in the ROSA beta geo 26 gene trap strain leads to widespread expression of beta-galactosidase in mouse embryos and hematopoietic cells. Proc Natl Acad Sci USA. 1997, 94(8):3789-94.). Most sequence information was released in NCBI Sscrofa10.2 database. However, there was a gap, about 108 bp, in 3-terminal of porcine ROSA26 gene first intron. Based on sequences flanking the gap, the primers for PCR amplification were designed as: 5′-GGATCTAATTGGAGCTATAACTGCCAGC-3′ (forward) (SEQ ID NO: 3) and 5′-GCTGAGGGTCCCAAATGCTTTG-3′ (reverse) (SEQ ID NO: 4). The PCR amplification was performed as described: 3 min incubation at 94° C. to denature the DNA templates, 30 cycles of 30 seconds at 94° C., 30 seconds at 60° C., 1 minute at 72° C., then 10 minutes at 72° C., end with one hour at 4° C. A sequence, including a promoter, a first exon, a first intron and a second exon of the porcine ROSA26 gene, was isolated by PCR amplification. The identified porcine ROSA26 sequence could be used to protect target genes expression in transgensis."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "map ROSA26 gene to chromosome 13 in pig genome",
                                "design primers for PCR amplification of porcine ROSA26 gene"
                            ],
                            "num_characters": 1230,
                            "outline_medium": [
                                "identify porcine ROSA26 sequence using BLAST search and PCR amplification"
                            ],
                            "outline_short": [
                                "identify porcine ROSA26 sequence using BLAST search and PCR amplification"
                            ]
                        },
                        {
                            "title": "Construction of a Gene Targeting Plasmid Based on the Porcine ROSA26 Sequence",
                            "paragraphs": [
                                "A gene targeting plasmid based on the porcine ROSA26 sequence was constructed as shown in FIG. 3. The sequence of the gene targeting plasmid was set forth as SEQ ID NO: 2. To construct a gene targeting plasmid, a 1.4 kb 5′-terminal short arm and a 3.6 kb 3′-terminal long arm were amplified, sequenced and subcloned into PPNT6 plasmid at 5′ NotI/3′ KpnI and 5′ XhoI/3′ NheI restriction sites, respectively. The primer sequences for amplifying 5′-terminal arm and 3′-terminal arm were listed as follows:\n\n\n- 5′-CGGGAGTGCGGCCCGCCCTGCGGC-3′ (5-terminal arm, forward) (SEQ ID NO:5)\n- 5′-AGTAGATCCGTGCTTTTTAACCTATC-3′ (5-terminal arm, reverse) (SEQ ID NO:\n  6)\n- 5′ -GAGTTTTACAGTCATCCCATTTGTAGACTTTTGC-3′ (3-terminal arm, forward)\n  (SEQ ID NO: 7)\n- 5′-AGCTCTGATCCCGTGT TGTTGTGGCATAG-3′ (3-terminal arm, reverse) (SEQ ID\n  NO:8)  \n  Also, the sequence of IRES-GFP from TRE plasmid (Addgene) was\n  subcloned into PPNT6 plasmid at 5′HpaI/3′ XhoI restriction site. The\n  pR26, CMV and EF1a promoters are inserted at 5′ ClaI/3′ XbaI\n  restriction site to construct targeting vector PPNT6/pR26, PPNT6/CMV\n  and PPNT6/EF1a, respectively."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "construct gene targeting plasmid based on porcine ROSA26 sequence",
                                "subclone sequences into PPNT6 plasmid"
                            ],
                            "num_characters": 1126,
                            "outline_medium": [
                                "construct gene targeting plasmid using porcine ROSA26 sequence"
                            ],
                            "outline_short": [
                                "construct gene targeting plasmid using porcine ROSA26 sequence"
                            ]
                        },
                        {
                            "title": "Example 4",
                            "paragraphs": [
                                "**Analysis of Target Gene Expression Via Site-Specific Integration at Porcine ROSA26 Locus**",
                                "Genomic sequences from gene targeting transgenic cells were digested with XhoI/XbaI and used for southern blot analysis. The hybridization probe used to detect the GFP transcription unit DNA (probe GFP) was synthesized by PCR, which yields a 757 by product, and the sequences of the primers were 5′-GAGCAAGGGCGAGGAGCTGTTCA-3′ (forward) (SEQ ID NO: 9) and 5′-TGCAGAATT CGAAGCTTGAGC-3′ (reverse) (SEQ ID NO:10). Another probe identifying the 3-terminal arm of ROSA26 locus (probe 3′) was synthesized by PCR, which yields a 360 bp product, and the sequences of the primers were 5′-GTTAGTAACTGAGCTCAGTTGCCG-3′ (forward) (SEQ ID NO: 11) and 5′-GGGAACCA CCCTACAGAGATCTG-3′ (reverse) (SEQ ID NO: 12).The PCR products were labeled by DIG Oligonucleotide 3′-End Labeling Kit (Roche). This 3′ probe can recognize a 3 kb genomic sequence in the pig genome when digested with XhoI/XbaI. In the gene targeting plasmid, this 3′ probe recognizes a shorter sequence of 1.2 kb when cut by the same enzymes (see FIG. 3b). By Southern blot analysis, the probe 3′ detected an identical band (about 3.0 kb) in both transgenic cells and wild cells (WT). There was another band (about 1.2 kb) present in transgenic cells, which confirmed the fact that the target gene was a single copy integration in genome. In addition, there was also a single band (about 1.5 kb) detected using probe GFP in transgenic cells, which indicated that the GFP was integrated into the genome.",
                                "**Southern Blot**",
                                "1. Probe Synthesis, Purification and Labeling",
                                "(1) Probe preparation, the vector pEGFP-C1 (Clontech) was used as a template for PCR amplification of a GFP probe. The primers were designed as: 5′-GAGCAAGGGCGAG GAGCTGTTCA-3′ (forward) (SEQ ID NO: 9) and 5′-TGCAGAATTCGAAGCTTGAGC-3′ (reverse) (SEQ ID NO: 10). The PCR amplification was performed as follows: 3 minutes at 94° C.; 30 cycles of 30 s at 94° C., 30 s at 65° C. minus, 1 minute s at 72° C.; 10 minutes at 72° C. for final extension, and, end with one hour at 4° C. The PCR product (about 752 bp) was isolated for purification of GFP probe.",
                                "(2) Probe purification, the GFP probe was purified using TIANquick Midi Purification Kit (Beijing Tiangen, LTD.) The purification was performed as follows:\n\n\n- - 1) Column equilibration: add 500 ul Buffer BL to the Spin Column\n    CB2. Centrifuge for 1 min at 12,000 rpm (˜13400×g) in a table-top\n    microcentrifuge. Discard the flow-throw, and then place Spin Column\n    CB2 in the collection tube.\n  - 2) Add 5 volumes of Buffer PB to 1 volume of the PCR reaction, and\n    mix them.\n  - 3) Transfer the mixture to the Spin Column CB2 (Placing Spin Column\n    CB2 back into the same collection tube). Let it stand for 2 min at\n    room temperature. Centrifuge for 30-60 s at 12,000 rpm (˜13400×g) in\n    a table-top microcentrifuge. Discard the flow-throw, and then place\n    Spin Column CB2 back into the same collection tube.\n  - 4) Add 700 μl Buffer PW to the Spin Column CB2 and centrifuge for\n    30-60 s at 12,000 rpm (˜13,400×g). Discard the flow-through, and\n    place Spin Column CB2 back in the same collection tube.\n  - 5) Wash the Spin Column CB2 with 500 μl Buffer PW and centrifuge for\n    30-60 s at 12,000 rpm (˜13,400×g). Discard the flow-through, and\n    centrifuge for an additional 2 min to remove residual wash buffer\n    PW.\n  - 6) Place the Spin Column CB2 in the same collection tube, and\n    centrifuge for 2 min at 12,000 rpm (˜13,400×g) to remove residual\n    wash. Let the Spin Column CB2 stand for several minutes, and make it\n    air-dry thoroughly.\n  - 7) Place the Spin Column CB2 in a clean 1.5 ml eppendorf tube. To\n    elute DNA, add 30-50 μl Buffer EB to the center of membrane, let the\n    column stand for 2 min, and centrifuge for 2 min at 12,000 rpm\n    (˜13,400×g) to collect target DNA.",
                                "2. Digestion of Genomic DNA and Gel Electrophoresis",
                                "(1) Digestion of genomic DNA, digestion solution contained 10 μg of genomic DNA, 5 μl EcoR I and 5 μl Nhe I, and 10 μl 10×H buffer. Add distilled water making the final volume 100 μl. Run the digestion at 37° C. for 12 hours.",
                                "(2) Agarose gel electrophoresis, the DNA fragments are electrophoresed with voltage 15V (or 1V/cm) on an 0.7% agarose gel at 37° C. for 20 hours. When the bromophenol blue arrives at 1 cm to the bottom, stopped the electrophoresis.",
                                "3. Transfer\n\n\n- - (1) Cut the gel into sheet with size of 7.5×10 cm, then put it in\n    plate and wash it with distilled water.",
                                "(2) Add denaturation solution (1.5 M NaCl, 0.5 M NaOH), and wash gel in it at room temperature for 20 minutes.",
                                "(3) Wash the gel with distilled water twice.",
                                "(4) Add neutralization solution (1.5 mol/L NaCl, 0.5 mol/L Tris-HCL), wash the gel in it at room temperature for 20 minutes.",
                                "(5) Wash the gel with distilled water twice.",
                                "(6) Add 20×SSC solution, and balance for 20 minutes.",
                                "(7) Set up transfer, with glass plate and weight on top, and let transfer for 14 hours.",
                                "(8) Take off blotting material and mark the position of the wells. Soak the membrane in 6×SSC, and put it on filter paper to dry it. Immobilize the DNA by UV-crosslinking (5000 μJ/cm2).",
                                "(9) Take out, and photograph the gel with a ruler adjacent to the molecular weight markers as a reference.",
                                "4. Hybridization",
                                "(1) Prehybridization, Place membrane in hybridization bottle with 10 ml of high-effective prehybridization buffer. Incubate in hybridization bottle oven at 65° C. for 3 hours.",
                                "(2) Denature probe, prepare probe with concentration of 3 ng/ml, and put it into 1.5 ml eppendorf tube. Denature probe for 10 minutes in boiling water bath, and chill the probe on ice-water immediately for 5 minutes.",
                                "(3) Hybridization, discharge the prehybridization buffer, add denatured probe to hybridization solution, and incubate blot at 65° C. overnight.",
                                "5. Immunochemiluminescent Detection",
                                "(1) After hybridization and washing, incubate membrane with wash buffer 1 minute.",
                                "(2) Block the membrane with blocking buffer for 30 minutes, and perform this step in shaker rotating at very low speed.",
                                "(3) Centrifuge the Anti-Dig-AP for 5 minutes at 13000 rpm. Put 1 μl Anti-Dig-AP into 10 ml blocking buffer, and mix them, preparing Anti-Dig-AP dilution (1:10000).",
                                "(4) After blocking, remove the blocking buffer, and add Anti-Dig-AP dilution, soak membrane for 30 minutes at least.",
                                "(5) Remove the Anti-Dig-AP dilution, and wash membrane twice in washing buffer, 15 minutes every time.",
                                "(6) Remove washing buffer, and equilibrate membrane twice in detection buffer, 2 minutes every time. Incubate with antibody-conjugate for 30 minutes.",
                                "(7) Dilute CDP-STAR with detection buffer, and prepare CDP-STAR solution (1:100). Put the membrane into two pieces preservative film, and add CDP-STAR solution. Make the CDP-STAR solution homogeneous diffuse on the surface of membrane, and incubate at room temperature for 5 minutes.",
                                "(8) Put the membrane into X-ray film cassette, and expose to film. The time of the exposure is 40 minutes.",
                                "Western Blot",
                                "The expression of GFP protein was investigated by Western blot, and the results showed that high GFP protein expression driven by the three promoters were detected, as shown in FIG. 5. The manipulation was described as follows:",
                                "1. Protein Sample Preparation",
                                "(1) Total protein extraction from fibroblast\n\n\n- - 1) Carefully remove culture medium, and clean the culture medium\n    using absorbent paper. Add the 3 ml PBS buffer with 4° C. cold.\n    Place flat and shake gently for 1 minute to wash cells, and remove\n    the washing buffer. Repeat the manipulation twice times, wash the\n    cells three times to remove culture medium. Place flasks on the ice\n    after removing the PBS buffer.\n  - 2) Add 100 volumes of lysis buffer to 1 volume of the PMSF, mix the\n    lysis buffer and PMSF, put the mixture on the ice. Add 400 μl\n    mixture to every flask, incubate on ice for 30 min, and shake the\n    flask always full lysis of the cells.\n  - 3) After lysating, scrap cells in flasks side with a clean spatula.\n    Collect the mixture of cell fragments and lysis buffer, and transfer\n    to a microcentrifuge tube using pipette. At 4° C., centrifuge\n    samples at 12000 rpm for 5 minutes, and collect supernatant for next\n    manipulation.",
                                "(2) Total protein extraction from tissue",
                                "1) Break the frozen tissue into small pieces, and transfer them into a 2 ml microcentrifuge tube.",
                                "2) Add 400 μl lysis buffer (containing PMSF) to the tube, and homogenize the tissue using homogenizer, then place them on ice.",
                                "3) Bread the tissue again in few minutes later, repeat this manipulation some times to make tissue homogenized enough.",
                                "4) Lysate the tissue on ice for 30 minutes. After lysis, centrifuge samples with 4° C. at 12000 rpm for 5 minutes, and collect supernatant for next manipulation.",
                                "2. SDS-PAGE Electrophoresis",
                                "(1) Assemble glass plates and spacers in gel casting apparatus.",
                                "(2) Compound the 10% resolving gel solution, mix the components after adding TEMED, and pour the resolving gel mixture into the gel plates immediately. When the resolving gel arrives at middle line in green brand, stop pouring. Place a layer of H2O over the top of the resolving gel to speed up formation of resolving gel.",
                                "(3) When there is a refraction line between water and resolving gel, the gel clots. Then stand resolving gel for 3 minutes, and drain the H2O from top of the resolving gel. Drain any remaining H2O away with a wipes.",
                                "(4) Compound the 4% stacking gel solution, mix the components after adding TEMED, and pour the stacking gel solution into the gel plates immediately. When gel plates are filled, and insert comb to the top of the spacers. When the gel is poured into gel plates, the gel solution is flowing along the plates to avoid creation of bubble. When insert the comb, place the comb flat. After the gel clots, pinch on both sides of the comb straight up and gently pull it out.",
                                "(5) Wash the stacking gel, and put it into electrophoresis tank. Pick up samples, add 1×SDS loading buffer. Before loading sample, put the protein into boiling water to denature protein. Then add enough electrophoresis buffer, and load samples.",
                                "(6) Electrophoresis, run the gel at 40 V for 4-5 hours, stop the electrophoresis until the dye front just runs out, and transfer the gel to membrane.",
                                "3. Transfer",
                                "(1) Prepare clips for transferring membrane, two sponge pads, a glass rod, wipes and membrane soaking. Open the clip, place the black side flat. Put one sponge pad on the upside, and roll glass rod back and forth several times to remove air bubble. Put three wipes on the pad, fix wipes in one hand, and roll glass rod to remove air bubbles in another hand.",
                                "(2) Uncover the glass plates, and scrape the stacking gel gently to avoid destroy the resolving gel. Put the resolving gel on the wipes, adjust resolving gel and wipes aligning. Roll the glass rod gently to remove air bubbles. Cove the gel with membrane entirely, and remove the air bubbles. Put three wipes on it, and remove the bubbles. Then put another sponge pad on it, and close the clip.",
                                "(3) Put the clip into transfer tray, transfer at 40V for 3 hours.",
                                "(4) After transferring, add 1× ponceau staining solution, strain the membrane for 5 minutes. Wash the membrane to remove destained solution, dry the membrane for next manipulation.",
                                "4. Antibody Reaction",
                                "(1) Soak the membrane with TBS buffer from the bottom up, and transfer it to plates containing blocking solution. Put it into shaker, and shake it for 1 hour.",
                                "(2) Dilute the primary antibody with TBST buffer, add the primary antibody solution on the plastic wrap. Take membrane out from blocking solution, and absorb the residual solution. Put the membrane on the plastic wrap with protein facing to antibody, and tilt corners of the membrane to remove air bubbles. Incubate the membrane at room temperature, wash it twice times for 10 minutes with TBST buffer at room temperature on shaker, and wash it TBS buffer for 10 minutes.",
                                "(3) Use the same protocol for incubating membrane with secondary antibody at room temperature for 1-2 hours. Wash it twice times for 10 minutes with TBST buffer at room temperature on shaker, and wash it TBS buffer for 10 minutes. Then take chemiluminescence reaction place.",
                                "5. Detecton",
                                "(1) Mix same volume of A and B solution on the plastic wrap for one minute. Soak the protein on the membrane with mixture solution for one minute, transfer the membrane to another fresh plastic wrap. Remove the residual solution, package the membrane and put it into X-ray film cassette.",
                                "(2) In dark room, add lx developer solution and fixer solution into plastic tray. Take out X-ray film in red light, and cut it into proper size. Open the X-ray film cassette, and put X-ray film on the membrane. Close the cassette, and expose to film. After exposing, soak the X-ray film into developer solution quickly, when the bands are clear, stop developing.",
                                "6. Gel Image Analysis",
                                "Scan or photograph the film, identify the molecular weight and photosynthesis density of target bands using gel image processing system.",
                                "**Q-PCR Analysis of GFP Expression in Transgenic Cells and Transgenic Embryos**",
                                "Total RNAs were extracted from each sample using the PureLink™ Micro-to-Midi system (Invitrogen) according to the manufacturer's instructions, and reverse transcription was used to generate cDNAs using PrimeScript™ RT Reagent Kit (TaKaRa). Real-time PCR to detect GFP transcripts was performed using SYBR Premix Ex Taq™ (TaKaRa). Amplification reactions were performed in a 20 μl reaction mixture containing 200 ng template cDNA, 0.25 μmol·L−1 of each primer, and 10 μl of 2×SYBR Premix Ex Taq buffer. The reaction solution was mixed on MicroAmp™ Optical 96-Well Reaction Plate, and them were sealed MicroAmp™ Optical Adhesive Film (ABI). The PCR was performed on 7500 Real-Time PCR System (Applied Biosystems), with the following parameters: 95° C. for 10 sec, followed by 40 two steps cycles at 95° C. for 5 sec and at 60° C. for 31 sec, then 95° C. for 15 sec, 60° C. for 30 sec, 95° C. for 15 sec, at last it was dissociation stage. The PCR amplification data were collected and analyzed using software Sequence Detection System. The relative expression levels of GFP at different development stages were shown in FIG. 6."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "analyze target gene expression via site-specific integration at porcine ROSA26 locus",
                                "design primers for PCR amplification of GFP probe",
                                "synthesize GFP probe by PCR",
                                "purify GFP probe using TIANquick Midi Purification Kit",
                                "digest genomic DNA with EcoR I and Nhe I",
                                "perform agarose gel electrophoresis",
                                "transfer DNA to membrane",
                                "hybridize membrane with GFP probe",
                                "detect hybridization signal",
                                "prepare probe 3′",
                                "synthesize probe 3′ by PCR",
                                "purify probe 3′ using TIANquick Midi Purification Kit",
                                "hybridize membrane with probe 3′",
                                "detect hybridization signal",
                                "analyze Southern blot results",
                                "extract total protein from fibroblast",
                                "extract total protein from tissue",
                                "perform SDS-PAGE electrophoresis",
                                "transfer protein to membrane",
                                "incubate membrane with primary antibody",
                                "incubate membrane with secondary antibody",
                                "detect chemiluminescence signal",
                                "analyze Western blot results",
                                "extract total RNA from samples",
                                "perform reverse transcription to generate cDNAs",
                                "perform real-time PCR to detect GFP transcripts",
                                "analyze Q-PCR results",
                                "show relative expression levels of GFP at different development stages"
                            ],
                            "num_characters": 14326,
                            "outline_medium": [
                                "analyze target gene expression via site-specific integration at porcine ROSA26 locus",
                                "synthesize probes for southern blot analysis",
                                "purify probes using TIANquick Midi Purification Kit",
                                "digest genomic DNA and perform agarose gel electrophoresis",
                                "transfer DNA to membrane",
                                "hybridize probe to membrane",
                                "detect hybridized probe using immunochemiluminescent detection",
                                "analyze southern blot results",
                                "perform western blot to detect GFP protein expression",
                                "prepare protein samples for western blot",
                                "perform SDS-PAGE electrophoresis",
                                "transfer protein to membrane",
                                "detect protein using antibody reaction",
                                "analyze western blot results"
                            ],
                            "outline_short": [
                                "analyze target gene expression via site-specific integration at porcine ROSA26 locus",
                                "synthesize probes for Southern blot analysis",
                                "perform Southern blot analysis",
                                "digest genomic DNA and perform gel electrophoresis",
                                "transfer DNA to membrane and hybridize with probes",
                                "detect hybridized probes using immunochemiluminescent detection",
                                "analyze results of Southern blot analysis"
                            ]
                        },
                        {
                            "title": "Development of in Vitro Transgenic Pig Embryos",
                            "paragraphs": [
                                "The PFF were wild type fibroblast cells (control group), and the tPFF were transgenic positive cells (experiment group, GFP positive). These two cells were used as nuclear donors for cloning embryos as described below. There was no significant difference between the control group and the experiment group in the fusion rate, the cleavage rate, the blastocyst rate and the cell No. of blastocyst. There were 27 embryos cloned from transgenic positive cells, among transgenic cloned embryos, GFP were identified expression in 21 clone embryos, the GFP positive blastocyst was 77.8%. The results indicated that the porcine ROSA26 could mediate target gene expression highly in embryos cells, and it had no significant affects on development of embryos cells. The fluorescence analysis of transgenic embryos cell was shown in FIG. 7.",
                                "The fusion protocol used for somatic cell nuclear transfer (SCNT) is described as follows: aspirate the spindle and first polar body of MII oocytes. Select a transgenic cell as donor, and eject the donor cell into the zonae pellucidae. Place the donor cell well connect to cytoplasma membrane of oocytes, and fusion of nuclear transfer couplets is induced by two 30-μs direct current pulses of 1.2 kV/cm, which makes donor cell and oocytes without nuclear fuse to reconstruct a new embryo and activate it. These tools, buffers and apparatus are listed as follow: fixed pipet (internal diameter is 30 um), injection pipe (internal diameter is 25 um), oocytes ordinary operating medium is improved TCM199 medium, and the oocytes ordinary micromanipulation medium is TCM-199-Hepes plus 7.5 mg/ml cytochalasin B. Fusion medium contains 0.3M mannitol, 1.0 mM CaCl2, 0.1 mM MgCl2, and 0.5 mM HEPES. Micromanipulator system is NT-88NE (Narishige, Japan). Cell fusion equipment is BTX Elector-Cell Manipulator 2001 (BTX, USA). These embryos were cultured in porcine zygote medium-3 (PZM-3) at 38.5° C. in 5% CO2 in air. The cleavage rate (embryos containing two and more than two blastomeres) and the blastocyst rate were assessed at 120 hours after activation, and cell number of embryos with green fluorescence was examined.",
                                "While the present invention has been described in some detail for purposes of clarity and understanding, one skilled in the art will appreciate that various changes in form and detail can be made without departing from the true scope of the invention. All figures, tables, appendices, patents, patent applications and publications, referred to above, are hereby incorporated by reference."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "clone embryos using transgenic positive cells",
                                "identify GFP expression in cloned embryos",
                                "analyze fusion rate, cleavage rate, and blastocyst rate",
                                "examine cell number of blastocyst",
                                "show fluorescence analysis of transgenic embryos"
                            ],
                            "num_characters": 2540,
                            "outline_medium": [
                                "clone embryos using transgenic positive cells",
                                "analyze development of transgenic embryos"
                            ],
                            "outline_short": [
                                "develop in vitro transgenic pig embryos using somatic cell nuclear transfer"
                            ]
                        }
                    ],
                    "outline_long": [
                        "provide examples of the invention"
                    ],
                    "num_characters": 185,
                    "outline_medium": [
                        "provide examples of the invention"
                    ],
                    "outline_short": [
                        "provide examples of the invention"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. An isolated nucleotide sequence of porcine ROSA26 locus that can be used for site-specific gene targeting, comprising one sequence selected from the group consisting of:\n1) a nucleotide sequence set forth in SEQ ID NO:1 (porcine Rosa26 locus);\n2) a nucleotide sequence that can hybrid to the DNA sequence of SEQ ID NO: 1 under stringent hybridization conditions; and\n3) a nucleotide sequence having at least 95% sequence identity with SEQ ID NO: 1.",
        "2. A gene targeting vector for site-specific integration and stable expression of a target gene in a transgenic animal, wherein the gene targeting vector comprises a 5′ arm and a 3′ arm of the sequence of claim 1 and the target gene is inserted between the 5′ arm and 3′ arm of the sequence of claim 1.",
        "3. The gene targeting vector of claim 2, wherein the 5′ arm and 3′ arm of the sequence of claim 1 is 1.4 kb and 3.6 kb in length, respectively.",
        "4. The gene targeting vector of claim 2, wherein the DNA sequence of the gene targeting vector is SEQ ID NO:2.",
        "5. A method for site-specific integration and stable expression of a target gene in transgenic animals, comprising the steps of:\n1) construct a gene targeting vector, wherein the gene targeting vector comprises the target gene inserted between a 5′ arm and 3′ arm of the sequence of claim 1;\n2) use the gene targeting vector to make a transgenic animal, wherein the target gene is site-specifically integrated and stably expressed in the transgenic animal.",
        "6. The method of claim 5, wherein the transgenic animals are transgenic pigs and the gene targeting vector comprises the DNA sequence of SEQ ID NO:2."
    ]
}