{
    "id": "https://semopenalex.org/work/W3082969850",
    "authors": [
        "Richard M. Murray",
        "Michael B. Elowitz",
        "Michaëlle N. Mayalu",
        "Junqin Zhu",
        "Mark W. Budde",
        "Yitong Ma"
    ],
    "title": "Synthetic mammalian signaling circuits for robust cell population control",
    "date": "2020-09-03",
    "abstract": "Summary In multicellular organisms, cells actively sense and control their own population density. Synthetic mammalian quorum sensing circuits could provide insight into principles of population control and extend cell therapies. However, a key challenge is reducing their inherent sensitivity to “cheater” mutations that evade control. Here, we repurposed the plant hormone auxin to enable orthogonal mammalian cell-cell communication and quorum sensing. We designed a paradoxical population control circuit, termed Paradaux, in which auxin stimulates and inhibits net cell growth at different concentrations. This circuit limited population size over extended timescales, of up to 42 days of continuous culture. By contrast, when operating in a non-paradoxical regime, the same cells limited population growth, but were more susceptible to mutational escape. These results establish auxin as a versatile “private” communication system, and demonstrate that paradoxical circuit architectures can provide robust population control.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Cells use intercellular communication systems to sense, respond to, and control their own cell population density. In microbial communities, cells secrete and sense diffusive signals to coordinate cooperative behaviors through the process of quorum sensing (Papenfort and Bassler, 2016;Waters and Bassler, 2005) . In multicellular organisms, intercellular communication is equally essential to enable precise developmental patterning (Bier and De Robertis, 2015;Gibb et al., 2010) , control immunological responses (Boyman and Sprent, 2012;Chen et al., 2015;Muldoon et al.) , and coordinate organism-level physiology (Keener and Sneyd, 2009) .",
                "Synthetic intercellular communication systems, if available, could similarly allow engineering of inherently multicellular behaviors not possible with cell-autonomous circuits (Toda et al., 2018) . In bacteria, seminal synthetic biology studies showed how coupling quorum sensing systems to cell death could enable cells to limit their own population size (Scott and Hasty, 2016;You et al., 2004) or drive synchronized oscillations of drug release for therapeutic applications (Din et al., 2016) .",
                "In mammalian cells, a comparable orthogonal \"private communication channel\" that allows specific communication between engineered cells could enable engineering of analogous circuits. Mammalian cells have been engineered to produce, sense, and process signals from natural ligands in new ways by rewiring endogenous signaling pathways such as the Nodal-Lefty, Sonic Hedgehog, and Notch pathways (Li and Elowitz, 2019;Matsuda et al., 2012;Sekine et al., 2018) , or by repurposing the amino acid tryptophan as a signaling molecule (Bacchus et al., 2012) . However, these approaches are not fully orthogonal in mammalian systems. Synthetic synNotch receptors allow multiple orthogonal communication channels but implement contact-based, rather than diffusible, signaling, and are therefore not appropriate for communication among non-adjacent cells (Morsut et al., 2016) .",
                "The ideal private communication system for mammalian population control would use a diffusible signal, avoid undesired interactions with non-engineered cells, permit external control over the strength of signaling, and operate in a broad variety of cell types. It should also allow direct control of diverse target protein activities to allow flexible interfacing within cells, and exhibit minimal immunogenicity to facilitate potential biomedical applications (Figure 1A).",
                "The auxins, plant-specific hormones that coordinate growth and behavior, including root initiation, embryogenesis, and tropism, represent an excellent candidate for this role (Tanaka et al., 2006) . Molecularly, auxin induces protein-protein interactions between the F-box transport inhibitor response 1 (TIR1) protein and its target proteins. This leads to the assembly of a Skp, Cullin, F-box containing (SCF) complex, which in turn recruits E2 ubiquitin ligases that target specific proteins for degradation (Reitsma et al., 2017) . Because TIR1 and its targets are absent in mammals, auxin does not regulate endogenous mammalian proteins. However, ectopic expression of TIR1 from rice (osTIR1) is sufficient to confer auxin-dependent degradation of proteins engineered to contain a minimal auxin inducible degron (mAID, or AID for simplicity in this paper) (Natsume et al., 2016;Nishimura et al., 2009) . Thus, auxin is orthogonal to endogenous mammalian pathways but can enable direct control of key cellular activities through engineered protein targets. Additionally, in yeast, ectopic expression of bacterial indole-3-acetic acid hydrolase was shown to catalyze auxin production from an inactive precursor indole-3-acetamide (IAM), allowing controlled production of auxin (Khakhar et al., 2016) . Nevertheless, a full auxin sending and receiving signaling system, which is necessary for population control, has not been established in mammalian cells.",
                "A critical challenge for population control circuits is evolutionary robustness. By limiting growth, a population control circuit selects for 'cheater' mutations that escape regulation. In bacteria, toxin-antitoxin systems and periodic strain replacement can prevent cheater escape (Liao et al., 2019;Stirling et al., 2018) . However, these systems use components that do not function in mammalian cells or are not cell autonomous. In the mammalian context, a seminal analysis of natural cell population size control systems revealed a paradoxical architecture, in which signals stimulate proliferation and death of the same target cell population, to actively select against cheaters (Hart et al., 2014) . In this paradoxical design, mutations that diminish signal sensing lead to cell death and are eliminated (Karin and Alon, 2017) . Despite its power and elegance, the paradoxical architecture has not yet, to our knowledge, been demonstrated synthetically in living cells.",
                "Here, we engineer the auxin pathway to act as a private mammalian communication channel, and use it to construct and analyze synthetic population control circuits with different architectures. Combining auxin-synthesizing enzymes and auxin transporters, and employing alternative auxin precursors, we show that the auxin pathway can be used for effective quorum sensing in mammalian cells. Using this pathway, we constructed and compared negative feedback and paradoxical control systems that regulate their own population size through auxin quorum sensing. While both circuits limit population size, the paradoxical system enhances evolutionary stability, as predicted theoretically. Together, these results provide a versatile, diffusible synthetic signaling module for private-channel communication and demonstrate how paradoxical control schemes can enhance the evolutionary stability of population control systems."
            ],
            "subsections": [
                {
                    "title": "Results",
                    "paragraphs": [
                        "Engineered mammalian cell lines sense, respond to, and produce auxin To establish and characterize auxin regulation of mammalian cell growth, we coupled auxin sensing to drug resistance and fluorescence. Specifically, we fused blasticidin S deaminase (Blast R ), whose protein product is necessary for growth in the presence of blasticidin, to AID and mCherry domains, allowing auxin-dependent degradation and fluorescent readout of protein concentration, respectively (Figure 1B, upper part). We then stably integrated this chimeric gene, along with a constitutively co-expressed osTIR1, in CHO-K1 cells to create the Receiver cell line (Figure 1B).",
                        "To validate auxin regulation of mCherry-AID-Blast R , we cultured Receivers in media containing varying concentrations of two auxin variants: either the major natural auxin, indole-3-acetic acid (IAA), or a synthetic auxin analog, 1-napthalenatic acid (NAA) (Figure 1C). Both auxins reduced mCherry fluorescence in a dose-dependent manner, with EC50 values of 0.11µM and 0.76µM, respectively. Addition of IAA to media containing blasticidin inhibited cell survival by degrading Blast R (Figure 1D). This effect was dose-dependent with both blasticidin and IAA. These results confirmed that the AID domain and osTIR1 are together sufficient to enable growth regulation by auxin in mammalian cells.",
                        "In addition to sensing, a population control system requires that cells produce auxin at levels sufficient to trigger responses in receiving cells (Khakhar et al., 2016) . Auxin can be synthesized in two enzymatic steps: First, L-tryptophan is oxidized to indole-3-acetamide (IAM). Second, IAM is hydrolyzed to IAA (Figure S1B) (Sitbon et al., 1992) . The second step can produce either IAA or NAA from precursors IAM or 1-naphthaleneacetamide (NAM), respectively, providing a control point for auxin production (Figure 2A) (Kawaguchi et al., 1991) . To identify enzymes that efficiently catalyze this reaction, we compared thirteen indole-3-acetamide hydrolases from bacteria and plants, transiently expressing them individually in Receivers, and measuring their ability to downregulate AID-tagged mCherry fluorescence by flow cytometry.",
                        "Three enzymes reduced mCherry to levels comparable to that produced by addition of IAA itself (Figure S1A). Among these, we selected A. tumefaciens iaaH for further use. We stably integrated it in Receivers to create a Sender-Receiver cell line (Figure 2B). After 2 days of culturing Sender-Receivers in media containing the IAM precursor, the resulting conditioned media was able to reduce mCherry to levels comparable to those produced by saturating concentrations of IAA (Figures 2C and 2D). The Sender-Receiver line was similarly able to efficiently produce the auxin NAA (which, as shown below, has some advantages compared to IAA) from its corresponding precursor NAM (Figures 2D). These results show that iaaH expression in mammalian cells can efficiently produce both auxins from corresponding precursors.",
                        "The ability to synthesize auxin in mammalian cells without exogenous precursors could facilitate in vivo applications of population control circuits. Bacterial auxin synthesis pathways use a tryptophan 2-monooxygenase (commonly named iaaM) to synthesize IAM from L-tryptophan (Figure S1B). Transient expression of iaaM in Sender-Receivers without precursors led to IAA production (Figures S1C and S1D). Furthermore, media conditioned by iaaM-expressing Receivers allowed auxin production by Sender-Receivers without precursor addition (Figure S1D). These results demonstrate the two step iaaM-iaaH auxin synthesis pathway can operate in mammalian cells without exogenous precursors. However, in the following experiments, in order to take advantage of the precursor for external control, we used only iaaH for auxin synthesis.",
                        "Population control requires integrating cell density over an extended spatial scale. To estimate the spatial range of auxin signaling, we seeded a field of Sender-Receivers adjacent to a larger region of Receivers, applying media in a 1.5% agarose gel to prevent non-diffusive transport (Methods). After 48 hours, mCherry fluorescence was reduced in Receivers proximal to the Sender-Receiver region, forming a long-range gradient. This effect occurred in the presence, but not the absence, of the IAM precursor, consistent with a dependence on IAA production (Figure 2E, bottom). Image analysis revealed auxin response in Receivers declining to half its maximum value at a length scale of 15.6±0.85 millimeters (Methods), or approximately 750 cell diameters, from the source region, within 48 hours (Figure 2E, top), consistent with expectations for a small molecule the size of auxin diffusing in buffered solutions (Robinson et al., 1990) (Figure S1E and supplementary text). These results show that auxin can provide information about global cell density over an extended region, and further demonstrate the possibility of using auxin as a synthetic gradient-forming morphogen for applications in synthetic developmental biology (Teague et al., 2016) ."
                    ],
                    "subsections": [
                        {
                            "title": "Engineered cell lines regulate population density",
                            "paragraphs": [
                                "We next asked whether Sender-Receiver cells could sense and regulate their own population size through a negative feedback circuit, in which each cell produces auxin at a constant rate, infers population density from the shared environmental auxin pool (i.e. performs quorum sensing), and conditionally regulates its own survival in response (Figure 3A). To test quorum sensing, we analyzed the dependence of reporter expression on cell population density in the presence of each of the two auxin precursors. With NAM, reporter levels responded to population density as expected (Figure 3B, darker blue line). By contrast, with IAM they exhibited a strong, but density-independent, response (Figure 3B, light blue line). This precursor dependence could result from IAA's indole group, which exhibits limited membrane permeability at neutral pH (Raven, 1975) , potentially causing newly synthesized IAA to accumulate within the cell rather than rapidly equilibrate between intracellular and extracellular environments. By contrast, the greater hydrophobicity of NAA's naphthalene group could allow more rapid membrane exchange. To test this hypothesis, we stably expressed the active auxin exporter PIN2 from Arabidopsis thaliana (Petrásek et al., 2006) in Sender-Receiver cells (Sender-Receiver-PIN2 cells) (Figure 3C,right). A modest decrease in auxin sensing after PIN2 insertions suggested the transporter is functional (Figure S2). PIN2 allowed population sensing to work with both IAM and NAM (Figure 3C). Cells responded similarly to cell density across different culture media volumes, indicating sensing of density rather than absolute cell number (Figure 3D). These results establish that Sender-Receiver cells can sense their own population density using NAM or, with PIN2 expression, using either precursor.",
                                "To determine whether Sender-Receiver-PIN2 cells could inhibit their own survival at high population density, we added blasticidin to the media, making survival dependent on Blast R levels, and thereby activating negative feedback (Figure 3E). We seeded cells at different densities in media containing blasticidin and IAM. After 4 days, cells seeded at high, but not low, densities exhibited reduced cell numbers compared to cells plated at the same density without IAM, indicating density-dependent control of cell killing (Figure 3F)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "The population control circuit is susceptible to cheater mutations at long timescales",
                            "paragraphs": [
                                "To better understand circuit dynamics and stability over longer timescales, we set up time-lapse imaging of a continuous culture of Sender-Receiver-PIN2 cells (Figure 4A). We partially replaced media twice daily to achieve a dilution rate of 50% per 24 hours, and acquired images of cells once per hour for 17 days (408 hours) (Figure 4B; Supplementary movie S1). In the presence of precursor (IAM), cells grew to threshold (peak) densities, diminished due to cell death, and subsequently grew back. Further, the threshold densities that triggered cell death depended on blasticidin concentration but were independent of initial seeding density, consistent with quorum sensing (Figures 4C and 4D;Figures S3A and S3B). By contrast, in the absence of precursor, cells grew to and remained at a higher cell density. These results are broadly consistent with the pulsatile 'overshoot' dynamics expected from time-delayed negative feedback (Alon, 2019;Rosenfeld et al., 2002) .",
                                "Although the circuit initially limited growth, at longer times, population sizes invariably reached those of cultures lacking blasticidin (Figure 4C; Figures S3A andS3B). This behavior could reflect not only pulses in population density but also the appearance and expansion of 'cheater' mutations that effectively disable population control over longer timescales. In fact, cells extracted at the endpoints of movies conducted with blasticidin were significantly less responsive to auxin compared parental or unregulated group (p<0.01 for each culture), and therefore more resistant to blasticidin than cells cultured in the absence of IAM, i.e. without activation of the circuit (Figure 4E; Figure S3C). These results suggest that cells acquired mutations (or other heritable changes) that effectively reduced auxin sensing.",
                                "Several observations suggest that these effects originated from spontaneous, independent mutations. First, resistance mutations occurred in separately maintained, long-term cultures, and therefore could not spread from one culture to another. Second, parental cells cultured in the presence of IAA and blasticidin died within 3 days, with no cells observed to escape selection for at least 20 days of further observation (Figure S3D), indicating that adaptive mutants were not present in the parental population. Finally, sequencing of the integrated osTIR1/Blast R -AID-mCherry plasmid in ten escape mutant lines revealed three distinct, non-synonymous mutations within the AID sequence, consistent with a loss of auxin sensing (Supplementary table S1). While sensing mutations are likely responsible at least in part for the mutant growth advantage, we did not characterize their specific effects in a parental background. Together, these results suggest that the negative feedback population control circuit can be circumvented by de novo mutations or other heritable changes in the circuit."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Paradoxical circuit designs provide robust population control",
                            "paragraphs": [
                                "Could an alternative circuit architecture suppress such escape mutants? Inspired by natural cytokine and glucose sensing circuits, Karin and Alon proposed a paradoxical architecture that theoretically achieves this goal (Karin and Alon, 2017) . The key feature is that the quorum sensing signal regulates both cell proliferation and cell death in the same direction, either positively in their case, or negatively in our implementation due to the mechanism of auxin regulation. This counterintuitive architecture produces a biphasic dependence of net growth (the difference of proliferation and death rates) on the perceived auxin signal (Figure 5A). In appropriate parameter regimes, net growth becomes positive only within a window of signal concentrations. In low signal environments, mutations that reduce signal sensing lead to reduced cell proliferation (grey area in Figure 5A). Cells containing such mutations are therefore counter-selected, driving their population size to zero (Figure 5A, right).",
                                "To see whether a paradoxical auxin-based architecture could prevent mutational escape, we added a second regulatory pathway to the existing population control circuit. In this pathway, auxin negatively regulates cell death by inducing degradation of iCasp9, an ectopically expressed master regulator of apoptosis, originally designed as a kill switch for cell therapies, that can be controlled with the small molecule dimerizer AP1903 (Figure 5B) (Di Stasi et al., 2011;Straathof et al., 2005) . We incorporated an AID domain in iCasp9 to provide auxin regulation, and fused it to the monomeric GFP variant mGFPmut3, to allow direct readout (Landgraf et al., 2012) (Figure 5B). We refer to the resulting system as the Paradoxical Control circuit.",
                                "We encoded the Paradoxical Control circuit as a single multi-protein expression construct (Figure 5C), placing the AID-Blast R coding sequence at the 3' end to select against potential premature stop codon mutations. We stably integrated it in wild-type CHO-K1 cells, and selected two clonal cell lines from independent transfections, dubbed PC1 and PC2, for further analysis.",
                                "To verify that these cell lines respond paradoxically to auxin, we analyzed their growth rates across varying concentrations of NAA, individually activating each of the regulatory paths with AP1903 or blasticidin (Figure 5D; Figure S4A, red and green respectively). As expected, cell survival monotonically increased with auxin in the presence of AP1903 and decreased with auxin in the presence of blasticidin (Figure 5D; Figure S4A). Including both blasticidin and AP1903 to fully activate the circuit produced the anticipated biphasic survival curve (Figure 5D; Figure S4A, blue dots). Both PC1 and PC2 cell lines thus exhibited the key behavior required for paradoxical control."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Mathematical modeling identifies parameter regimes required for paradoxical control",
                            "paragraphs": [
                                "To understand the experimentally designed paradoxical population control circuit and identify parameter regimes, including concentrations of blasticidin and AP1903, that optimize its behavior, we developed a mathematical model of the system. The rapid intracellular-extracellular auxin equilibration observed for NAA (Figure 3B), and time scale separation between fast intracellular dynamics and the slower cell population dynamics (Figure S4, Supplementary Text) allowed us to approximate the system using only two differential equations. The first represents the extracellular auxin concentration shared by all cells, denoted ; the second describes the cell population size, denoted . Here, we normalize to range from 0 to the environmental carrying capacity, defined as 1 (see Supplementary Text for more detailed treatment of model).",
                                "In the model, auxin is produced at a constant rate per cell, , and diluted by periodic media changes approximated as a continuous process with rate constant :",
                                "(Equation 1)",
                                "To describe cell population dynamics, we used a generalized logistic function (Richards, 1959) (Figure S4B, Supplementary Text), modified to incorporate the effects of blasticidin, , and iCasp9, , on growth:",
                                "(Equation 2)",
                                "Here, the exponent is the non-linear correction parameter in the generalized logistic growth function (Richards, 1959) . denotes the cellular growth rate, and can be written as a sum of two terms representing the combined effects of blasticidin and iCasp9, in conjunction with auxin, on cell survival (See Equations S13, S14, and S15 for the exact form).",
                                "We used data from independent experiments to constrain key parameters including the sensitivity of AID-tagged proteins to auxin, the unperturbed cell growth rate, the auxin secretion rate, and the non-linear growth correction parameter (Figure 1C; Figures S4B andS4D). Remaining parameters were fit using the auxin-dependent survival rates measured with either AP1903 or blasticidin (Figure 5D, red and green line). The model initially overestimated actual survival rates when both arms of the circuit were simultaneously active in PC1 and PC2 (Figures 5D; Figure S4A, dashed blue lines), possibly due to previously reported synergy between apoptosis and blasticidin-dependent translational inhibition (Holcik and Sonenberg, 2005) . We therefore added a phenomenological synergistic interaction term to the growth rate expression (Equation S16 and Supplementary text), which improved the fit to the biphasic responses in PC1 and PC2 (Table S2; Figures 5D;S4A,dotted line).",
                                "Using the model and parameters, we sought to determine expression levels of iCasp9 and Blast R and concentrations of AP1903 and blasticidin that produce paradoxical (biphasic) survival curves across a broad region of parameter space and therefore enable robust population control. For each set of these experimentally tunable parameters, we classified the dependence of cell survival on auxin into five behaviors: positive or negative net cell growth at all auxin concentrations (Figure 5E, purple and green background); permissive growth, in which cells proliferate only beyond a minimum auxin concentration (Figure 5E, pink background); simple negative feedback control, analogous to the Sender-Receiver behavior (Figure 5E, blue background); and the desired paradoxical control (Figure 5E, yellow background). This analysis revealed that paradoxical control occurred in a window of blasticidin and AP1903 concentrations centered around 50µg/ml and 50nM, respectively (Figure 5E). This paradoxical window can be enlarged by optimizing the expression levels of iCasp9 and Blast R , which is experimentally achievable through changes in integration site and/or copy number (Figure 5F). Simulations of the circuit in the paradoxical regime displayed the expected bistability of population size (Figure S4E). More critically, they made the system more robust to mutations, effectively eliminating sensing deficient cheater mutations in the paradoxical regime. By contrast, mutant suppression was not observed with the same parameter set running in the negative feedback condition (Figure 5G). Given the long timescales necessary to experimentally characterize evolutionary robustness, this model played a critical role in exploring a broad range of parameters, and identifying specific AP1903 and blasticidin concentrations most likely to provide evolutionarily robust population control."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Paradoxical circuits extend the duration of population control",
                            "paragraphs": [
                                "We next asked whether the Paradoxical Control circuit could extend the duration of population control in cell culture, as predicted. We continuously monitored cultures of PC1 cells for 43 days (an arbitrary time scale constrained by technical limitations) in regimes of uncontrolled growth (no inducers), negative feedback (blasticidin), or paradoxical feedback (both blasticidin and AP1903). In the uncontrolled regime, cells grew to, and remained at, full confluence for the duration of the movie (Figures 6A and6B, Supplementary movie S2). The negative feedback regime limited population size for 1 or 2 oscillatory periods (up to 25 days), after which cells appeared to escape control, remaining confluent for the remainder of the movie (at least ten subsequent days, Figure 6B, middle). This behavior is consistent with the susceptibility of simple negative feedback to escape mutants observed experimentally (Figure 4) and in the model (Figure 5G). By contrast, in the paradoxical regime, cultures exhibited oscillations in population density, but remained at sub-saturating densities for the full 43-day experiment (Figure 6B, bottom). To confirm these results, we repeated the experiment with an additional 47-day time lapse movie (Figure S5; Movie S3). As before, the negative feedback conditions led to escape, while the paradoxical conditions did not (Figure S5A). By including a larger imaging area in this experiment, we were able to confirm that the paradoxical circuit limited population density at sub-saturating levels (Figure S5B andS5C). Together, these results indicate that the paradoxical control circuit extends the duration of control.",
                                "Finally, we asked whether the paradoxical architecture could suppress cheater mutants for the reasons predicted by the model. Loss of auxin sensing is the predominant cheating mode under negative feedback conditions. We observed this above with Sender-Receiver-PIN2 cells (Figure 4E), and again, independently, with Paradoxical Control cells cultured under negative feedback conditions (without AP1903) (Figure 6C). In the paradoxical circuit design, the expression of BlastR and iCasp9 are both up-regulated by loss of auxin perception. Consequently, most adaptive mutations that up-regulate BlastR should also increase iCasp9 expression (Figure S5), and thereby become susceptible to AP1903-dependent killing (Figure 6E). For this reason, paradoxical conditions should select against loss of signal sensing. In fact, cells evolved under paradoxical conditions did exhibit significantly different basal expression and auxin-responsiveness than cheaters evolved under negative feedback alone (Figure 6C, blue/green dots, all p<0.01). These results show that the paradoxical architecture achieved greater evolutionary robustness by successfully blocking the predominant mutational escape path to cheating."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "Discussion",
                    "paragraphs": [
                        "Natural cytokine-based control circuits allow cells to regulate their own population dynamics, as well as those of other cell types. Synthetic circuits could enable engineering of analogous capabilities. To this end, we engineered simultaneous production and sensing of the plant hormone auxin in mammalian cells, and coupled it to genes controlling cell proliferation and death. The enzyme iaaH, together with IAM and PIN2 or with the alternative auxin precursor NAM, allows cells to produce and export auxin, providing a long-range private communication channel (Figures 12). Sender-Receiver circuits in which cells couple auxin sensing to survival are capable of sensing and regulating their own population size (Figures 34). However, the simplest negative feedback architecture is susceptible to mutations that abolish population control over extended timescales (Figure 4; Figure S3). By contrast, paradoxical designs in which auxin both stimulates growth and promotes cell death provide a critical advantage, as predicted theoretically (Figure 5) (Karin and Alon, 2017) . In long-term cultures, Paradoxical Control cells did not escape control despite acquiring mutations (Figure 6). These results establish a mutationally robust synthetic mammalian quorum sensing and population control capabilities.",
                        "The approach taken here required multi-level circuit design. At the molecular level, we imported, optimized, and combined multiple molecular components, including iaaH (together with its chemical precursors IAM and NAM), the AID degron, the PIN2 auxin exporter, the inducible caspase iCasp9 and the blasticidin resistance gene, Blast R . At the circuit level, it required analyzing the number and stability of fixed points generated by different regulatory designs to predict circuit dynamics (Figures 5E andS4). Finally, and equally importantly, it also required analysis of circuit dynamics over extended timescales to account for the evolutionary selection pressure inherent to population control, and the consequent potential for circuit escape due to cheater mutations.",
                        "Further work could improve the circuits presented here and circumvent their limitations. First, these circuits currently require addition of the auxin precursors IAM or NAM for auxin synthesis. However, expression of tryptophan 2-monooxygenase (iaaM), in conjunction with iaaH, is sufficient to synthesize auxin in cells without exogenous precursors (Figures S1B-D). Second, the use of blasticidin and its auxin-regulated resistance gene for growth control is not ideal, since antibiotics have complex effects on the cell, must be added to the media, and broadly affect all cells exposed to the drug, making them inappropriate for cell therapy applications. Enzyme-prodrug systems could provide an alternative approach with fewer non-specific effects on host cells (Sharrock et al.;Trask et al., 2000) . Alternatively, a more generalizable, cell-autonomous system could be achieved by coupling auxin to a cell-cycle regulator, such as Cdk1, 2 or 3 (Satyanarayana and Kaldis, 2009) , or other genes (Harborth et al., 2001) essential for survival and/or cell cycle progression. Third, our current circuit exhibits oscillatory behaviors (Figure 6B), similar to earlier synthetic population control circuits in bacteria (Balagadde, 2005) , resulting from delayed negative feedback. Reducing feedback delays or implementing more complex control systems (Chevalier et al., 2019) should facilitate non-oscillatory homeostatic dynamics. Finally, although the paradoxical control system successfully extended the duration of population control, by the end of the long-term culture, cells have changed (Figure 6B, 6C, and S5A). It remains to be seen how long the paradoxical design can extend the duration of control in the presence of strong selection pressure to subvert it.",
                        "In addition to quorum sensing and population control, the auxin cell-cell communication system demonstrated above also opens up the possibility of engineering more complex multi-cell type communication and control systems. For example, to track the relative distance between two groups of cells, one could engineer receivers that permanently activate in response to auxin secreted by a second cell type. Alternatively, one could take advantage of the two-step nature of the auxin synthesis pathway (Figures S1B andS1D) by separating the steps into distinct cells, thereby enabling a proximity-dependent AND gate. More complex cytokine-like, multi-channel circuits could be achieved by combining the auxin with additional diffusible, orthogonal signals. This approach could enable synthetic bidirectional signaling (Zhou et al., 2018) or even Turing-like spatial pattern formation (Turing, 1952) . Candidate molecules for additional channels include the plant hormones abscisic acid and gibberellin, both of which have partially mapped biosynthetic pathways (Early and Martin, 1990;Finkelstein, 2013;Mashiguchi et al., 2011) and were previously engineered to induce protein-protein interactions, enabling them to regulate transcription or protein localization in mammalian cells (Liang et al., 2011;Miyamoto et al., 2012) . Bacterial autoinducers or synthetic proteins also provide attractive candidates for additional orthogonal signaling channels (Daringer et al., 2014;Hong et al., 2012;Morsut et al., 2016) .",
                        "With these developments, private communication channels, population sensing, and population control could improve engineered cell therapies by allowing cells to coordinate their responses and localize activities at target sites. Previously, several studies attempted to activate latent natural signaling abilities to trigger coordinated multicellular responses. For example, to locally stimulate immune function, T cells were engineered to secrete IL-12 and IL-18 upon tumor infiltration (Chmielewski et al., 2011;Hu et al., 2017) . Similarly, secretion of bispecific T-cell engagers (BiTEs) by engineered T cells was shown to guide bystander T-cells to attack exclusively at the cancer site, successfully improving infiltration and reducing toxicity caused by normal tissue expression the target (Choi et al., 2019) . Private auxin-based communication channels would complement these approaches, by allowing engineered cells to not only specifically sense and limit their own local population size but also to enable conditional activation only beyond a minimum density. We therefore anticipate the incorporation of synthetic population control systems in future generations of engineered cell therapies.",
                        "Finally, we note that the paradoxical design was inspired by natural circuits (Hart et al., 2012) , but implemented with unrelated molecular components. This result emphasizes the importance of identifying circuit-level design principles that can operate with diverse molecular implementations. It also highlights the critical importance of discovering and leveraging the most effective natural designs generated and optimized by evolution."
                    ],
                    "subsections": [
                        {
                            "title": "Figures",
                            "paragraphs": [
                                "Figure 1: The plant hormone auxin allows private-channel mammalian cell-cell communication. (A) An ideal mammalian private-channel communication system would allow engineered cells to send and respond to an orthogonal signal that does not interact with host cells. (B) Auxin Receiver cells constitutively express a fluorescent target fusion protein, mCherry-AID-BlastR, as well as the F-box protein osTIR1. In the presence of auxin (yellow circle), osTIR1 and the AID-tagged target protein will be assembled into a SCF complex, which allows ubiquitylation (red dots) of the target protein, leading to target degradation. Both proteins are encoded on a single mRNA, with an intervening T2A ribosomal skip sequence to yield separate proteins (Szymczak et al., 2004) . (C) Auxin regulates intracellular protein levels. A plasmid co-expressing osTIR1 and the mCherry-AID-BlastR target was stably integrated into CHO-K1 cells to generate the Receiver cell line. The response of mCherry fluorescence to two different species of auxin (IAA and NAA) was measured after two days of treatment (dots). The responses follow Michaelis-Menten kinetics (fitted lines), with indicated K M values. (D) Auxin regulates cell density. Cells were treated with a combination of IAA and blasticidin at different concentrations for four days, with one passage on the second day. Cells were counted by flow cytometry (n=3, error bar = standard deviation).",
                                "Figure 2: Sender-Receiver cells produce and respond to auxin. (A) Indole-3-acetic acid hydrolases such as iaaH, aux2 and AMI1 hydrolyze inactive auxin precursors (IAM and NAM) to their respective active form(IAA and NAA). (B) Stable expression of iaaH in Receiver cells allows them to produce auxin from precursors (blue square). (C) Conditioned media experiment (schematic). Fresh culture media with or without precursors was added to plated sender cells, collected, mixed at 1:1 ratio with standard fresh media, and then applied to receiver cells. (D) iaaH can produce IAA and NAA auxins from IAM and NAM precursors, respectively. Standard media, with or without precursors, was conditioned by Sender-Receivers or standard CHO-K1 cells for 48 hours and applied to Receiver cells for another two days. Receivers cultured with fresh media with or without auxins were also assayed as controls. Data are normalized to Receiver cell fluorescence treated with media conditioned by CHO-K1 cells. Error bars represent standard deviation of 3 replicates. (E) Auxin senders can generate an auxin gradient. Sender-Receivers (green) were seeded within a 7mm x 7mm square at the edge of a 60mm dish, and Receivers were plated everywhere else (no fluorescence or red). One day after plating, media was replaced with fresh media containing low-melt agarose, with or without IAM (Methods). Plates were imaged after two additional days of culture. Inset: Quantification of the average pixel intensity of mCherry expression, after masking, shows that mCherry inhibition depends on distance from Sender-Receiver region. Error bars are the standard deviation of the four images making up each column in the mosaic.   Using the model, we simulated auxin-dependent growth in different parameter regimes and identified five distinct regimes (indicated schematically as insets). Using this classification, we numerically analyzed and sorted growth curves for each concentration of blasticidin and AP1903 (central plot). The grey region indicates curves that could not be classified into one of these categories (0.68% of total, see Figure S4F and Supplementary text). (F). For each expression level, we analyzed the percent of blasticidin-AP1903 concentrations that generate paradoxical behavior, similar to panel E. Optimizing the expression and ratio of Blast R and iCasp9 can widen the paradoxical regime. (G) Dynamic simulations show the Paradoxical Control circuit provides evolutionary robustness. For the negative feedback system, and are set to zero. Mutated strains were simulated with auxin ( ) fixed to zero, representing sensing deficient mutations. On day 25, 50, 75 and 100, mutant cells (1% of the popular cap) were introduced into the simulated system to test robustness to mutations. These mutants take over in the negative feedback circuit (top) but not the paradoxical circuit (bottom). Dashed line indicates carrying capacity. NAM and 50μg/ml blasticidin; middle panel), or paradoxical feedback (100μM NAM, 50μg/ml blasticidin, and 50nM AP1903; lower panel). 12 positions in each of the 10 cultures were imaged every hour for 43 days, with media change every 12 hours. For visualization, the images were cropped to 40x512 pixels, subsampled every 12 hours, and combined to make the kymograph. (B) Population dynamics for the three conditions reveal delayed mutational escape for the paradoxical circuit. Upper panel shows mutational escape of all negative feedback cell lines by 30 days, whereas the lower panel shows that the paradoxical control circuit prevents mutational escape during the same time period. Cells were seeded at varying densities (indicated in legend). Grey lines indicate uncontrolled growth (re-drawn in both panels). (C) Cell lines evolved under paradoxical conditions are phenotypically different from cheaters evolved under negative feedback. Each dot represents one culture. Cells evolved under the negative feedback conditions form a tight cluster, which is fitted with a 2-D gaussian to show the 95 percentile (orange dashed ellipse). In contrast, cell lines evolved under paradoxical control showed significantly different phenotypes compared to the negative feedback cluster (p = <1e-10, 0.001, 0.007, and <1e-10, top to bottom). (D) Under paradoxical, but not negative feedback, conditions, mutations that reduce auxin sensing lead to apoptosis in cheaters (red inhibitory arrow), preventing unregulated growth and mutational escape. (E) Activation of iCasp9 by AP1903 kills cheaters from the negative feedback condition (red dots) as compared to the parental cells (gray bars), even in the presence of NAA. Cells were incubated with different levels of NAA for 6 hours, and then 50nM of AP1903 was added (except in controls) for another two days. Confluencies were measured and normalized to the no AP1903 control (n=3).    . Sender-Receivers were seeded at 10,000 cells per well. After different durations (0 to 73.5 hours), conditioned media was collected to assay auxin concentration and cells were counted to estimate exponential growth rate. To determine the auxin concentration, the conditioned media was applied to Receivers at 1X, 0.5X, or 0.25X concentrations, and then Receiver fluorescence was compared to a standard curve. This procedure produced an estimated secretion rate of *(E) Dynamic simulation of the system shows biphasic growth. Simulations were initiated at different cell densities. For each initial cell density, the initial auxin concentration was determined by setting Equation 1 to equal zero. (F) An unbiased sampling of the \"unclassified\" curves from Figure 5E shows that they are intermediate between \"permissive\" and \"paradoxical\" categories.   The synergetic coefficient 1.12(1); 1.70( 2 (Equation S3)"
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Supplemental Figures",
                            "paragraphs": [
                                "The model represents blasticidin and AP1903 interactions as follows:",
                                "• Extracellular Blasticidin, denoted , diffuses into the cell, where it is denoted , and undergoes subsequent enzymatic inactivation by Blast R , with a threshold concentration of , and a Hill coefficient :",
                                "(Equation S4)",
                                "• AP1903 forms an active caspase complex, with iCasp9, with a threshold concentration of and a Hill coefficient :",
                                "(Equation S5)",
                                "In these two cases, we allow the more general Hill kinetics to account for potential intermediate reaction mechanisms that could influence the effective cooperativity in the final expressions. Additionally, we assumed that both inactivation of Blasticidin and iCasp9 binding to AP1903 are rapid and have reached steady state.",
                                "As described in the main text, the overall population dynamics can be described using a generalized logistic function, with the growth rate represented as a linear combination of blasticidin-dependent and iCasp9-dependent terms (Equation 2). The Blasticidin-dependent growth rate, , is a sum of two terms. The first describes attenuation of the maximum natural cell proliferation rate, , with increasing blasticidin, while the second represents an increase in the cell death rate, , with increased blasticidin.",
                                "These terms are associated with half-maximal blasticidin concentrations of and , respectively:",
                                "(Equation S6)",
                                "For simplicity, we assume . Thus, Equation S6 can be reduced to the following form:",
                                "(Equation S7)",
                                "We similarly describe the iCasp9-dependent cell death rate, , with a Hill function dependence on the concentration of the AP1903-iCasp9 ( ) complex:",
                                "(Equation S8)",
                                "Adding Equations S7 and S8 together and substituting the corresponding terms from Equations S4 and S5, generates the complete form of the growth rate function in Equation 2:",
                                "(Equation S9)",
                                "To simplify this description, we assumed a time-scale separation between the faster auxin-population dynamics and the slower intracellular reactions involving and . Using singular perturbation theory (Del Vecchio and Murray, 2014) , the system can then be approximated by a simpler system that retains only the slower dynamics (Equation 1 and 2), while the faster dynamics (Equation S2 and S3) are considered to be at equilibrium:",
                                ". With this approximation, we can write and in terms of the auxin concentration, .",
                                "(Equation S10) (Equation S11)",
                                "We also defined the following additional parameter combinations for simplicity (see Table S2):",
                                "(Equation S12)",
                                "We can then substitute and in Equation S9 to obtain the following:",
                                "(Equation S13) in which:",
                                "(Equation S14) (Equation S15)",
                                "To verify the validity of the approximation, we compared the full model (Equations 1, 2, S2, and S3) to the approximate model, where Equations S2 and S3 are set to 0. We simulated both models using the parameter values in Table S2 (PC1 set). The two sets of traces closely followed each other (Figure S4C), indicating that the approximate system accurately reproduced the dynamics of the full model."
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        },
        {
            "title": "Representing synergy between iCasp9 and blasticidin control of cell survival",
            "paragraphs": [
                "As discussed in the main text, the model above overestimated actual survival rates when both arms of the circuit were simultaneously active in PC1 and PC2 (Figures 5D; Figure S4A, dashed blue lines), likely due to synergy between apoptosis and blasticidin-dependent translational inhibition. We therefore added a phenomenological synergistic interaction term: to the growth rate expression ( in Equation S9):",
                "those curves' dynamics, although not mathematically classified, will behave similarly to either permissive or paradoxical types."
            ],
            "subsections": [
                {
                    "title": "Methods",
                    "paragraphs": [
                        "appropriate for 1-2 weeks. 3) Single clones were isolated through the technique of limiting dilution. For piggyBac constructs, the initial transfection consisted of the target plasmid along with the construct expressing the piggyBac transposase in a 1:4 mass ratio."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Flow cytometry",
            "paragraphs": [
                "Flow cytometry by trypsinizing 0.25% trypsin-EDTA (GIBCO) for 1 min at room temperature. The mixture was then neutralized by culture media and cells were resuspended in Hank's Balanced Salt Solution (GIBCO) with 2.5 mg/ml Bovine Serum Albumin (BSA). Cells were then filtered through a 40 μm cell strainer and analyzed by flow cytometry (MACSQuant VYB, Miltenyi or CytoFLEX, Beckman Coulter). We used EasyFlow, a Matlab-based software package developed by Yaron Antebi ( https://github.com/AntebiLab/easyflow ), to process flow cytometry data. All fluorescence data were acquired as median value of the gated population. For counting cells, 1000 CountBright beads (Life Technologies) were spiked into the sample before filtering, gated out by their fluorescence in analysis and used to estimate cell number in each sample."
            ],
            "subsections": []
        },
        {
            "title": "Conditioned media",
            "paragraphs": [
                "The process is described in Figure 2C. Cells were first seeded at about 20% confluence with fresh media for conditioning, and cultured for 2 days. The supernatant was collected as \"conditioned media\", and further filtered with 0.22 micron filter or centrifuged at 300 g for 3 minutes to remove any remaining cells. The conditioned media was then combined with fresh culture media at 1:1 ratio, and applied to receiving cells."
            ],
            "subsections": []
        },
        {
            "title": "Cell imaging",
            "paragraphs": [
                "For imaging experiments, cells were seeded at 24 or 96-well TC-treated plates with imaging grade plastic bottoms (ibidi inc.),as described above.",
                "Snapshots were acquired on the EVOS imaging system (ThermoFisher) with the EVOS AMG 4x objective (0.13 NA), or a 10x olympus objective (0.30 NA), with the system's default auto-scanning function.",
                "Time-lapse images were acquired on an inverted Olympus IX81 fluorescence microscope with Zero Drift Control (ZDC), an ASI 2000XY automated stage, iKon-M CCD camera (Andor, Belfast, NIR), and a 20x olympus objective (0.70 NA). Fluorophores were excited with an X-Cite XLED1 light source (Lumen Dynamics). Cells were kept in a custom-made environmental chamber enclosing the microscope, with humidified 5% CO 2 flow at 37°C. Microscope and image acquisition were controlled by Metamorph software (Molecular Devices).",
                "Images were background-subtracted and masked by the constitutive mTagBFP2 fluorescent in blue channel (not shown) and quantified by summing up intensities of pixels that passed the mask. Error bars are standard deviations of four images at the same distance."
            ],
            "subsections": []
        },
        {
            "title": "Confluence estimation",
            "paragraphs": [
                "Images, regardless of acquisition conditions, were converted to grey-scale for analysis in cases where pseudo-color was applied by the software automatically (a 2x2 binning is applied if acquired using the EVOS system). For each experiment, around 5 images were used in Ilastik (Berg et al., 2019) pixel classification mode to train a classifier (decision tree-based), that classifies each pixel as cell or not cell (the trained models are available with the full data set). The classifier was then applied to the entire set of images, and output as probability masks. The masks were then analyzed to determine the fractions of \"cell\" pixels in the image. This value was then used to estimate confluence."
            ],
            "subsections": []
        },
        {
            "title": "Long-range gradient setup",
            "paragraphs": [
                "Silicone-based inserts (ibidi inc.) were first attached to the bottom of TC-treated 6cm dishes (Thermo Scientific). Sender-receiver cells were seeded inside the inserts and allowed to settle down for 2 hours. The inserts are removed and the whole dish is washed with PBS twice to remove non-attached . Receiver cells were then seeded in the dish at approximately 20% confluence, and allowed to settle down for another 6 hours. To prepare agarose infused media, 2% low melting point agarose (EMD) was melted in alpha-MEM at 95°C for 10 minutes, and temperature was cooled to 42°C, before IAM and other ingredients of complete media (described above) were mixed in. Agarose infused media was applied to dishes with original media removed and allowed to solidify at room temperature for 20 minutes, before being moved into the incubator."
            ],
            "subsections": []
        },
        {
            "title": "DNA sequencing and analysis",
            "paragraphs": [
                "Cells were harvested and genomic DNA was extracted with column based kits (QIAGEN). The region of interest, including the promoter and the full CDS was amplified by high-fidelity PCR (TaKaRa Bio) and sequenced on an Illumina MiSeq system with transposase based library preparation kit (Nextera XT, Illumina).",
                "The output reads were first trimmed with TrimGalore ( https://github.com/FelixKrueger/TrimGalore ) and mapped to the genome sequence with Bowtie2 (Langmead and Salzberg, 2012) .",
                "744-757.e17."
            ],
            "subsections": []
        },
        {
            "title": "Data and material availability",
            "paragraphs": [
                "The plasmid GenBank files, raw data, and processing/plotting scripts for generating the figures shown in this paper are available at data.caltech.edu ( http://dx.doi.org/10.22002/D1.1613 ). Key constructs will be made available through addgene.com ( https://www.addgene.org/plasmids/articles/28212030/ ) and key cell lines will be available upon request. The code for the mathematical modeling section (Figure 5 and S4) is available at github.com: ( https://github.com/labowitz/auxin_paradox_matlab_code )."
            ],
            "subsections": []
        },
        {
            "title": "Estimation of auxin diffusion coefficient",
            "paragraphs": [
                "To estimate the auxin diffusion coefficient, we modeled the system as a fixed concentration source, with the standard result for one-dimensional diffusion:",
                "In which, is the concentration as a function of time( ) and space( ), is the fixed concentration source, the complementary error function and is the diffusion coefficient. The diffusion coefficient of auxin has been previously measured to be (Robinson et al., 1990) . Therefore after 48 hours, the diffusion will expand to approximately 3 to 4 centimeters (Figure S1E). Compared to this ideal fixed concentration source model, the in vitro experimental gradient (Figures 2E) is expected to exhibit delays in both auxin production and auxin sensing. Nevertheless, the experimentally observed gradient lengthscale was similar to the theoretical model prediction (tens of millimeters)."
            ],
            "subsections": []
        },
        {
            "title": "Model of the paradoxical population control circuit",
            "paragraphs": [
                "Here we describe a dynamical model of the paradoxical population control circuit. The model is based on the following biochemical reactions, interactions, and assumptions:",
                "• Auxin, denoted , is synthesized from its precursor through an iaaH-catalyzed hydrolysis reaction at a constant synthesis rate per cell , eliminated at a rate , which is dominated by dilution due to media changes. Auxin diffuses rapidly in and out of the cell, and its concentration is therefore assumed to be at quasi-steady state (Equation 1). • iCasp9, denoted , and Blast R , denoted , are produced at rates and , respectively. • Auxin binds reversibly to osTIR1 to form an auxin-osTIR1 complex, which ubiquitylates and degrades iCasp9 and Blast R via their attached AID domains. These reactions are described using classical enzyme kinetics with the auxin-osTIR1 complex as the activating enzyme, described as a constant rate . In addition to auxin-induced active degradation, iCasp9 and Blast R are also eliminated at rate due to dilution (Equations S2 andS3).",
                "• The concentrations of iaaH and osTIR1 are assumed to be constant. Auxin precursor is assumed to remain at excess, saturating concentration. • osTIR1 is assumed to be present at excess concentration compared to the iCasp9-auxin-osTIR1 and Blast R -auxin-osTIR1 complexes, and therefore potential competition between iCasp9 and Blast R for osTIR1 can be neglected.",
                "With these assumptions, we can describe the dynamics of iCasp9 and Blast R with the following differential equations:",
                "(Equation S2) (Equation S16)",
                "Equation S16 gives the final form of the paradoxical growth curve with the synergistic correction, and is used to improve data fitting (Figures 5D; Figure S4A, dotted blue lines). Together with the fitted parameters, the reduced system (Equations 1 and 2, with defined as Equation S16) was used to run parameter screens and dynamic simulations (Figure 5E-5G)."
            ],
            "subsections": []
        },
        {
            "title": "Parameter screening and stability analysis",
            "paragraphs": [
                "For numerical parameter screening and stability analysis, we computed some terms analytically to make the process faster and more efficient. The Jacobian of the reduced dynamical system (Equations 1 and 2) can be expressed as follows:",
                "(Equation S17)",
                "Here,",
                ". Note that in the operating range , and .",
                "Thus is required to achieve (the equilibrium point condition). With this assumption, the eigenvalues of the Jacobian at equilibrium are the roots of the following quadratic characteristic equation:",
                "Thus the sign of eigenvalues (root of ) of the matrix (Equation S17) can be solely determined by the sign of . If it is greater than zero, at least one of the eigenvalues has a real part greater than zero, making the associated equilibrium point unstable. If is less than zero, it's straightforward to deduce that the real parts of all eigenvalues are less than zero, making the equilibrium point stable. Based on this analysis, we screened the equilibrium points of the system and the corresponding sign of to determine the stability and type of each condition (Figure 5E).",
                "Besides the five major behavior categories described above (Figure 5E, surrounding plots), a small but significant portion (0.68% of total) of conditions appearing at the border between \"permissive\" and \"paradoxical\" types, could not be classified into any of the five types. To further investigate these cases we down-sampled the space from 201 x 201 to 21 x 21 conditions and plotted all the six (0.62% or total) unclassified curves, as well the permissive and paradoxical types next to this region (Figure S4F; grey, pink, and light blue respectively). Inspection of these curves revealed a transitional type between permissive and paradoxical, with the unusual equilibrium points caused by the nonlinearity of the introduced synergetic term. Note that the range of net growth rate of the system is around 0.09-0.04 defined by , and . The net growth rates of these curves around the unusual equilibrium points is significantly lower (-0.01~0.02), indicating those points are unstable. Therefore,"
            ],
            "subsections": []
        },
        {
            "title": "Gene constructs",
            "paragraphs": [
                "All constructs created in this work were assembled using standard restriction enzyme-based cloning and/or Gibson cloning (Gibson et al., 2009) . mAID and osTIR1 coding sequences were amplified from addgene #72827 and #72834 (Natsume et al., 2016) . iCasp9 coding sequence was amplified from addgene #15567 (Straathof et al., 2005) . PIN2, mGFP, and iaaM coding sequences (CDS) were codon optimized for expressing in mice and synthesized as dsDNA at Integrated DNA Technology together with all oligos for cloning. Coding sequences for screening indole-3-hydrolases were synthesized as cloning plasmid at Twist Bioscience. All constructs were cloned into the piggyBac plasmids (System Biosciences Inc.) driven by a synthetic version of human EF1A promoter."
            ],
            "subsections": []
        },
        {
            "title": "Tissue culture and cell lines",
            "paragraphs": [
                "CHO-K1 (Hamster cells, RRID:CVCL_0214, ATCC Catalog No. CCL-61) cells and their derivatives were grown on tissue culture grade plastic plates (Thermo Scientific) in Alpha MEM Earle's Salts (Irvine Scientifics), supplemented with 10% Tet System Approved FBS (ClonTech), 100 U/ml penicillin, 100 μg/ml streptomycin, 0.292 mg/ml L-glutamine (GIBCO) or 1x GlutaMax (GIBCO). The complete media is filtered with 0.22 micron filters (Falcon).",
                "For long-term culturing demonstrated in Figure 4 and Figure 6, cells were seeded in 24-well TC-treated plates (total media 500 μL per well) with imaging-grade plastic bottoms (ibidi inc.), and media was changed every 12 hours with one of the following methods: 1) adding and mixing 200 μL fresh media into the well, taking out the media, and putting back 500 μL, or 2) taking out the media, adding back 350 μL and adding 150 μL of fresh media. Both methods simulate a media refreshing rate of 0.693/day (equivalent to media half-life = 1 day). For movie S3, an additional centrifuge at around 2000 xg is applied for the old media to remove floating cells."
            ],
            "subsections": []
        },
        {
            "title": "Cell line engineering",
            "paragraphs": [
                "All cell lines used in this paper contained stable integrations of transgenes, and were typically clonal populations. To create each stable cell line, the following steps were followed: 1) Cells were first transfected with 800-1000 ng of plasmid DNA using Lipofectamine 2000 or Lipofectamine LTX. 2) 24-48 hours later, cells were transferred to selection media containing 10~50 ug/ml Blasticidin as"
            ],
            "subsections": []
        }
    ]
}