{
    "id": "US20180208907",
    "authors": [
        "Fabien Aubry",
        "Antoine Nougairéde",
        "Gilles Quérat",
        "Xavier De Lamballerie",
        "Ernest Andrew Gould",
        "Lauriane De Fabritus"
    ],
    "title": "METHOD FOR RAPID GENERATION OF AN INFECTIOUS RNA VIRUS",
    "date": "2015-06-19 00:00:00",
    "abstract": "The present invention relates to a method for rapid generation of an infectious RNA virus that completely eliminates the need of constructing a full-length c DNA, which covers the entire viral genome, cloning and propagating such full length c DNA.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to a method for rapid generation of an infectious RNA virus that completely eliminates the need of constructing a full-length cDNA, cloning and propagating of such full-length cDNA."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to method for rapid generation of infectious RNA virus"
                    ],
                    "num_characters": 211,
                    "outline_medium": [
                        "relate to method for rapid generation of infectious RNA virus"
                    ],
                    "outline_short": [
                        "relate to method for rapid generation of infectious RNA virus"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Development of molecular methods that enable production of infectious virus from DNA copies of their genomes has significantly improved our knowledge of RNA virus life cycles and pathogenesis, by permitting the development of “reverse genetics”, i.e., studies of the impact of specific mutations on the biological properties of viruses.",
                        "However, current methodologies for construction of infectious cDNA clones are unpredictable and laborious processes frequently associated with undesirable mutations or unstable/toxic clones in bacteria.",
                        "This has spawned great interest in alternative methods for generating RNA virus. Various methodological improvements, such as the use of alternative hosts, low-copy-number plasmids, cosmid vectors, bacterial artificial chromosomes, modified promoters or modified viral genome sequences with reduced cryptic bacterial promoter activity have been proposed.",
                        "Bacterium-free approaches were also developed for example with Tick-borne encephalitis (TBEV) by Gritsun and Gould in 1995 and with West Nile virus (WNV) and Dengue virus (DENV) by Edmonds et al. and Siridechadilok et al., respectively, in 2013.",
                        "Although they represented significant advances, these methods require substantial optimisation for each virus studied and do not provide a unified methodological process.",
                        "There is thus a long felt unfulfilled need for an alternative method for generating an infectious RNA virus, which is efficient, precise and prompt."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe current methodologies for construction of infectious cDNA clones",
                        "highlight limitations of current methodologies"
                    ],
                    "num_characters": 1465,
                    "outline_medium": [
                        "describe current methodologies for construction of infectious cDNA clones"
                    ],
                    "outline_short": [
                        "describe current methodologies for construction of infectious cDNA clones"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The inventors have shown that overlapping cDNA fragments, each covering a portion of the genome of a RNA virus, can give rise to a replicating virus without the use of a full-length cDNA or a plasmid or a vector comprising such full length cDNA.",
                        "The inventors thus put light that overlapping double-stranded DNA fragments, each covering a portion of the viral genome, spontaneously enable recombination and synthesis of a DNA copy of the complete viral genome in cellulo.",
                        "Consequently, in a first aspect, the invention relates to a method for generating an infectious RNA virus comprising the following steps:\n\n\n- - a) introduction of a promoter of DNA-dependent RNA polymerase in\n    position 5′ and optionally a terminator and a RNA polyadenylation\n    sequence in position 3′ of the entire genome of a RNA virus;\n  - b) amplification of the entire viral genome as prepared in step a)\n    including said promoter and optionally said terminator and RNA\n    polyadenylation sequence, in at least 2, preferably at least 3, 4, 5\n    or 6 overlapping cDNA fragments;\n  - c) transfection of said cDNA fragments into a host cell;\n  - d) incubation of the host cell of step c); and\n  - e) recovery of the infectious RNA virus from said incubated host\n    cell.",
                        "In a second aspect, the invention pertains to the use of the method for generating an infectious RNA virus as disclosed herein, and/or of the RNA virus obtained according to said method, for reverse genetic analysis.",
                        "In a third aspect, the invention relates to the use of the method for generating an infectious RNA virus as disclosed herein, and/or of the RNA virus obtained according to said method, for the safe and efficient shipment of infectious RNA virus."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce method for generating infectious RNA virus using overlapping cDNA fragments",
                        "describe steps of method",
                        "highlight advantages of method"
                    ],
                    "num_characters": 1721,
                    "outline_medium": [
                        "introduce method for generating infectious RNA virus using overlapping cDNA fragments"
                    ],
                    "outline_short": [
                        "introduce method for generating infectious RNA virus using overlapping cDNA fragments"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "The inventors founded out that overlapping double-stranded DNA fragments, each covering a portion of the viral genome, spontaneously enable recombination and synthesis of a DNA copy of the complete viral genome after transfection. Based on this surprising discovery, the inventors developed a novel approach for generating an infectious RNA virus which does not require cloning and propagation of a full-length cDNA into bacteria.",
                        "In a first aspect, the invention thus relates to a method for generating an infectious RNA virus comprising the following steps:\n\n\n- - a) introduction of a promoter of DNA-dependent RNA polymerase in\n    position 5′ and optionally a terminator and a RNA polyadenylation\n    sequence in position 3′ of the entire genome of a RNA virus;\n  - b) amplification of the entire viral genome as prepared in step a)\n    including said promoter and optionally said terminator and RNA\n    polyadenylation sequence, in at least 2, preferably at least 3, 4, 5\n    or 6 overlapping cDNA fragments;\n  - c) transfection of said cDNA fragments into a host cell;\n  - d) incubation of the host cell of step c); and\n  - e) recovery of the infectious RNA virus from said incubated host\n    cell.",
                        "Based on their thorough researches, the inventors overcame a technical prejudice by developing a method which exonerates from:\n\n\n- - constructing a full length cDNA, covering the entire viral genome;\n    and/or\n  - the use of a plasmid or a vector comprising such full length cDNA;\n    and/or\n  - the necessity of reconstructing the full length cDNA or the entire\n    viral genome before transfection into a host cell; and/or\n  - modifying the viral genome such as incorporating not naturally\n    occurring recombination or restriction enzyme site; and/or\n  - using of helper virus or other viral protein.",
                        "The method of the invention, also referred to as “Infectious Subgenomic Amplicons” or “ISA”, is thus a very simple procedure able to expedite production of infectious RNA viruses within days, with perfect control of the viral sequences and starting from a variety of initial sources including pre-existing infectious clones, viral RNA or de novo synthesized DNA genomic sequences. Unlike the other bacterium free approaches, disclosed in prior art, the method of the invention does not require any additional step beside preparation of cDNA fragments. The assembly of the construct is not made in vitro by Gibson assembly or circular polymerase extension cloning before the transfection but through a recombination process that directly takes place in cellulo which greatly facilitates and shortens the methodology.",
                        "As used herein, the expression “generation of infectious RNA viruses” refers to the production of a RNA virus, in a wild type form or genetically modified form, according to the method of the invention. The term “infectious virus” refers to a virus having the ability to reproduce, i.e. able to amplify the viral genome in a host cell, the packaging of the viral genome in a cell and/or the release of infectious viral particles from a cell. It is noteworthy that a virus can be pathogenic or non pathogenic and still be infectious.",
                        "As used herein, the expression “not naturally occurring recombination site” refers to sequences allowing site-specific recombination that can be exemplified by the Cre-Lox or FLP-FRT recombination systems. Restriction enzyme site refers to sequences allowing site-specific cutting of double stranded DNA by restriction enzymes that can be exemplified by the NotI or AluI endonucleases.",
                        "Preferably, the infectious RNA virus that the method aims to generate (also referred to as “target virus” herein) is a single stranded positive or negative RNA virus. More preferably, said virus is a single stranded positive RNA virus. More preferably, said virus is selected from the group consisting of flavivirus, alphavirus and enterovirus.",
                        "A non-limiting list of flaviviruses comprises Dengue virus (DENV), Yellow fever virus (YFV), St Louis encephalitis (SLEV), Japanese encephalitis viruses (JEV), Murray Valley encephalitis (MVEV), West Nile virus (WNV), Rocio (ROCV), Tick-borne encephalitis virus (TBEV), Omsk hemorrhagic fever (OMSKV), Kyasanr Forrest disease (KFDV), Powassan (POWV). Preferably, said flavivirus is selected from the group consisting of:\n\n\n- - Japanese encephalitis viruses (JEV); such as a genotype I strain\n    (JEV I) or a genotype III strain (JEV III),\n  - West Nile virus (WNV), such as a genotype 2 strain;\n  - Dengue virus (DENV), such as a serotype 4 strain;\n  - Yellow fever virus (YFV), such as a South American wild-type strain;\n    and\n  - Tick-borne encephalitis virus (TBEV), such as a Far-Eastern subtype\n    strain.",
                        "More preferably, said flavivirus is dengue virus.",
                        "A non-limiting list of alphaviruses comprises Chikungunya virus (CHIK), Eastern equine encephalitis (EEE), Western equine encephalitis virus, Venezuelan equine encephalitis virus (VEE), Mayaro virus (MAY), O'nyong'nyong virus (ONN), Sindbis virus, Semliki Forest virus, Barmah Forest virus, Ross River virus, Una virus, Tonate virus. Preferably, said alphavirus is Chikungunya virus.",
                        "A non-limiting list of enteroviruses comprises Coxsackie, Echovirus, Poliovirus, and Rhinovirus. Preferably, said enterovirus is Coxsackie, more preferably Coxsackie B virus.",
                        "Alternatively, said virus is a single-stranded negative strand RNA virus. More preferably, said virus is a paramyxovirus, an arenavirus, a filovirus, a rhabdovirus, a bunyavirus or an influenza virus.",
                        "The method of the invention comprises a step a) of introducing a promoter of DNA-dependent RNA polymerase in position 5′ of the entire genome of a RNA virus. Optionally, said step a) further comprises the introduction of a terminator and a RNA polyadenylation sequence in position 3′ of the entire genome of a RNA virus.",
                        "It is noteworthy that when the genome of the target virus is poly-adenylated, such as alphavirus genome, step a) is a step of introducing a promoter of DNA-dependent RNA polymerase in position 5′ and a terminator and a RNA polyadenylation sequence in position 3′ of the entire genome of a RNA virus.",
                        "By including, at the 5′ terminus of the first cDNA fragment, a promoter of DNA-dependent RNA polymerase, and at the 3′ terminus of the last cDNA fragment a ribozyme sequence and a signal sequence for RNA poly-adenylation, the cDNA fragments are transcribed as a full-length RNA genome with authentic 5′ and 3′ termini.",
                        "Preferably, said promoter of DNA-dependent RNA polymerase in position 5′ is the human cytomegalovirus promoter (pCMV), as depicted in SEQ ID No 1. Preferably, said terminator and RNA polyadenylation sequence is respectively the hepatitis delta ribozyme and the simian virus 40 polyadenylation signal (HDR/SV40 pA). The sequence of HDR/SV40 pA is depicted in SEQ ID No: 2.",
                        "Consequently, step a) provides for the complete viral genome of the infectious RNA virus to generate, flanked respectively in 5′ and 3′ by the human cytomegalovirus promoter (pCMV) (SEQ ID No:1) and the hepatitis delta ribozyme followed by the simian virus 40 polyadenylation signal (HDR/SV40 pA) (SEQ ID No:2).",
                        "The method of the invention comprises a step b) of amplification of the entire viral genome in several overlapping cDNA fragments.",
                        "In step b), the entire viral genome corresponds to the entire viral genome as prepared in step a), i.e. which includes said promoter and optionally said terminator and RNA polyadenylation sequence.",
                        "As used herein, the expression “overlapping cDNA fragments”, cDNA fragments”, also designated as “amplicons” or “DNA subgenomic fragments” or “subgenomic amplicons” are double-stranded DNA fragments covering only a portion of the viral genome of a RNA virus. Such fragments correspond to “subgenomic fragments”. The inventors enlightened that, when such fragments are transfected within a cell, they surprisingly spontaneously recombine in cellulo to reconstitute the entire viral genome. Said recombination occurs even if the viral genome is not genetically modified to incorporate additional and not naturally occurring recombination site. Put in other words, said recombination occurs with wild type viral genomes.",
                        "cDNA fragments according to the invention encompass:\n\n\n- - DNA fragments obtained by amplification, for example by PCR; as well\n    as\n  - DNA fragments obtained de novo.",
                        "Typically, said cDNA fragments may be infectious or non-infectious.",
                        "As used herein, the expression “full-length cDNA”, refers to a DNA which comprises the entire viral genome of a virus into a single piece.",
                        "As used herein, the expression “cDNA fragment covering a portion of the entire viral genome”, refers to a DNA fragment which comprises a portion of the entire viral genome. Typically, the cDNA fragments according to the invention recombine spontaneously upon transfection in cells to constitute a DNA copy of the entire viral genome, flanked at the 5′ terminus by a promoter of DNA-dependent RNA polymerase, and at the 3′ terminus by a termination sequence and a signal sequence for RNA poly-adenylation. This construct is transcribed as a full-length RNA genome with authentic 5′ and 3′ termini by the cellular machinery.",
                        "On the contrary, a “full-length cDNA covering the entire viral genome” is a single cDNA which encodes for the totality of the viral genome.",
                        "Preferably, step b) of the method of the invention allows the production of from 2 to 15 overlapping cDNA fragments, preferably of 3, 4, 5, or 6 overlapping cDNA fragments. Typically, said cDNA fragments are of about 2 kb to about 6 kb, preferably of about 4 kb and each cDNA fragment has 70 to 100 bp overlapping regions.",
                        "Preferably, said overlapping cDNA fragments of step b) are:\n\n\n- - fragments of infectious clone not amplified by PCR;\n  - fragments of infectious clone amplified by PCR;\n  - fragments of non infectious clone not amplified by PCR;\n  - fragments of non infectious clone amplified by PCR;\n  - fragments synthesised de novo not amplified by PCR;\n  - fragments synthesised de novo amplified by PCR; and\n  - fragments obtained by reverse-transcription PCR from the viral\n    genome.",
                        "In a preferred embodiment, said overlapping cDNA fragments may be obtained thanks to the primers disclosed in the table as follows, depending on the target virus to generate:",
                        "Said primers are useful for obtaining overlapping cDNA fragments by PCR.",
                        "Consequently, in one embodiment, step b) of the method of the invention is a step of amplification of the entire viral genome as prepared in step a):\n\n\n- - in 3 overlapping cDNA fragments using the primers as depicted in SEQ\n    ID No 3 to SEQ ID No: 8, or in 6 overlapping cDNA fragments using\n    the primers as depicted in SEQ IN No: 39 à 50, when said infectious\n    RNA virus is JEV I; or\n  - in 3 overlapping cDNA fragments using the primers as depicted in SEQ\n    ID No: 9 to SEQ ID No: 14, when said infectious virus RNA is JEV II;\n    or\n  - in 3 overlapping cDNA fragments using the primers as depicted in SEQ\n    ID No: 15 to SEQ ID No: 20, when said infectious RNA virus is WNV;\n    or\n  - in 3 overlapping cDNA fragments using the primers as depicted in SEQ\n    ID No: 21 to SEQ ID No: 26, when said infectious RNA virus is TBEV;\n    or\n  - in 3 overlapping cDNA fragments using the primers as depicted in SEQ\n    ID No: 27 to SEQ ID No: 32, when said infectious RNA virus is YFV;\n    or\n  - in 3 overlapping cDNA fragments using the primers as depicted in SEQ\n    ID No: 33 to SEQ ID No: 38, when said infectious RNA virus is\n    DENV-4; or\n  - in 3 overlapping cDNA fragments using the primers as depicted in SEQ\n    ID No: 51 to SEQ ID No: 56, when said infectious RNA virus is CHIKV;\n    or\n  - in 3 overlapping cDNA fragments using the primers as depicted in SEQ\n    ID No: 57 to SEQ ID No: 62, when said infectious RNA virus is CV-B3.",
                        "The method of the invention comprises a step c) of transfection of said cDNA fragments into a host cell.",
                        "As used herein, the term “transfection” refers to the introduction of nucleic acids (either DNA or RNA) into eukaryotic or prokaryotic cells or organisms. A cell that has taken up the exogenous nucleic acid is referred to as a “host cell” or “transfected cell.” Transfection may be accomplished by a variety of means known in the art including calcium phosphate-DNA co-precipitation, DEAE-dextran-mediated transfection, polybrene-mediated transfection, electroporation, microinjection, liposome fusion, lipofection, protoplast fusion, retroviral infection, and biolistics.",
                        "Preferably, the host cell of step c) is a permissive cell, which enables the recovery of an infectious virus. Typically, permissive cells employed in the method of the present invention are cells which, upon transfection with the cDNA fragments, are capable of realising a complete replication cycle of the virus, including the production of viral particles. Preferably, said host cell is selected from the group consisting of SW13, BHK-21, HEK 293 and Vero cell lines.",
                        "In a preferred embodiment, step c) is a step of direct transfection of the cDNA fragments obtained in step b) as such, and step c) occurs directly after step b). In this specific embodiment, cDNA fragments as such are transfected into the host cells. Said fragments spontaneously recombine in cellulo into a DNA copy of the entire viral genome flanked at the 5′ terminus by a promoter of DNA-dependent RNA polymerase, and at the 3′ terminus by a termination sequence and a signal sequence for RNA poly-adenylation. As previously mentioned, the method of the invention overcomes a technical prejudice since it exonerates from transfecting a full length cDNA, covering the entire viral genome, as such. Besides, the method is free from using a plasmid or a vector comprising said full-length cDNA as such and/or the necessity of reconstructing the full cDNA or the entire viral genome before transfection into a host cell. On the contrary, the method relies on the transfection of the overlapping cDNA fragments, each comprising a portion of the viral genome. The transfection of overlapping double-stranded DNA fragments, covering the entire genome of an RNA virus, into permissive cells enables recombination and synthesis of a DNA copy of the complete viral genome in cellulo.",
                        "In an alternative embodiment, step c) is a step of transfection of plasmids each comprising a cDNA fragment obtained in step b), wherein each cDNA fragment is incorporated in individual and separate plasmids or vectors. In this embodiment, each cDNA fragment is incorporated into individual and separate plasmids or vectors. Each plasmid or vector comprises a single fragment of cDNA. In this embodiment, the entire viral genome is reconstituted after transfection.",
                        "In one embodiment, the method of the invention comprises a further step b′) after step b) and prior to step c) of purification of the overlapping cDNA fragments. Said purification can be performed by any known techniques, preferably through a chromatography column.",
                        "The method of the invention comprises a step d) of incubation of the host cells, which preferably lasts from 3 to 9 days. During said incubation step, the transfected cDNA fragments spontaneously recombine in the host cells to constitute a DNA copy of the entire viral genome, flanked at the 5′ terminus by a promoter of DNA-dependent RNA polymerase, and at the 3′ terminus by a termination sequence and a signal sequence for RNA poly-adenylation. This construct is transcribed as a full-length RNA genome with authentic 5′ and 3′ termini by the cellular machinery.",
                        "In an alternative embodiment, the invention relates to a method for generating an infectious RNA virus in vivo.",
                        "In this embodiment, said method comprises the following steps:\n\n\n- - a) introduction of a promoter of DNA-dependent RNA polymerase in\n    position 5′ and optionally a terminator and a RNA polyadenylation\n    sequence in position 3′ of the entire genome of a RNA virus;\n  - b) amplification of the entire viral genome as prepared in step a)\n    including said promoter and optionally said terminator and RNA\n    polyadenylation sequence, in at least 2, preferably at least 3, 4, 5\n    or 6 overlapping cDNA fragments;\n  - c′) inoculation of said cDNA fragments into an animal model;\n  - e′) recovery of the infectious RNA virus from a biological sample\n    obtained from said animal.",
                        "All the previously disclosed technical data are applicable here.",
                        "As used herein, the expression “animal model” is a multicellular heterotrophic eukaryote, preferably a mammal, more preferably a non-human mammal. In a preferred embodiment, said animal model is a rodent, more preferably a mouse.",
                        "As used herein, the term “biological sample” as used herein refers to any biological sample obtained from the animal model. In the method of the present invention, the sample may comprise any body fluid. Examples of test samples include blood, serum, plasma, nipple aspirate fluid, urine, saliva. Alternatively, said biological sample is a tissue obtained from said animal model. Preferably, said biological sample is selected from the group consisting of adipose tissue, mesangial tissue, hepatic tissue, pancreatic tissue, muscle tissue, blood-vessel tissue, neural tissue and brain and spleen tissue. More preferably, said biological sample is brain and spleen tissue.",
                        "As used herein, the term “individual” refers to an animal, in some embodiments a mammal, and in some embodiments a human.",
                        "Typically, the step c′) of “inoculation of said cDNA fragments into an animal model refers to a step in which cDNA fragments refers to a step of administration to the animal model. Put in other words, said step preferably allows the introduction of the cDNA fragment within the animal model or cells of said model. The cDNA fragments may be delivered or administered to a subject or cell using a variety of means, including, but not limited to oral, intradermal, ophthalmic, sublingual, buccal, intramuscular, intraveneous, intra-arterially, nasal, intraperitoneal, intracranial, intracerebroventricular, intracerebral, intravaginal, intrauterine, rectal, parenteral. Preferably, step c′) is performed by intraperitoneal injection, intradermal injections or intracerebral injection.",
                        "In a second aspect, the invention pertains to the use of the method for generating an infectious RNA virus as disclosed herein, and/or of the RNA virus obtained according to said method, for reverse genetic analysis.",
                        "The method of the invention has the potential to generate the design of large reverse genetics experiments for RNA viruses. It also has the capacity, specifically to modulate the characteristics of the viruses recovered from experimental procedures. Additionally, because DNA subgenomic fragments can conveniently be obtained by PCR, this method has the potential to conserve the genetic diversity of viral populations when starting from viral RNA. Error-prone PCR may be also be used to create artificial viral heterogeneity, e.g. for facilitating the selection of adapted viruses under various experimental selection conditions and, conversely, high-fidelity polymerases and clonal amplification templates may be used to control the degree of clonality of the viruses produced.",
                        "All the previously disclosed technical data are applicable here.",
                        "In a third aspect, the invention relates to the use of the method for generating an infectious RNA virus as disclosed herein, and/or of the RNA virus obtained according to said method, for the safe and efficient shipment of infectious RNA virus. Indeed, the method of the invention dramatically improves the safety and security of exchanges of RNA viruses, for example between scientific institutions. Indeed, said exchanges can take the form of separate shipment at room temperature of simple, non-infectious, DNA subgenomic fragments. Said fragments could then be combined and transfected by the recipient institute. The method thus enables rapid, simple and safe recovery of the infectious viral strain.",
                        "All the previously disclosed technical data are applicable here.",
                        "The following examples are given for the purpose of illustrating various embodiments of the invention and are not meant to limit the present invention in any fashion."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce method for generating infectious RNA virus",
                        "describe step a) of introducing promoter and terminator sequences",
                        "describe step b) of amplifying entire viral genome in overlapping cDNA fragments",
                        "describe step c) of transfecting cDNA fragments into host cell",
                        "describe step d) of incubating host cell",
                        "describe step e) of recovering infectious RNA virus",
                        "define \"generation of infectious RNA viruses\"",
                        "define \"infectious virus\"",
                        "describe preferred embodiments of target virus",
                        "describe step a) in more detail",
                        "describe step b) in more detail",
                        "describe overlapping cDNA fragments",
                        "describe recombination of cDNA fragments in cellulo",
                        "describe full-length cDNA",
                        "describe cDNA fragment covering a portion of entire viral genome",
                        "describe production of overlapping cDNA fragments",
                        "describe primers for obtaining overlapping cDNA fragments",
                        "describe step c) in more detail",
                        "describe host cell",
                        "describe transfection methods",
                        "describe permissive cells",
                        "describe direct transfection of cDNA fragments",
                        "describe alternative embodiment of transfection",
                        "describe purification of overlapping cDNA fragments",
                        "describe incubation of host cell",
                        "describe recombination and synthesis of DNA copy of entire viral genome",
                        "describe transcription of full-length RNA genome",
                        "describe alternative embodiment of method for generating infectious RNA virus in vivo",
                        "describe inoculation of cDNA fragments into animal model",
                        "describe recovery of infectious RNA virus from biological sample",
                        "define \"animal model\"",
                        "define \"biological sample\"",
                        "describe administration of cDNA fragments to animal model",
                        "describe use of method for reverse genetic analysis",
                        "describe use of method for safe and efficient shipment of infectious RNA virus",
                        "describe advantages of method for reverse genetic analysis",
                        "describe advantages of method for safe and efficient shipment of infectious RNA virus",
                        "describe examples of method",
                        "describe SEQ ID No 1",
                        "describe SEQ ID No 2"
                    ],
                    "num_characters": 20270,
                    "outline_medium": [
                        "introduce method for generating infectious RNA virus",
                        "describe step a) of introducing promoter and terminator sequences",
                        "describe step b) of amplifying entire viral genome in overlapping cDNA fragments",
                        "describe step c) of transfecting cDNA fragments into host cell",
                        "describe step d) of incubating host cell",
                        "describe step e) of recovering infectious RNA virus",
                        "define infectious RNA virus",
                        "describe preferred RNA viruses",
                        "describe step a) in more detail",
                        "describe step b) in more detail",
                        "describe overlapping cDNA fragments",
                        "describe step c) in more detail",
                        "describe host cells",
                        "describe step d) in more detail",
                        "describe alternative embodiment of method",
                        "describe use of method for reverse genetic analysis",
                        "describe use of method for safe and efficient shipment of infectious RNA virus",
                        "describe advantages of method",
                        "describe examples of method",
                        "describe further embodiments of method"
                    ],
                    "outline_short": [
                        "introduce promoter of DNA-dependent RNA polymerase in position 5′",
                        "amplify entire viral genome in overlapping cDNA fragments",
                        "transfect cDNA fragments into host cell",
                        "incubate host cell",
                        "recover infectious RNA virus from host cell",
                        "define infectious RNA virus",
                        "describe preferred embodiments of target virus",
                        "describe preferred embodiments of promoter and terminator",
                        "describe preferred embodiments of cDNA fragments",
                        "describe alternative embodiments of method"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1: ISA Method",
                            "paragraphs": [
                                "Methods",
                                "Cells, Viruses, Infectious Clones and Antibodies",
                                "Baby hamster kidney (BHK-21) cells were grown at 37° C. with 5% CO2 in a minimal essential medium (Life Technologies) with 7% heat-inactivated foetal bovine serum (FBS; Life Technologies) and 1% Penicillin/Streptomycin (PS; 5000 U/mL and 5000 μg/ml; Life Technologies). Human embryonic kidney 293 (HEK-293) cells and African green monkey kidney (VeroE6) cells were grown at 37° C. with 5% CO2 in the same medium than BHK-21 cells supplemented with 1% of non-essential amino acids (Life technologies). Human adrenal carcinoma (SW13) cells were grown at 37° C. with 5% CO2 in RPMI 1640 medium (Life Technologies) with 10% FBS and 1% PS. JEV genotype I strain JEV_CNS769_Laos_2009 (KC196115) was isolated in June 2009 from the cerebrospinal fluid of a patient in Laos16; YFV strain BOL 88/1999 (KF907504), isolated in 2009 from a human serum, was kindly provided by the National Center of Tropical Diseases (CENETROP), Santa-Cruz, Bolivia; DENV-4 strain Dak HD 34 460 (KF907503), isolated from a human serum, was kindly provided by Robert B Tesh from the Center for Biodefense and Emerging Infectious Diseases-Sealy Center for Vaccine Development (University of Texas Medical Branch, Galveston, Tex., USA); the infectious clone of JEV genotype III derived from the strain rp9 (DQ648597) was kindly provided by Yi-Ling Lin from the Institute of Biomedical Sciences, Academia Sinica, Taipei, Taiwan; the infectious clone of WNV was derived from the strain",
                                "Ouganda 1937 (M12294); the infectious clone of TBEV was derived from the strain Oshima 5.10 (AB062063); the infectious clone of CV-B3 was derived from the strain 2679 (KJ489414). A JEV-specific immune serum (obtain after vaccination against JEV) and monoclonal DENV-specific antibodies17 were used to perform direct immunofluorescence assays.",
                                "Preparation of cDNA Fragments",
                                "The complete genome flanked respectively in 5′ and 3′ by the human cytomegalovirus promoter (pCMV) (SEQ ID No:1) and the hepatitis delta ribozyme followed by the simian virus 40 polyadenylation signal (HDR/SV40 pA) (SEQ ID No:2) was amplified by PCR in three overlapping DNA fragments of approximately 4.8 kb, 3.0 kb and 4.3 kb (4.8 kb, 2.9 kb and 5.2 kb for CHIKV, 4.8 kb, 4.1 kb and 3.4 kb for TBEV and 2.9 kb, 2.8 kb and 2.7 kb for CV-B3) (see Table 1 under).",
                                "For WNV, TBEV, JEV III and CHIKV, DNA fragments were obtained by PCR using infectious clones (for JEV III, a mutation was corrected using fusion PCR).",
                                "For JEV I (all DNA fragments), DENV-4 (first and third fragments) and YFV (first and third fragments), DNA fragments were synthesized de novo (Genscript) and amplified by PCR. Amplicons were produced using the Platinum PCR SuperMix High Fidelity kit (Life Technologies).",
                                "The mixture (final volume: 50 μL) consisted of 45 μL of supermix, 2 μL of DNA template at 1 ng/μL (infectious clone or synthesized DNA fragment) and 200 nM of each primer. For DENV-4 and YFV, the second DNA fragment was obtained by RT-PCR from clarified cell supernatants. Nucleic acids were extracted using the EZ1 Virus Mini Kit v2 on the EZ1 Biorobot (both from Qiagen) according to the manufacturer's instructions and amplified with the Superscript III One-Step RT-PCR Platinum Taq Hifi kit (Life Technologies). The mixture (final volume: 50 μL) contained 25 μL of Reaction Mix, 2 μL of nucleic acid extract, 100 nM of each primer, 1 μL of Enzyme Mix and 20 μL of Nuclease-Free Water. Assays were performed on a Biometra T-professional Standard Gradient thermocycler with the following conditions: 94° C. for 2 min followed by 40 cycles of 94° C. for 15 sec, 64° C. for 30 sec, 68° C. for 5 min and a preliminary step of 50° C. for 30 min for the RT-PCR. Size of the PCR products was verified by gel electrophoresis and purified using Amicon Ultra—0.5 mL kit (Millipore) according to the manufacturer's instructions. When plasmid DNA was used as template, the complete removal of the template was ensured by a digestion step with the restriction enzyme Dpn1 (New England Biolabs) before transfection. To control the efficiency of this additional step, the inventors transfected (see below), as a control, only two cDNA fragments (the first and the second, 1 μg final). These controls did not produce any infectious virus.",
                                "Cell Transfection",
                                "1 μg final of either an equimolar mix of all cDNA fragments amplified by PCR or 1 μg of infectious clone of CV-B3 was incubated with 12 μl of Lipofectamine 2000 (Life Technologies) in 600 μl of Opti-MEM medium (Life Technologies). According to the manufacturer's instructions, the mixture was added to a 12.5 cm2 culture flask of sub-confluent cells containing 1 mL of medium without antibiotics. After 4 hours of incubation, the cell supernatant was removed, cells were washed twice (HBSS; Life Technologies) and 3 mL of fresh medium was added. The cell supernatant was harvested when gross cytopathic effect (CPE) was observed (3-9 days depending on the cell type and the virus growth speed) or 9 days posttransfection for non cytopathic viruses, clarified by centrifugation, aliquoted and stored at −80° C. Each virus was then passaged four times using the same cell type except for the DENV-4 and YFV for which VeroE6 and HEK-293 were respectively used. Passages were performed by inoculating 333 μL of clarified cell supernatantonto cells in a 12.5 cm2 culture flask containing 666 μL of medium: after 2 hours of incubation, cells were washed twice (HBSS) and 3 mL of fresh medium was added. The cell supernatant was harvested after 2-6 days, clarified by centrifugation, aliquoted and stored at −80° C. Clarified cell supernatants (viruses stocks) were used to perform quantification of viral RNA, TCID50 assay, direct immunofluorescence assay and whole-genome sequencing.",
                                "Real Time PCR and RT-PCR Assays",
                                "To assess the production of infectious viruses and ensure that positive detection was not the result of cDNA contamination, viral RNA was quantified and compared with the quantity of detected cDNA using the Access RT-PCR Core Reagent kit (Promega) with or without the reverse transcriptase. RNA was extracted using the EZ1 mini virus 2.0 kit and the EZ1 Biorobot (both from Qiagen) according to the manufacturer's instructions. The mixture (final volume: 25 μL) contained a standard quantity of AMV/Tfl 5× Reaction Buffer, 0.5 μM of each primer, 0.5 μL of dNTP Mix, 0.5 mM of MgSO4, 0.5 μL of AMV reverse transcriptase (only for RT-PCR), 0.5 μL of Tfl DNA polymerase, 15.5 μL of Nuclease-Free Water and 2 μL of extracted nucleic acids. Assays were performed using the CFX96 Touch′ Real-Time PCR Detection System (Biorad) with the following conditions: 50° C. for 15 min, 95° C. for 2 min, followed by 45 cycles of 95° C. for 15 sec, 60° C. for 40 sec. Data collection occurred during the 60° C. step. The difference between Cycle Threshold values (ct) obtained by Real time PCR and Real time RT-PCR assays has been used to assess viral RNA production. In addition, the amount of viral RNA expressed as dose detection limit (arbitrary unit; AU) was calculated from standard curves (nucleic acids from cell supernatants of cultured viruses were used as standard; five nucleic acid extracts were pooled and 10 μl-aliquots were stored at −80° C.).",
                                "Tissue Culture Infectious Dose 50 (TCID50) Assay",
                                "For each determination, a 96-well plate culture containing 20,000 BHK-21 cells in 100 μL of medium per well (added just before the inoculation) was inoculated with 50 μL of serial 10-fold dilutions of clarified cell culture supernatants: each row included 6 wells of the same dilution and two negative controls. The plates were incubated for 7 days and read for absence or presence of CPE in each well. The determination of the TCID50/mL was performed using the method of Reed and Muench18.",
                                "Direct Immuno-Fluorescence Assay (dIFA)",
                                "Direct IFA were performed using 12.5 cm2 culture flasks of SW13 cells for JEV I and JEV III, and VeroE6 cells infected respectively 2 and 6 days before using clarified cell supernatant (see above: passage of viruses). The supernatant was removed and the cells washed twice (HBSS; Invitrogen), trypsinised, harvested and diluted (1/5) with fresh medium. After cytocentrifugation of 150 μL of this cell suspension (3 min, 900 rpm; Cytospin, Thermo Scientific), the slides were dried, plunged 20 min in cold acetone for fixation, dried, incubated 30 min at 37° C. with appropriately diluted JEV-specific immune serum (see above) or monoclonal DENV-specific antibodies, washed twice with PBS, washed once with distilled water, dried, incubated 30 min at 37° C. with the appropriately diluted FITC-conjugated secondary antibody and Evans blue counterstain, washed twice with PBS, washed once with distilled water, dried, mounted and read using a fluorescence microscope.",
                                "Sequence Analysis of the Full-Length Genome",
                                "Complete genome sequencing was performed using the Ion PGM Sequencer19 (Life Technologies) and analyses conducted with the CLC Genomics Workbench 6 software. Virus supernatants were first clarified and treated with the Benzonase nuclease HC >99% (Novagen) at 37° C. overnight. Following RNA extraction (no RNA carrier was used; see above) using the EZ1 mini virus 2.0 kit and the EZ1 Biorobot (both from Qiagen), random amplification of nucleic acids was performed as previously described20. Amplified DNA was analysed using the Ion PGM Sequencer according to the manufacturer's instructions. The read obtained were trimmed: first using quality score, then by removing the primers used during the random amplification and finally at the 5′ and 3′ extremities by removing systematically 6 nucleotides. Only reads with a length greater than 29 nucleotides are used and mapped to the original genome sequence used as a reference. Mutation frequencies (proportion of viral genomes with the mutation) for each position were calculated simply as the number of reads with a mutation compared to the reference divided by the total number of reads at that site.",
                                "Results",
                                "The inventors developed a simple and versatile reverse genetics that facilitates the recovery of infectious RNA viruses from genomic DNA material without requiring cloning, propagation of cDNA into bacteria or in vitro RNA transcription. Their working hypothesis was that transfection of overlapping double-stranded DNA fragments, covering the entire genome of an RNA virus, into permissive cells would spontaneously enable recombination and synthesis of a DNA copy of the complete viral genome. By including at the 5′ terminus of the first (5′) DNA fragment, a promoter of DNA-dependent RNA polymerases, and at the 3′ terminus of the last (3′) DNA fragment a ribozyme sequence and a signal sequence for RNA poly-adenylation, the inventors anticipated that this genomic DNA copy would be transcribed as a full-length RNA genome with authentic 5′ and 3′ termini that would be efficiently exported out of the nucleus (in the case of a virus replicating in the cytoplasmic compartment).",
                                "The inventors first tested this hypothesis with 6 flaviviruses (i.e., arthropod-borne enveloped viruses with a single-stranded RNA genome of positive polarity that replicate in the cytoplasm of infected cells) that represent major flaviviral evolutionary lineages: two Japanese encephalitis viruses (JEV; genotype I (JEV I) and genotype III (JEV III)), one genotype 2 West Nile virus (WNV), one serotype 4 dengue virus (DENV-4), one wild-type strain of Yellow fever virus (YFV) and one Far-Eastern subtype Tick-borne encephalitis virus (TBEV) (Table 1).",
                                "Entire genomes were amplified by PCR in 3 DNA fragments of approximately 4 kb, each with 70-100 bp overlapping regions. The first and last fragments were flanked respectively in 5′ and 3′ by the human cytomegalovirus promoter (pCMV) and the hepatitis delta ribozyme followed by the simian virus 40 polyadenylation signal (HDR/SV40 pA) (FIG. 1). PCR products were column-purified, and 1 μg of an equimolar mix of all fragments was transfected into SW13 and/or BHK-21 cell lines, which, ensure efficient recovery of flaviviral infectious genomes. Cell supernatant media from these infectious cultures were serially passaged four times using the same cell types, enabling the isolation of JEV I, JEV III, TBEV and WNV. For more demanding viruses, isolation could be achieved by passaging in additional permissive cells (e.g., DENV-4: VeroE6 cells; YFV: HEK-293 cells). Virus replication after four serial passages was demonstrated for each virus using a combination of the following criteria:\n\n\n- - (i) production of viral genomes in cell supernatant medium using\n    real time RT-PCR methods,\n  - (ii) production of infectious particles in cell supernatant medium\n    using TCID50 assays,\n  - (iii) detection of cytopathic effect (CPE),\n  - (iv) detection of viral antigens by direct immunofluorescence\n    assays, and\n  - (v) complete viral genome sequencing using next generation\n    sequencing (NGS) method.",
                                "The robustness, flexibility and versatility of the methods were further challenged as follows. Firstly, the inventors decreased the size and increased the number of overlapping fragments combined for transfection. This was exemplified in the case of JEV I, for which the ISA method generated infectious viruses, when using up to 6 overlapping amplicons of approximately 2 kb. Secondly, they applied the ISA method to viruses with a single-stranded RNA genome of positive polarity that belong to different families: Chikungunya virus (CHIKV, an enveloped virus, family Togaviridae) and Coxsackievirus B3 (CV-B3, a nonenveloped virus, family Picornaviridae). Again, infectious viruses could be isolated following transfection and four passages in HEK-293 cells (CHIKV) or BGM cells (CV-B3) (Table 2 under). Furthermore, the inventors used as a control the CV-B3 obtained following transfection of a plasmid-bearing infectious genome and they obtained similar results in terms of infectivity and sequence data (Table 2).",
                                "Summary of the different viruses produced in this study: the specific name of the strain, the origin of the initial material (DNS, De Novo Synthesis; I.C., Infectious Clone; or Viral RNA) used as the template for production of the first (I), second (II) and third (III) fragment, the cell line used for the transfection and the passages, the relative quantification of the amount of viral RNA and infectious titres in cell supernatants at the fourth passage by real time RT-PCR and TCID50 assay, the presence or absence of cytopathic effect (CPE) as well as the research of viral antigens by direct immunofluorescence assay (dIFA). Complete viral genome sequences were obtained using NGS technology. dN and dS correspond respectively to the number of non-synonymous substitutions per non-synonymous site and the number of synonymous substitutions per synonymous site. * Results obtained by transfection of six overlapping fragments. ¶ Results obtained by transfecting directly the CV-B3 plasmid-bearing infectious clone. N/A and AU mean not available and arbitrary unit respectively.",
                                "Thirdly, the inventors demonstrated the capability of ISA method to generate genetically modified viruses in days. This was exemplified by the PCR-based correction of a frame-shift mutation (1915del) in fragment one of a defective JEV III infectious clone and the subsequent recovery of the corresponding virus (Supplementary Methods). They were also able to produce chimeric viruses by exchanging the first DNA fragment (encoding structural proteins) of genotype I and III JEVs. Despite 11 mismatches in the overlapping region of the first two fragments, transfection resulted in the production of intergenotypic JEV I/JEV III and JEV III/JEV I chimeras. Analysis of complete genomic sequences established at the fourth passage, using NGS, showed that the genetic drift (rate of sequence change) was modest (ranging from 1.45E-03 to 9.00E-05 substitutions per site when considering fixed mutations). A majority of non-synonymous mutations, the presence of shared mutations amongst the different JEV strains (7/85), and the non-random distribution of mutations (at frequency above 10%) along the genome (with both hot spots and highly conserved regions) denoted adaptation to the cell culture conditions.",
                                "The mutation rate varied according to the cells used for isolation and, as expected, was higher in viruses derived from low-passage strains than in those derived from culture-adapted strains. In conclusion, the ISA method is a very simple procedure with which to expedite production of infectious genetically modified RNA viruses within days, with perfect control of the viral sequences and starting from a variety of initial sources including pre-existing infectious clones, viral RNA or de novo synthesized DNA genomic sequences. This technique has the future potential to generate the design of large reverse genetics experiments for RNA viruses, on a scale that could not previously have been considered. It also has the capacity, specifically to modulate the characteristics of the viruses recovered from experimental procedures. Additionally, because DNA subgenomic fragments can conveniently be obtained by PCR, this method has the potential to conserve the genetic diversity of viral populations13 when starting from viral RNA. Error-prone PCR may be also be used to create artificial viral heterogeneity, e.g. for facilitating the selection of adapted viruses15 under various experimental selection conditions and, conversely, high-fidelity polymerases and clonal amplification templates may be used to control the degree of clonality of the viruses produced.",
                                "Finally, the method of the invention has the potential to revolutionise the safety and security of future exchanges of RNA viruses between scientific institutions, by the separate shipment at room temperature of simple, on-infectious, DNA subgenomic fragments that, could then be combined and transfected by the recipient institute, enabling rapid, simple and safe recovery of the infectious viral strain."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "grow cells",
                                "prepare cells, viruses, infectious clones, and antibodies",
                                "amplify genome by PCR in three overlapping DNA fragments",
                                "obtain DNA fragments by PCR using infectious clones",
                                "synthesize DNA fragments de novo",
                                "amplify DNA fragments by PCR",
                                "produce amplicons using Platinum PCR SuperMix High Fidelity kit",
                                "extract nucleic acids using EZ1 Virus Mini Kit v2",
                                "perform RT-PCR from clarified cell supernatants",
                                "quantify viral RNA using Access RT-PCR Core Reagent kit",
                                "transfect cells with cDNA fragments",
                                "incubate cells with Lipofectamine 2000",
                                "harvest cell supernatant",
                                "clarify cell supernatant by centrifugation",
                                "passage viruses four times",
                                "perform TCID50 assay",
                                "perform direct immunofluorescence assay",
                                "sequence full-length genome using Ion PGM Sequencer",
                                "analyze sequence data using CLC Genomics Workbench 6 software",
                                "calculate mutation frequencies",
                                "test hypothesis with 6 flaviviruses",
                                "amplify entire genomes by PCR in 3 DNA fragments",
                                "transfect cells with overlapping DNA fragments",
                                "passage viruses four times",
                                "demonstrate virus replication",
                                "decrease size and increase number of overlapping fragments",
                                "apply ISA method to Chikungunya virus and Coxsackievirus B3",
                                "use plasmid-bearing infectious genome as control",
                                "correct frame-shift mutation in JEV III infectious clone",
                                "produce chimeric viruses by exchanging DNA fragments",
                                "analyze complete genomic sequences using NGS",
                                "calculate genetic drift",
                                "demonstrate adaptation to cell culture conditions",
                                "vary mutation rate according to cells used",
                                "conclude ISA method is simple and versatile",
                                "discuss potential applications of ISA method"
                            ],
                            "num_characters": 18071,
                            "outline_medium": [
                                "grow cells",
                                "prepare cDNA fragments",
                                "transfect cells with cDNA fragments",
                                "harvest cell supernatant",
                                "passage viruses",
                                "quantify viral RNA",
                                "perform TCID50 assay",
                                "detect cytopathic effect",
                                "perform direct immunofluorescence assay",
                                "sequence full-length genome",
                                "test hypothesis with flaviviruses",
                                "amplify entire genomes by PCR",
                                "transfect cells with PCR products",
                                "passage viruses in permissive cells",
                                "demonstrate virus replication",
                                "challenge method with smaller fragments",
                                "apply method to other viruses",
                                "summarize results"
                            ],
                            "outline_short": [
                                "describe cell culture conditions",
                                "prepare cDNA fragments",
                                "transfect cells with cDNA fragments",
                                "harvest and passage viruses",
                                "quantify viral RNA using real-time PCR",
                                "perform TCID50 assay",
                                "detect viral antigens using direct immunofluorescence",
                                "sequence full-length genome using next-generation sequencing",
                                "summarize results of ISA method"
                            ]
                        },
                        {
                            "title": "Example 2: Method ISA with cDNA Fragments in Individual and Separate Plasmids",
                            "paragraphs": [
                                "The inventors further illustrated the ISA method in the specific embodiment where step c) is a step of transfection of plasmids or vectors comprising a cDNA fragment obtained in step b), wherein each cDNA fragment is in individual and separate plasmid or vector.",
                                "This experiment was performed using three plasmids containing the same fragments of the Japanese Encephalitis virus genome (Genotype I, Laos strain) as those previously used for recovering infectious virus by the ISA method after PCR amplification.",
                                "The three plasmids were linearised by digestion with the restriction enzyme Fse I and directly transfected in equimolar quantity (1 μg final) into SW13 cells without prior PCR amplification. After 9 days and 1 passage, the virus was successfully recovered from culture."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "transfect plasmids containing cDNA fragments into SW13 cells"
                            ],
                            "num_characters": 783,
                            "outline_medium": [
                                "transfect plasmids into cells"
                            ],
                            "outline_short": [
                                "transfect plasmids containing cDNA fragments into cells"
                            ]
                        },
                        {
                            "title": "Example 3: Application of the Method ISA In Vivo",
                            "paragraphs": [
                                "Overlapping fragments covering the entire genome of RNA viruses and flanked respectively at 5 and 3′ by promoter of DNA-dependent RNA polymerase and terminator/RNA polyadenylation signal were prepared using the method of the invention.",
                                "These DNA fragments were directly inoculated to live animals and allowed to recover infectious virus from several animal samples. In addition, clinical surveillance of animals (appearance of symptom and significant weight loss) allowed to observed typical signs of infection.",
                                "**a) Experiment 1: Tick-Borne Encephalitis Virus (TBEV; Flavivirus)**",
                                "The inventors used a wild-type strain of tick-borne encephalitis virus (strain Oshima 5.10 (GenBank accession number AB062063)). They applied the method of the invention to DNA overlapping fragments.",
                                "Five-weeks-old C57Bl/6J female mice were inoculated with three DNA overlapping fragments.",
                                "The clinical course of the viral infection was monitored by following\n\n\n- - (i) the clinical manifestations of the disease (shivering, humpback,\n    dirty eyes, hemi- or tetra-paresia, hemiplegia or tetraplegia); and\n  - (ii) the weight of the mice exactly as described by Fabritus L et\n    al., 2015, Attenuation of Tick-Borne Encephalitis Virus Using\n    Large-Scale Random Codon Re-encoding. PLoS Pathog 11(3).",
                                "Brains and spleens were collected from sacrificed mice 14 days post-inoculation. Brains and spleens were grounded and centrifuged. The resulting supernatant was used to assess the presence of infectious virus.",
                                "The presence of infectious virus was assessed using molecular (real time RT-PCR) and classical cell culture methods (isolation of infectious viruses).",
                                "Using an initial amount of DNA ranging between 2 to 5 μg, and two different inoculation routes (intraperitoneal and intradermal injections), infectious viruses were detected from both brains and spleens. Clinical manifestations (significant weight losses and symptoms) of the diseases were also observed.",
                                "**b) Experiment 2: Intracerebral Inoculation of Suckling Mice**",
                                "The inventors used wild-type strains of tick-borne encephalitis virus (strain Oshima 5.10 (GenBank accession number AB062063)) and Japanese encephalitis (JEV_CNS769_Laos_2009 (GenBank accession number KC196115)). They used the method of the invention to generate the DNA overlapping fragments.",
                                "DNA overlapping fragments were used diluted in PBS or were mixed with a transfection reagent.",
                                "Suckling OF1 mice were inoculated by intracerebral injection of DNA overlapping fragments. The clinical course of the viral infection was monitored by following the clinical manifestation of the disease (shivering, lethargy). Brains were collected from sacrificed mice 6-12 days post-inoculation. Brains were grounded and centrifuged. The resulting supernatant was used to assess the presence of infectious virus.",
                                "The presence of infectious virus was assessed using molecular (real time RT-PCR) and classical cell culture methods (isolation of infectious viruses).",
                                "Using 2 μg of DNA, infectious viruses were detected in brains for both viruses (TBEV and JEV) and with or without addition of transfection reagent. Clinical manifestations of the diseases were also observed."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "prepare DNA overlapping fragments",
                                "inoculate DNA fragments into live animals",
                                "monitor clinical manifestations of disease",
                                "collect and analyze animal samples",
                                "detect infectious virus using molecular and classical methods",
                                "observe clinical manifestations of disease"
                            ],
                            "num_characters": 3190,
                            "outline_medium": [
                                "prepare DNA overlapping fragments",
                                "inoculate DNA fragments into animals",
                                "monitor clinical course of viral infection"
                            ],
                            "outline_short": [
                                "inoculate DNA fragments into live animals and recover infectious virus"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method for generating an infectious RNA virus comprising:\na) introducing a promoter of DNA-dependent RNA polymerase in position 5′ and optionally a terminator and a RNA polyadenylation sequence in position 3′ of the entire genome of a RNA virus;\nb) amplifying the entire viral genome as prepared in step a) including said promoter and optionally said terminator and RNA polyadenylation sequence, in at least 2, 3, 4, 5 or 6 overlapping cDNA fragments;\nc) transfecting said cDNA fragments into a host cell,\nd) incubating the host cell of step c); and\ne) recovering the infectious RNA virus from said incubated host cell.",
        "2. The method of claim 1, wherein said virus is a single stranded positive RNA virus.",
        "3. (canceled)",
        "4. The method of claim 1, wherein:\nsaid promoter of DNA-dependent RNA polymerase in position 5′ is the human cytomegalovirus promoter (pCMV); and/or\nsaid optional terminator and RNA polyadenylation sequence is respectively the hepatitis delta ribozyme and the simian virus 40 polyadenylation signal (HDR/SV40 pA).",
        "5. The method of claim 1, wherein step b) allows the production from 2 to 15 overlapping cDNA fragments.",
        "6. The method of claim 1, wherein said host cell is selected from the group consisting of SW13 and BHK-21, HEK 293 and Vero cell lines.",
        "7. The method of claim 1, wherein:\nstep (c) is a step of direct transfection of the cDNA fragments obtained in step (b) as such, and\nsaid step (c) occurs directly after step (b).",
        "8. The method of claim 1, wherein step c) is a step of transfecting plasmids or vectors comprising a cDNA fragment obtained in step (b), wherein each cDNA fragment is in individual and separate plasmid or vector.",
        "9. The method of claim 1, wherein said method further comprises a step (b′) after step (b) and prior to step (c) of purification of the overlapping cDNA fragments.",
        "10. The method of claim 1, wherein step (d) of incubation lasts from 3 to 9 days.",
        "11. The method of claim 1, wherein the transfected cDNA fragments of step (c) spontaneously recombine in the host cells during the incubation step (d).",
        "12. The method of claim 1 wherein said method is used-for reverse genetic analysis.",
        "13. The method of claim 1 wherein said method produces an infectious RNA virus-for the safe shipment of said infectious RNA virus.",
        "14. A method for generating an infectious RNA virus in vivo comprising:\na) introducing a promoter of DNA-dependent RNA polymerase in position 5′ and optionally a terminator and a RNA polyadenylation sequence in position 3′ of the entire genome of a RNA virus;\nb) amplifying the entire viral genome as prepared in step (a) including said promoter and optionally said terminator and RNA polyadenylation sequence, in at least 2, 3, 4, 5 or 6 overlapping cDNA fragments;\nc′) inoculating said cDNA fragments into an animal model; and\ne′) recovering the infectious RNA virus from a biological sample obtained from said animal.",
        "15. The method of claim 2, wherein said virus is a virus selected from the group consisting of flavivirus, alphavirus and enterovirus.",
        "16. The method according to claim 15, wherein said Flavivirus is selected from the group consisting of Japanese encephalitis viruses (JEV), West Nile virus (WNV); Dengue virus (DENV); Yellow fever virus (YFV); and Tick-borne encephalitis virus (TBEV).",
        "17. The method according to claim 15, wherein said alphavirus is Chikungunya.",
        "18. The method of claim 15, wherein said enterovirus is Coxsackie.",
        "19. The method of claim 5, wherein step b) allows the production of 3, 4, 5 or 6 overlapping cDNA fragments.",
        "20. The method of claim 9, wherein the purification step is through a chromatography column."
    ]
}