{
    "id": "US20180031517",
    "authors": [
        "Nathan Netzer",
        "Indrek Must",
        "Yupu Qiao",
        "Zhenqiang Wang",
        "Zhen Zhang",
        "Shi-Li Zhang"
    ],
    "title": "Devices, Systems and Methods for Use of Electrical Ion Sensors Based on Metal-Organic Supercontainers",
    "date": "2017-07-31 00:00:00",
    "abstract": "The disclosed apparatus, systems and methods relate to the use of metal-organic supercontainers as a size-selective ionophore by incorporation into a substrate for ion sensing electrodes.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "The disclosed technology relates generally to container molecules and in particular, to the systems, devices, methods, and design principles allowing the use of metal-organic supercontainers as a size-selective ionophore by incorporation into a mixed-matrix membrane for ion-selective electrodes. This has implications in a variety of industries in which there is a demand for rapid and efficient monitoring of molecular ions."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define technical field of invention"
                    ],
                    "num_characters": 426,
                    "outline_medium": [
                        "define technical field of invention"
                    ],
                    "outline_short": [
                        "define technical field of invention"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "The disclosure relates to the systems, devices, methods, and design principles allowing for the use of metal-organic supercontainers (MOSCs) as a size-selective ionophore. In various implementations, the MOSCs are incorporated into a substrate such as a mixed-matrix membrane (MMM) for ion-selective electrodes (ISEs). In various implementations, ion sensing—such as electrical ion sensing—has a variety of applications, including, but certainly not limited to, water quality and environmental control and the detection of charged species in electrolytes for chemical, biological, and medical monitoring.",
                        "Currently, one method of forming MMMs is to incorporate ion-binding receptors, also known as “ionophores,” with ion-exchange sites into a polymer matrix, allowing for mechanical stability and increased ion-selectivity. Another method incorporates charged ionophores without ion-exchange sites. Currently there are a variety of commercially available ionophores and protocols for fabricating ISEs with specific binding affinities to about 30 cations and anions.",
                        "While supramolecular host materials such as metal-organic frameworks (MOFs) have become popular in the electrical ion sensing field because they have favorable binding sites, MOFs are inherently insoluble in most common solvents and thus lack certain desirable characteristics needed for incorporation into ISEs, such as solution processability.",
                        "Thus, there is a need in the art for technologies that allow for rapid and precise monitoring of molecular ions for both environmental and biomedical applications."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce ion sensing technology",
                        "describe limitations of current ionophores",
                        "identify need for improved ion sensing technology"
                    ],
                    "num_characters": 1578,
                    "outline_medium": [
                        "discuss limitations of prior art"
                    ],
                    "outline_short": [
                        "discuss limitations of prior art"
                    ]
                },
                {
                    "title": "BRIEF SUMMARY",
                    "paragraphs": [
                        "To facilitate understanding of the disclosure, as used herein, the term “solid-liquid junction sensing interface” may be used to reference various embodiments of a sensing interface. In certain implementations, an MOSC is bound directly to a solid-contact. In further implementations a junction is formed between organic (MMM) and aqueous phases. For simplicity and brevity, and as would be understood, the MMM of the second definition may be referred to herein as a solid although it is truly an organic (solvent) phase with a phase transition.",
                        "In the various implementations, the ion sensing technology disclosed herein offers a significant improvement over the ion sensing technology found in the prior art, which does not have the capacity to accurately measure large molecular ions. Data provided herein demonstrates the ability of the disclosed system, devices and methods to accurately measure large molecular ions with an ISE using a MOSC incorporated into a substrate or scaffolding.",
                        "In certain embodiments, the disclosed is an improved apparatus for detection of molecular ions. The apparatus is designed to incorporate MOSCs into a substrate, which allows the MOSCs to selectively bind the desired molecular ion/s for accurate measurement using an ISE. The apparatus improves on the ion sensing capability of previously developed ISEs with incorporation of MOSC into the device, system or method.",
                        "According to certain embodiments, the ion sensing technology disclosed herein may be used to conduct analysis of water, sweat, blood, saliva and many other liquid samples. The liquid sample may consist of a complex matrix of small molecules, molecular ions, and elemental ions. Analysis of these samples can yield information regarding water contamination, an individual's physiological state or early disease diagnosis. For example, the glucose level in human sweat is closely correlated to the blood glucose level. The sweat lactate is potentially a very useful early indicator of pressure ischemia. Neurochemicals, as another example, which include neurotransmitters and important elemental ions are actively involved in cell growth, replication, response, and communication in the neuronal network.",
                        "Potentiometric sensors employing ion-binding receptors (ionophores) have been extensively studied in the prior art for selective detection of cations and anions. The prior art ionophores are mostly limited to detection of elemental and other small inorganic ions. The presently disclosed use of MOSCs as ionophores improves on the prior art in the ability to detect large molecular ions without resorting to high performance liquid chromatography and/or gas chromatography-spectrometry which require highly trained operators and expensive, bulky instrumentation. The unique structure of MOSCs creates chemically tunable exo- and endo-cavities enabling the design of novel ionophores for highly specific ion detection.",
                        "In various implementations, the device demonstrates a near-Nernstian response that allows for very accurate concentration measurements.",
                        "In various implementations, the device demonstrates many positive qualities including the lack of any observable leeching, shown in Example 2, and stability in a wide range of environments, shown in Example 3.",
                        "In certain implementations, the device can measure electrical response by using an ion sensing electrode constructed on the gate terminal of an ISFET, shown in Example 4.",
                        "One Example includes a chemically tunable metal-organic system including: a supercontainer including one or more of: an exo-cavity, an endo-cavity and a substrate, where the substrate is combined with the supercontainer to form a scaffold, and a reference probe, where the system is constructed and arranged to detect ions. Implementations of this Example may include one or more of the following features. The system where the system detects ions by measuring an electrical response. The system where the substrate includes: a mixed-matrix membrane, or a solid sensing surface. The system where the mixed-matrix membrane is a polymer matrix. The system where the solid sensing surface is selected from the group including of oxide, nitride, and metal. The system where the system measures electrical response using a solid-contact ion sensing electrode. The system where the system measures electrical response using an ion-sensing electrode with an inner filling solution and an internal Ag/AgCl reference electrode. The system where the system measures electrical response using an ion-sensing electrode constructed on an ion-sensitive field-effect transistor gate terminal. The device where the substrate is a mixed matrix membrane. The device where the mixed matrix membrane includes a variety of polymers. The device where the polymer is selected from a group including of polyvinyl chloride, polydimethylsiloxane, poly(methyl methacrylate), urushi, cellulose triacetate, poly aniline, poly urethane, siloprene, poly-(vinyl chloride-co-vinyl acetate-co-hydroxypropyl acrylate), and poly(vinyl chloride-co-vinyl acetate-co-vinyl alcohol). The device where the substrate is a solid sensing surface. The device where the solid sensing surface is selected from a group including of oxide, nitride, and metal. The device further including an ion-sensitive field-effect transistor. The system where the ion sensing electrode is a solid contact electrode and the substrate is placed on the electrode. The system where the system is placed on an ion-sensitive field-effect transistor gate terminal to measure drain current change of the ion-sensitive field-effect transistor. The system where the substrate is incorporated into the ion sensing electrode. The system where the plurality of metal organic super containers are MOSC-II-Co molecules.",
                        "Another Example includes a device for sensing ions including: a substrate, where the substrate includes metal organic super containers to form a scaffold, and an ion sensing electrode. The device also includes a reference probe. The device also includes where, the device is configured to detect specific ions by measuring electrical response. Implementations according to this Example may include one or more of the following features. The device where the substrate is a mixed matrix membrane. The device where the mixed matrix membrane includes a variety of polymers. The device where the polymer is selected from a group including of polyvinyl chloride, polydimethylsiloxane, poly(methyl methacrylate), urushi, cellulose triacetate, poly aniline, poly urethane, siloprene, poly-(vinyl chloride-co-vinyl acetate-co-hydroxypropyl acrylate), and poly(vinyl chloride-co-vinyl acetate-co-vinyl alcohol). The device where the substrate is a solid sensing surface. The device where the solid sensing surface is selected from a group including of oxide, nitride, and metal. The device further including an ion-sensitive field-effect transistor. The system where the ion sensing electrode is a solid contact electrode and the substrate is placed on the electrode. The system where the system is placed on an ion-sensitive field-effect transistor gate terminal to measure drain current change of the ion-sensitive field-effect transistor. The system where the substrate is incorporated into the ion sensing electrode. The system where the plurality of metal organic super containers are MOSC-II-Co molecules.",
                        "Another Example includes a system for sensing molecular ions including a substrate, where the substrate includes a plurality of metal organic super containers designed to selectively bind a target molecular ion, an ion sensing electrode, and a reference electrode, where the target molecular ion is detected by measuring an electrical response. Implementations according to this Example may include one or more of the following features. The system where the ion sensing electrode is a solid contact electrode and the substrate is placed on the electrode. The system where the system is placed on an ion-sensitive field-effect transistor gate terminal to measure drain current change of the ion-sensitive field-effect transistor. The system where the substrate is incorporated into the ion sensing electrode. The system where the plurality of metal organic super containers are MOSC-II-Co molecules.",
                        "While multiple implementations are disclosed, still other implementations of the disclosure will become apparent to those skilled in the art from the following detailed description, which shows and describes illustrative embodiments of the disclosed apparatus, systems and methods. As will be realized, the disclosed apparatus, systems and methods are capable of modifications in various obvious aspects, all without departing from the spirit and scope of the disclosure. Accordingly, the drawings and detailed description are to be regarded as illustrative in nature and not restrictive."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce solid-liquid junction sensing interface",
                        "describe MOSC-based ion sensing technology",
                        "highlight advantages over prior art",
                        "describe apparatus for detection of molecular ions",
                        "outline potential applications",
                        "describe potentiometric sensors",
                        "highlight limitations of prior art ionophores",
                        "describe unique structure of MOSCs",
                        "highlight near-Nernstian response",
                        "describe stability in various environments",
                        "describe measurement of electrical response",
                        "introduce Example 1",
                        "describe features of Example 1",
                        "introduce Example 2",
                        "describe features of Example 2",
                        "introduce Example 3",
                        "describe features of Example 3"
                    ],
                    "num_characters": 8892,
                    "outline_medium": [
                        "introduce solid-liquid junction sensing interface",
                        "describe ion sensing technology",
                        "highlight advantages over prior art",
                        "describe apparatus for detection of molecular ions",
                        "discuss potential applications",
                        "describe potentiometric sensors",
                        "highlight unique structure of MOSCs",
                        "describe device performance"
                    ],
                    "outline_short": [
                        "introduce solid-liquid junction sensing interface",
                        "describe advantages over prior art",
                        "outline improved apparatus for detection",
                        "highlight potential applications"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "The various embodiments disclosed or contemplated herein relate to the use of metal-organic supercontainers (MOSCs) as a size-selective ionophore by incorporation into a substrate such as a mixed-matrix membrane (MMM) for ion-selective electrodes (ISEs).",
                        "The discovery of a new family of coordination container molecules—metal-organic supercontainers (MOSCs) shown in FIG. 1—resulted in structurally unique and diverse container molecules with a structurally unique, multi-pore architecture that displays both endo- and exo- nano-cavities with chemically tunable structures. It is understood that the exo- and endo- cavities mimic the binding pockets of proteins and enzymes.",
                        "As shown in FIG. 1, the MOSC structures may include, but are not limited to, face-directed octahedral 2, edge-directed octahedral 4, barrel-shaped 6, or cylinder-shaped 8 geometries using trigonal, linear, angular-planar, and angular-nonplanar carboxylate linkers, respectively, linking metal ions and sulfonylcalix[4]arenes. It is understood that further structures are possible. Additional discussion is found in U.S. patent application Ser. No. 13/862,651 which is incorporated by reference in its entirety for all purposes.",
                        "As best shown in FIG. 2, and simplified in FIG. 3, one aspect that makes MOSCs structurally unique is a multi-pore architecture that displays both exo-cavities 10 and endo-cavities 12. In exemplary implementations the cavities are chemically tunable structures that give the MOSC molecules the ability to function as extremely efficient host systems. This structural feature is important because the ability to design multiple nanocavities within a single host molecule capable of selecting ion species in a tunable fashion makes MOSCs extremely desirable for ion-specific sensing devices. The exemplary embodiment shown in FIGS. 2 and 3, is the MOSC-II-Co molecule 9 that selectively binds methylene blue (MB+), for example one MB+ per cavity, with an apparent binding constant of 1.42×104 M−1. It is understood that further implementations are possible.",
                        "As a result of the presence of these hierarchical cavities and their chemically tunable structure, MOSCs function as extremely efficient host systems. MOSCs are unique in their ability to show multiple nanocavities within a single host molecule, making them capable of selectively recognizing ionic species in a tunable fashion and giving them an advantage in generating ion-specific sensing devices. Particularly, the MOSC's tunable structure and solution processability make them very attractive for selective ion sensing for molecular ions. The presently disclosed system relates the use of MOSCs as a new type of ionophore at a sensor/sample interface in a selective ion detection system. MOSCs are described in U.S. patent application Ser. No. 13/862,651 which was incorporated by reference in its entirety for all purposes.",
                        "As best shown in FIGS. 4A-B, in exemplary implementations of the system 40 the MOSCs are incorporated into a substrate to form a scaffold 20A, 20B. In the examples of FIGS. 4A-B, the MOSC-substrate scaffolds 20A, 20B can take several forms, two non-limiting exemplary implementations being an MOSC-MMM 20A, comprising MOSC molecules 9 and a polymer matrix 22A (FIG. 4A), or an MOSC-solid sensing surface (SSS) scaffold 20B, comprising MOSC molecules 9 and an SSS substrate 22B (FIG. 4B).",
                        "As shown in FIGS. 4A-B and FIGS. 5-7, in various implementations, the MOSC 9 is directly incorporated into a MMM 22A to form the scaffold 20A. In these and other implementations, the MMM 22A may contain a variety of polymers. It is understood that other matrices, including, but not limited to, polydimethylsiloxane, poly(methyl methacrylate), Urushi, cellulose triacetate, poly aniline, poly urethane, siloprene, Poly-(vinyl chloride-co-vinyl acetate-co-hydroxypropyl acrylate), and Poly(vinyl chloride-co-vinyl acetate-co-vinyl alcohol) can also be utilized to form the MMM 22A.",
                        "In these implementations, the ion sensing device or system 40 therefore has a MOSC-MMM 20A structure, in which the MOSC molecules are directly incorporated into a polyvinyl chloride (PVC) based MMM. For example, the device might be placed on a solid contact (SC) and the electrical response between the solid-liquid sensing interface could be measured. Alternatively, the device or system 40 might be used to measure the electrical response between liquid-liquid junction sensing interfaces. In another example, the device might be used in conjunction with an ion-sensitive field-effect transistor 62 (ISFET) by placing the device on the gate terminal 21 of the ISFET 62 and measuring the drain current change of the ISFET 62.",
                        "Accordingly, discussed herein are various implementations relating to a device, system and methods for the use of MOSCs as a size-selective ionophore by incorporation into a substrate such as an MMM for ISEs. While there are many commercially available ionophores, the devices and methods currently available are useful mainly for detection of elemental or other small inorganic ions. The disclosed systems, methods, and devices allow for rapid and precise monitoring of molecular (e.g., organic) ions for environmental and biomedical applications.",
                        "In certain implementations, the device or system comprises a MOSC-solid sensing surface (SSS) structure 20B, in which chemical bonds allow the MOSCs to bind onto an SSS 20B, such as an oxide, nitride, or metal. For example, the MOSC-SSS 20B could be used to measure the electrical response between a solid-liquid junction sensing interface. Alternately, the device might be used in conjunction with an ISFET 62 by placing the device on the gate terminal 21 of the ISFET 62 and measuring the drain current change of the ISFET 62.",
                        "In various implementations, the size of the binding cavity and the number of binding sites (as shown for example in FIGS. 1-3), is created by altering constituent elements of the MOSCs. These cavities can be tuned to enable the design of a device for detection of a highly specific ion. For example, in Example 1 (discussed below) this implementation is demonstrated using methylene blue (MB+). It is understood that further implementations are of course possible.",
                        "Additionally, Example 1 shows this implementation using Tetrabutylammonium (TBA+). In various implementations the device has a decreased response to elemental and other small inorganic ions, providing an extremely effective measurement for local concentration of the larger target molecular ion. Other implementations are possible.",
                        "In use, and as best shown in FIG. 5, in certain implementations, the MMM scaffold 20A is placed on an solid contact (SC) electrode 23 and used in conjunction with a reference electrode 42 to create a system 40. The system 40 of these implementations is used to measure the electrical response (shown at 44) between the system's 40 solid-liquid junction sensing interface (shown generally at 19).",
                        "For example, to make an SC electrode 23 the MOSC might be incorporated by spin-coating a 1.5 μm SU8 layer on top of an SiO2-covered Si wafer with an oxide thickness of 650 nm. In this implementation, the SU8 film can then be pyrolyzed in a quartz tube flow-through furnace at 900 degrees Celsius in the reducing atmosphere of 95 percent N2 and 5 percent H2 for one hour. Then polyethylene wells with inner diameters of about 6 mm can be glued on top of the SU80-derived carbon using a quick setting epoxy. Finally, 40 μL of MMM solution is drop-casted inside the fabricated well on top of the pyrolyzed SU8, making a thin-film coating over the entire carbon electrode.",
                        "Turning to the implementation of FIG. 6, in this embodiment the system 40 includes the scaffold 20A and the reference electrode 42 is used to measure the electrical response (designated at 44) between the liquid-liquid interface. In various implementations, the reference electrode 42 can be an Ag/AgCl reference electrode or another reference electrode known to those with skill in the art.",
                        "As best shown in FIG. 7, in certain implementations the system 40 includes the scaffold 20A and the reference electrode 42. The system 40 is placed on the gate terminal 21 of an ISFET 62 and used to measure the drain current change of the ISFET 62, as would be understood.",
                        "As shown in FIGS. 4 and 7-9, in various implementations the MOSC 9 is incorporated into an SSS 22B to form a scaffold 20B. In certain implementations, the SSS 22B can be oxide, nitride, metal or other solid sensing surface structures, as would be understood. In certain implementations, the MOSC 9 can be attached to the SSS 22B with chemical bonds, weak non-covalent interactions, covalent bonds such as S—Au (i.e., sulfur-gold) linkages, or other means of attachment known to those with skill in the art.",
                        "Similar to the MMM scaffold 20A depicted in the implementation of FIG. 5, in certain implementations, as shown in FIG. 8, a SSS scaffold 20B can be used in conjunction with a reference electrode 42 to form the system 40, which can be used to measure the electrical response 44 between a solid-liquid interface, as would be understood. Many alternate implementations are possible.",
                        "As shown in FIG. 9, in certain alternate implementations, the scaffold 20B and the reference electrode 42 will form the system 40 that can be placed on the gate terminal 21 of an ISFET 62. In these and other implementations, the system 40 can thereby be used to measure the relative or absolute drain current change of the ISFET.",
                        "In exemplary implementations, and as discussed in the examples below, the system 40 demonstrates a near-Nernstian response, a reduction in charge-transfer resistance (both shown in Example 1), and little to no visible leeching (shown in Example 2), indicating that the system 40 is highly effective in rapid and precise monitoring of molecular ions. In all implementations, the system 40 is environmentally stable (shown in Example 3). In various implementations, the system can include an ISFET for monitoring molecular ions with little interference from elemental or other small inorganic ions (shown in Example 4).",
                        "The following examples are put forth so as to provide those of ordinary skill in the art with a complete disclosure and description of how the articles, devices and/or methods claimed herein are made and evaluated, and are intended to be purely exemplary of the invention and are not intended to limit the scope of what the inventors regard as their invention. However, those of skill in the art should, in light of the present disclosure, appreciate that many changes can be made in the specific embodiments which are disclosed and still obtain a like or similar result without departing from the spirit and scope of the invention.",
                        "An exemplary study demonstrated herein in Examples 1-3 is found in “Biomimetic supercontainers for size-selective electrochemical sensing of molecular ions” by Netzer, N. L., Must, I., Qiao, Y., Zhang, S., Wang, Z., Zhang, Z. (Sci. Rep, 2017, 7, 45786), and is hereby incorporated by reference in its entirety for all purposes."
                    ],
                    "subsections": [
                        {
                            "title": "EXAMPLE 1: PROOF-OF-CONCEPT STUDY WITH MB+ AND TBA+",
                            "paragraphs": [
                                "The present example investigates the ability of a specialized MOSC, designated as MOSC-II-Co 9 (shown in FIG. 2), to selectively bind MB+ in both solution and in solid-state. The MOSC-II-Co molecule 9 was designed with its cavities matching the size of MB+, a known water contaminant. Both the MOSC and MB+ were combined with a polymeric MMM and incorporated into an MB+-selective electrode in the nanomolar to micromolar range. The results demonstrated the encouraging potential of MOSC-based ion sensors via exploiting the tunable nature and specific molecular recognition capability of the MOSC structures.",
                                "**Materials and Methods**",
                                "The exemplary MOSC-II-Co 9 was obtained from the reaction of Co(II), p-tert-butylsulfonyl-calix[4]arene, and 1,4-benzedicarboxylate. It had an edge-directed octahedral geometry and features an outer diameter of 3.3 nm, an inner diameter of 1.7 nm, and an internal volume of 1.2 nm3. It possesses a total of seven well-defined binding domains, including six exo-cavities (measuring 0.74 nm) and one endo-cavity (measuring 1.7 nm). The size of the cavities were designed to fit the dimensions of MB+, which has a length of 1.6 nm and a width of 0.7 nm.",
                                "After the MOSC-II-Co molecule 9 was created, it was combined with an MMM and incorporated onto an electrode to form an ion sensing device. For the study, a conventional ISE with an inner filling solution was chosen because of its versatility and ease of set-up. To facilitate reversible sorption of MB+ and fabricate a working MB+-ion-selective MMM using MOSC-II-Co, the ionic site of tetrakis(4-chlorophenyl)borate, MB+, and MOSC-II-Co 9 were dispersed into a solution of tetrahydrofuran (THF) and PVC. After the MMM solution was allowed to mix for two hours, an ISE with an inner filling solution and an internal Ag/AgCl reference was manufactured. First, the MOSC-II-Co MMM solution was drawn up into an empty pipette tip via capillary force. Once the membrane was set and the MOSC-II-Co MMM was formed at the tip of the tube, the inner filling solution and Ag/AgCl pellet were added. The membrane thickness was about 0.5 nm. The MOSC-II-Co MMM ISE's potential (Ewe) 44 was recorded versus a standard Ag/AgCl reference electrode, shown in FIG. 10. A solid-contact ISE was also fabricated with a pyrolyzed SU8-derived carbon (SU8-C) electrode. A simple drop-cast method was used to apply the MOSC-II-Co MMM onto the SU8-C electrode to create the MOSC-II-Co MMM-SC ISE. The MOSC-II-Co MMM-SC ISE was also recorded versus Ag/AgCl reference electrode, shown in FIG. 10. As FIG. 10 shows, there is little variation between the two methods.",
                                "The characteristics of the MOSC-II-Co MMM ISEs were investigated using both impedance spectroscopy and potentiometry. As shown in FIG. 11, the impedance of the MMM with MOSC-II-Co 9 reveals a reduction of the charge-transfer resistance by a factor of two when compared to the MMM without MOSC-II-Co 9. This is a strong indication of MOSC-II-Co 9 promoting MB+ ion transfer across the MMM-analyte interface, which shows that the MOSC molecule is a good candidate for potentiometric sensing. The MOSC-II-Co MMM ISEs were also investigated using K+, Ag+, and NH4+ to test binding of small molecules, and with TBA+ to test the binding of larger molecules with a similar structure to that of MB+.",
                                "**Results**",
                                "The potentiometric response shown in FIG. 12 is evidence of the ideal match of MB+'s dimensions with those of the MOSC cavities. The MOSC-II-Co MMM ISE gives a near-Nernstian response to the MB+ concentration, providing clear evidence for the suitability of MOSC-II-Co 9 as an ionophore and its direct implementation in ISE sensors. The size-selectivity was further verified by the response showing the binding event for TBA+, depicted in FIGS. 13 and 14. As shown in FIG. 15, the response time for the binding event was also extremely short and the potential stability was extremely high for the TBA+ test, further indicating the suitability of MOSC-II-Co 9 as an ionophore.",
                                "As also shown in FIGS. 13 and 16, the device expressed a very minimal response to the smaller ions, likely because their sizes were too small to allow effective binding. This is likely because the lower rim of the MOSC-II-Co 9 precursor calixarene serves only as a structural site by coordinating to Co(II) using its phenolic oxygen atoms. This simultaneously increases formation of critical MOSC structures while decreasing affinity to small metal ions because of a lack of binding groups. In addition, the six exo-cavities are orderly pre-organized around the central endo-cavity, providing an effective strategy to promote local concentration of the target ion while decreasing sensitivity to small metal ions."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce MOSC-II-Co molecule",
                                "describe materials and methods for study",
                                "describe design of MOSC-II-Co molecule",
                                "describe fabrication of ion sensing device",
                                "describe measurement of potential response with FIG. 10",
                                "describe impedance spectroscopy results with FIG. 11",
                                "describe potentiometric response results with FIG. 12",
                                "describe size-selectivity results with FIGS. 13-16",
                                "describe response time and potential stability results with FIG. 15"
                            ],
                            "num_characters": 4725,
                            "outline_medium": [
                                "introduce MOSC-II-Co molecule",
                                "describe materials and methods for study",
                                "present results of study, including impedance spectroscopy and potentiometry",
                                "discuss implications of results for MOSC-based ion sensing"
                            ],
                            "outline_short": [
                                "describe materials and methods for creating MOSC-II-Co molecule and incorporating it into an MMM",
                                "present results of potentiometric response and impedance spectroscopy"
                            ]
                        },
                        {
                            "title": "EXAMPLE 2: LEECHING STUDY",
                            "paragraphs": [
                                "A simple leeching test was performed by preparing two MMMs, one with MOSC-II-Co 9 and one without. All other constituents were kept constant. The MMMs were stored in deionized (DI) water for over one week. As shown in FIG. 17, no change in the color of the water for the MOSC-MMM was observed, indicating that MB+ was captured by MOSC-II-Co 9. However, the solution in contact with the MMM without MOSC-II-Co turned dark blue, indicating that the MB+ had leached out. Additionally, the ISEs used for measurement showed no dependence on MB+ concentration, strongly indicating that the MB+ sensitivity results from the inclusion of the MOSC."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe leeching test results with FIG. 17"
                            ],
                            "num_characters": 639,
                            "outline_medium": [
                                "describe leeching test and results"
                            ],
                            "outline_short": [
                                "describe leeching test and results"
                            ]
                        },
                        {
                            "title": "EXAMPLE 3: SIMULATED WASTE WATER SAMPLE",
                            "paragraphs": [
                                "The MOSC-II-Co molecule 9 was tested in a simulated wastewater sample collected from the Fyris River in the city of Uppsala, Sweden to illustrate that the proof of concept protocols can be applied in a more practical setting. A wastewater sample was collected and controlled amounts of the pollutant MB+ were added. As demonstrated in FIG. 18, the response curve for the simulated waste-water remained near-Nernstian. Although FIG. 18 shows an apparent shift in the detection limit towards higher concentrations of MB+, the shift can be attributed to decreased oxygen levels in the sample caused by microorganism found in the river water, verified by the control experiment, in which an equal amount of MB+ was dissolved in DI water and water from the Fyris River. The loss of oxygen produces a reducing environment, which can in turn decrease the actual MB+ ion concentration by a certain amount and cause a small shift in the response curve."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe response curve results in simulated wastewater sample with FIG. 18"
                            ],
                            "num_characters": 943,
                            "outline_medium": [
                                "describe test of MOSC-II-Co molecule in simulated wastewater sample"
                            ],
                            "outline_short": [
                                "describe testing of MOSC-II-Co molecule in simulated wastewater sample and results"
                            ]
                        },
                        {
                            "title": "EXAMPLE 4: MOLECULAR ION SENSING",
                            "paragraphs": [
                                "This example demonstrates uses of silicon nanowire based ISFET 62 (SiNW-ISFET) for electronic sensing of ions in conjunction with MOSC-incorporated MMMs 20A, as is shown generally in FIG. 7 for example.",
                                "**Materials and Methods**",
                                "The SiNW-ISFET chips were fabricated using standard silicon process technology on silicon-on-insulator wafers. The silicon layer in the channel region was thinned down from 260 to 40 nm via thermal oxidation. SiNWs were first defined by lithography and dry etching, and then were laterally shrunk to the desired width. To reduce the series resistance, PtSi/p+-Si leads were used for connecting the SiNW-ISFETs 62 to the contact pads placed at the edges of the chip. Finally, a fresh thin silicon oxide (SiO2) film was grown via rapid thermal oxidation to serve as gate insulator and passivation on the chip. An exemplary embodiment of SiNW-ISFETs covered by electrolyte are shown in FIG. 19A.",
                                "Four types of MMMs were prepared: MOSC-doped MMM premixed with MB (MB+-MMM1), MMM premixed with MB+ but without MOSC (MB+-MMM2), Na-ionophore doped MMM (Na+-MMM), and blank control MMM containing only ionic sites (Control-MMM). Once the solution was prepared and there were no visible particles, the MMMs were fabricated by drop casting the solution on the device area of the chips by pipettes. An exemplary embodiment of a chip formed by drop-casting is show in FIG. 19C. Then, the chips with MB+-MMM1 and MB+-MMM2 were placed in a fume hood for approximately 2 hours while the chips with Na+-MMM were left in ordinary atmosphere overnight. Before any measurement was performed, the chips with MB+-MMM1 and MB+-MMM2 were conditioned in a 10 μM MB+ solution overnight while the chips with Na+-MMM were conditioned in a 100 mM NaCl solution for 4 hours. All procedures of MMM preparation and conditioning were conducted at room temperature.",
                                "All electrical measurements were performed at room temperature on a probe-station using a Keysight B1500A precision semiconductor parameter analyzer. To facilitate measurement with electrolyte, a polydimethylsiloxane (PDMS) container was placed on the chip. During the measurement, the gate potential (VG) was kept constant and was applied to an Ag/AgCl reference electrode 42 (with 3.4 M KCl as filling electrolyte, purchased from Harvard Apparatus) immersed in the solution. The SiNW-ISFET 62 was biased in its subthreshold region. The drain-to-source current (IDs) was monitored in real-time with a constant VDS=1 V. Solution exchanges during the measurement were realized manually using a pipette. In detail, each measurement was initiated with a solution with a low sample concentration in the PDMS container in order to set an IDS baseline. Once the baseline became stable, the concentration in the container was increased by adding samples of higher analyte concentrations. Similar solution-exchange procedures were applied to the multiplexed detection, using a starting solution containing both molecular and elemental ions of low concentrations.",
                                "**Results**",
                                "Characterization of SiNW-ISFETs. The transfer characteristics, i.e., IDS vs. VG, of two SiNW-ISFETs 62 with and without MMM measured in the same electrolyte are shown in FIG. 19D. The two SiNW-ISFETs 62 have the same channel dimensions, i.e., 2 μm in length, 200 nm in width, and 40 nm in height. Both devices exhibit similar subthreshold slope (SS), i.e., 118 mV/dec, while surface functionalization with MMM 20A has clearly decreased the threshold voltage (VTH) from that of the device with bare gate insulator. As shown in the potential diagram in FIG. 19E, when a reference electrode is used, the electrical potential of the electrolyte (ψEL) is fixed by VG. For the SiO2/electrolyte interface, its potential (φOE) is determined by the pH value of the electrolyte since the reaction between H+ in the electrolyte and the silanol groups (Si—OH) on the SiO2 surface is mainly responsible for surface charging. However, when the gate insulator is covered by MMM 20A, the potential at the MMM/electrolyte interface 19 (φME) is governed by the binding affinity between the ionophores and target ions, as well as the ionophores and ion concentrations in the MMM 20A and the electrolyte, respectively. Given the same type of MMM 20A and same ionic composition in the electrolyte, φME should remain unaltered. The observed difference in VTH for the two SiNW-ISFETs 62 is, thus, the consequence of φME departing from φOE. The negligible change of SS by MMM 20A is essential for maintaining the gate coupling efficiency and current sensitivity of the SiNW-ISFET 62. This is due to the significantly reduced resistivity of MMM 20A after the addition of ionic sites, leading to negligible potential drop across the MMM 20A bulk when it is in series connection with the gate insulator as illustrated in FIG. 19E. It is worth noting that the gate leakage (IG) is below 2 nA for VG ranging from −0.5 to 0.5 V, which indicates negligible parasitic current in the system during the measurement and is important for a stable sensor operation in the electrolyte.",
                                "Molecular Ion Sensing. The detection of MB+ using the MB+-MMM1 20A functionalized SiNW-ISFET 62 relies on the size-selective feature of the interaction between the MOSC molecules and the MB+ ions. The MOSC possesses one endo- (Ø˜1.7 nm) and six exo-cavities (Ø˜0.74 nm), which determines its ion-capture properties. The sizes of these cavities fit with the dimensions of MB+ that measure 1.6 nm in length and 0.7 nm in width. It has been shown that, the MOSC-II-CO 9 has the ability to selectively bind to MB+ in both solution and solid-state with an apparent binding constant of (1.42±0.31)×104 M−1. This favorable binding is believed to be due in part to the so-called “cation-π” interaction between MB+ and the MOSC cavity, which feature a positive charge and multiple aromatic groups (aka π-systems), respectively.",
                                "FIG. 20 shows ΔVTH of the MB+-MMM 20A functionalized SiNW-ISFET 62 as a function of time when MB+ activity, i.e., αMB, is increased from 10 nM to 1 mM. All VTH shifts are retrieved with respect to the VTH value at αMB=10 nM, i.e., ΔVTH=0 mV at αMB=10 nM. As αMB increases, the MMM 20A surface becomes more positively charged (more negatively charged on the electrolyte side), leading to a negative shift of VTH and lowering of IDS for the SiNW-ISFET 62 with hole conduction. The overshoot after each addition of sample solution could be related to the way of sample mixing in the PDMS container, i.e., each increment of sample concentration is performed by adding a sample with higher concentration to mix with the sample already in the container. Although gently performed with the sample addition, the transport of ions and molecules in the electrolyte is governed by convection instead of diffusion. This explains the observed instantaneous response of VTH to sample addition in FIG. 20, and most likely the overshoot as well. A slight positive shift of VTH with increasing αMB is visible when αMB is lower than 1 μM. This could have arisen from residues of previous measurements at higher αMB. As a result, the activities at the extremely low end could be higher than anticipated.",
                                "The variation of VTH with αMB is depicted in FIG. 21, with each data point representing an average of three independent measurements. The MB+-MMM1 20A functionalized SiNW-ISFET 62 shows a near-Nernstian response to αMB with a slope of 56.4±1.8 mV/dec up to αMB=30 μM. The change of VTH starts to deviate from the ideal trend, giving rise to a slope of 35.8±1.4 mV/dec when αMB is above 100 μM. Such a deviation at high αMB can be explained by the co-extraction of MB+ and Cl− from the sample into MMM 20A, leading to the so-called Donnan failure. This can be mitigated by further optimization of the MMM 20A composition, e.g., ratio of ionophore to ionic site. The lower detection limit extrapolated from the MB+ response curve is ˜1 μM. The performance of the SiNW-ISFET 62 based MB+ sensor is close to MOSC-incorporated conventional ISE, and is also comparable with MB+ ISEs with different ion receptors and membrane compositions. The result shows a successful integration of MOSC-doped MMM 20A with SiNW-ISFET 62 as well as its excellent repeatability in potentiometric MB+ sensing.",
                                "The MB+-MMM1 20A functionalized SiNW-ISFET 62 was further investigated for its response to common interfering elemental ions. As shown in FIG. 21, no substantial shift in VTH of the SiNW-ISFET 62 is observed with αNa, αK, and αH up to 100 μM, presumably because these ions are too small in size to allow for effective competition with the MOSC cavities. When the ion activities were further increased from 100 μM to 10 mM, the SiNW-ISFET 62 started to respond, giving rise to a slope of 13.2, 8.71, and 13.5 mV/dec for Na+, K+, and H+, respectively. Similar responses at high ion activities (except for H+) were also observed for the SiNW-ISFET 62 without MMM 20A, i.e., with bare SiO2, indicating that such responses are more likely due to changes in ionic strength and are not related to the binding between the MOSC molecules and the ions. The superior selectivity against elemental ions is a clear advantage of using MOSCs for recognition of molecular ions in the physiological and environmental processes.",
                                "To achieve the desired Nernstian response, it is crucial to maintain a constant activity of the ion of interest in the bulk of the membrane phase. Without MOSC molecules incorporated into the MMM 20A, MB+ will gradually leach into the aqueous phase, leading to a drift of αMB in the membrane phase. Three consecutive response curves of the SiNW-ISFET 62 functionalized with such MMM 20A without MOSC incorporation, i.e., MB+-MMM2 20A, are depicted in FIG. 22A-B. The response curve of the MB+-MMM1 20A functionalized SiNW-ISFET 62 is also included as a reference. Due to the instability of αMB in the membrane phase, the sensor response deviates significantly from the ideal Nernstian behavior. Moreover, the reproducibility is poor in comparison with the reference, as evident by its substantially larger standard deviation shown in FIG. 22B. The lower detection limit of the MB+-MMM2 20A functionalized SiNW-ISFET 62 is also inferior to the reference, which could be explained by MB+ leaching out from MB+-MMM2 20A, thereby considerably raising αMB at the interface, i.e., αMBIF. In another case where MMM 20A contained neither premixed ion of interest (MB+) nor MOSC molecules, designated as Control-MMM 20A, the sensor showed negligible potentiometric response during the first measurement. This is expected since there is no MB+ in the MMM 20A to balance the charge and to establish a stable phase boundary potential with the MB+ in the solution. However, MB+ is relatively hydrophobic. As the SiNW-ISFET 62 with Control-MMM 20A is used over and over again, the hydrophobic MB+ can become incorporated into the membrane and thereby rendering it an ion-exchange membrane. By repeating the measurement for the second and third time, αMB in Control-MMM 20A increases and the SiNW-ISFET 62 sensor starts to respond with a lower detection limit similar to the reference. However, the response curve averaged from three measurements, shown in FIG. 23A, significantly deviates from the ideal Nernstian behavior. Such a sub-Nernstian response could be ascribed to a sample dependent αMB in Control-MMM 20A, i.e., αMB is not constant in the membrane phase but is dependent on the MB+ activity in the aqueous phase. The results here clearly demonstrate the critical role of the MOSC molecules for stabilization of the activity of the ion of interest in MMM 20A, which is essential for achieving a Nernstian response.",
                                "Elemental Ion Sensing. FIG. 23A shows ΔVTH of a Na+-MMM functionalized SiNW-ISFET 62 as a function of time with increasing αNa. An overshot is also visible after addition of each new sample solution but the recovery is significantly faster than observed in MB+ sensing, which could be explained by the relatively higher diffusivity of Na+ comparing to the bulkier MB+ in the solution and thus shorter time for the solution to become homogenized. As depicted in FIG. 23B, in the presence of K+ as a likely interfering ion with αK=1 mM, the Na+-MMM 20A functionalized SiNW-ISFET 62 exhibits a near-Nernstian response with a slope of 57.9±0.7 mV/dec in a wide αNa range from 100 μM to 100 mM, with a lower detection limit of ˜60 μm. Such a performance is in close match with the reported data obtained from conventional ISE with the same Na-ionophore. On the other hand, the response to K+, in the presence of Na+ as a likely interfering ion with αNa=1 mM, becomes close to Nernstian (˜61 mV/dec) at much higher concentrations, i.e., αK>10 mM. A selectivity coefficient KNa, KPot of 10−1.2 can be estimated from the lower detection limit of Na+ (αNa(DL)) in the presence of interfering K+ with an activity of αK through:",
                                "αNa(DL))=KNa, KPotαK,   (Equation 1)",
                                "which is in good agreement with the reported values.",
                                "Considering the abundance of molecular ions in physiological samples, it is important to investigate the cross-sensitivity of the elemental ion sensor towards molecular ions. The response curve of the Na+-MMM 20A functionalized SiNW-ISFET 62 towards the molecular ion MB+ is shown in FIG. 23B. Similar to the case of Control-MMM 20A, the hydrophobic MB+ is incorporated into the Na+-MMM 20A during measurement. The SiNW-ISFET 62 exhibits a super-Nernstian response towards MB+ once αMB is above a critical threshold, i.e., ˜10 μM in this experiment, with a large standard deviation among the measurements. Therefore, in order to have a controllable detection of elemental ions, it is essential to keep the activity of hydrophobic ions below the threshold where they start to be incorporated into MMM 20A.",
                                "Detections with River Water. To prove the herein disclosed sensors can be utilized for complex sample, both molecular and elemental ion detection experiments were performed with the water collected from the Fyris River in the city of Uppsala, Sweden. The response curves of the MB+-MMM1 20A functionalized SiNW-ISFET 62 are undistinguishable between the river water and the DI water depicted in FIG. 24. These results clearly demonstrate the robustness of the SiNW-ISFET 62 based molecular ion sensor, which can be attributed to its remarkable selectivity against interfering elemental ions often abundantly present in river water. Similar experiments were conducted with the Na+-MMM 20A functionalized SiNW-ISFET 62. A significant performance deterioration is observed as evident by a sub-Nernstian response and an increase of the lower detection limit in FIG. 24. This behavior can result from the presence of a multiple of other elemental ions in the river water, e.g., K+ and Ca2+, that interfere with the Na+ detection. Nevertheless, the slope of the response curve improves with increasing αNa, reaching 54.5±0.9 mV/dec when αNa is above 30 mM, as a result of the reduced effect from the interfering ions at high analyte concentrations.",
                                "Multiplexed Analysis. The MB+-specific and Na+-specific SiNW-ISFET 62 sensors are integrated on the same chip, for a multiplexed analysis of molecular and elemental ions in one solution. The two MMMs are manually coated onto the sensors by drop casting. The hydrophobic MB+ will be extracted from the solution into the Na+-MMM 20A, giving rise to false response on the Na+-specific sensor. As a result, αMB in the solution is kept below the threshold, i.e., 10 μM. As shown in FIG. 25, when the experiment is conducted with DI water, αMB in the solution is first increased from 1 to 3 μM and then from 3 to 7 μM, the MB+-specific sensor shows ΔVTH of 12.5 and 30.7 mV, respectively. This is in good agreement with previously demonstrated response shown in FIG. 21. With these changes, VTH of the Na+-specific sensor remains unaltered. Afterwards, αNa in the solution is increased from 100 to 300 μM and then from 300 μM to 1 mM, the corresponding ΔVTH of the Na+-specific sensor is 9.4 and 13.0 mV; both are relatively small in comparison with the data obtained from the separate solution measurements as shown in FIG. 23B. This could be due to the use of a higher concentration of KCl, i.e., 10 mM, as the background electrolyte in this demonstration, since K+ is a strong interfering ion for the Na+-specific sensor. When the experiment was conducted with the river water, the same αMB range as with DI water was applied since the MB+-specific sensor produces similar response curves in both water solutions. On the other hand, larger αNa steps are used due to the performance deterioration of the Na+-specific sensor with the river water. As expected, the MB+-specific sensor shows ΔVTH of 18.0 and 28.5 mV with the increase of αMB first from 1 to 3 μM and then from 3 to 7 μM, respectively, while the Na+-specific sensor shows no detectable ΔVTH. Afterwards, αNa in the solution is increased from 30 to 300 μM and then from 300 μM to 3 mM, the corresponding ΔVTH of the Na30 -specific sensor is 10 and 22.5 mV.",
                                "Results demonstrate the possibility to operate the two types of sensors targeting, with high specificity, both molecular and elemental ions simultaneously in a complex sample.",
                                "Ranges can be expressed herein as from “about” one particular value, and/or to “about” another particular value. When such a range is expressed, a further aspect includes from the one particular value and/or to the other particular value. Similarly, when values are expressed as approximations, by use of the antecedent “about,” it will be understood that the particular value forms a further aspect. It will be further understood that the endpoints of each of the ranges are significant both in relation to the other endpoint, and independently of the other endpoint. It is also understood that there are a number of values disclosed herein, and that each value is also herein disclosed as “about” that particular value in addition to the value itself. For example, if the value “10” is disclosed, then “about 10” is also disclosed. It is also understood that each unit between two particular units are also disclosed. For example, if 10 and 15 are disclosed, then 11, 12, 13, and 14 are also disclosed.",
                                "Although the disclosure has been described with reference to certain embodiments, persons skilled in the art will recognize that changes may be made in form and detail without departing from the spirit and scope of the disclosed apparatus, systems and methods."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce SiNW-ISFET for molecular ion sensing",
                                "describe MMM preparation",
                                "describe MMM conditioning",
                                "describe electrical measurement setup",
                                "describe measurement procedure",
                                "show transfer characteristics of SiNW-ISFETs",
                                "explain surface functionalization with MMM",
                                "describe potential diagram of SiO2/electrolyte interface",
                                "explain potential at MMM/electrolyte interface",
                                "discuss VTH difference between two SiNW-ISFETs",
                                "explain negligible change of SS by MMM",
                                "discuss gate leakage",
                                "introduce MB+ detection using MB+-MMM1",
                                "describe size-selective feature of MOSC molecules",
                                "explain binding constant of MOSC-II-CO",
                                "show ΔVTH of MB+-MMM1 functionalized SiNW-ISFET",
                                "explain VTH shift with increasing αMB",
                                "discuss overshoot after sample addition",
                                "show variation of VTH with αMB",
                                "discuss near-Nernstian response to αMB",
                                "explain deviation from ideal trend at high αMB",
                                "discuss lower detection limit",
                                "compare performance with conventional ISE",
                                "investigate response to common interfering elemental ions",
                                "discuss superior selectivity against elemental ions",
                                "discuss importance of MOSC molecules for Nernstian response",
                                "show response curves of SiNW-ISFET without MOSC incorporation",
                                "discuss instability of αMB in membrane phase",
                                "discuss lower detection limit of MB+-MMM2",
                                "introduce elemental ion sensing using Na+-MMM",
                                "show ΔVTH of Na+-MMM functionalized SiNW-ISFET",
                                "discuss near-Nernstian response to αNa",
                                "discuss selectivity coefficient KNa, KPot",
                                "investigate cross-sensitivity towards molecular ions",
                                "discuss multiplexed analysis of molecular and elemental ions",
                                "demonstrate simultaneous detection in complex sample"
                            ],
                            "num_characters": 18522,
                            "outline_medium": [
                                "introduce SiNW-ISFET for molecular ion sensing",
                                "describe fabrication of SiNW-ISFET chips",
                                "prepare four types of MMMs",
                                "fabricate MMMs by drop casting on chips",
                                "condition MMMs before measurement",
                                "perform electrical measurements on probe-station",
                                "describe measurement setup with PDMS container",
                                "characterize SiNW-ISFETs with and without MMM",
                                "explain potential diagram of SiNW-ISFET with MMM",
                                "describe molecular ion sensing using MB+-MMM1",
                                "show response of MB+-MMM1 to MB+ activity",
                                "explain variation of VTH with MB+ activity",
                                "investigate response to common interfering elemental ions",
                                "compare response of MB+-MMM1 and MB+-MMM2",
                                "describe elemental ion sensing using Na+-MMM",
                                "show response of Na+-MMM to Na+ activity",
                                "demonstrate detection with river water",
                                "demonstrate multiplexed analysis of molecular and elemental ions"
                            ],
                            "outline_short": [
                                "introduce SiNW-ISFET for molecular ion sensing",
                                "describe materials and methods for SiNW-ISFET fabrication",
                                "detail MMM preparation and conditioning",
                                "outline electrical measurement procedures",
                                "present results of SiNW-ISFET characterization",
                                "describe molecular ion sensing using MB+-MMM1 functionalized SiNW-ISFET",
                                "discuss elemental ion sensing using Na+-MMM functionalized SiNW-ISFET",
                                "demonstrate detections with river water",
                                "show multiplexed analysis of molecular and elemental ions"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce metal-organic supercontainers (MOSCs)",
                        "describe MOSC structure and properties",
                        "illustrate MOSC structure with FIG. 1",
                        "describe exo- and endo- cavities of MOSCs",
                        "illustrate multi-pore architecture of MOSCs with FIG. 2 and FIG. 3",
                        "describe chemically tunable structure of MOSCs",
                        "describe ability of MOSCs to function as host systems",
                        "describe use of MOSCs as ionophores in ion-selective electrodes (ISEs)",
                        "illustrate incorporation of MOSCs into a substrate with FIG. 4A-B",
                        "describe MOSC-MMM scaffold structure",
                        "describe MOSC-solid sensing surface (SSS) scaffold structure",
                        "describe tunability of MOSC cavities for specific ion detection",
                        "describe use of MMM scaffold in ion sensing device",
                        "describe use of SSS scaffold in ion sensing device",
                        "illustrate measurement of electrical response with FIG. 5",
                        "describe use of ISFET in ion sensing device",
                        "illustrate measurement of electrical response with FIG. 6",
                        "illustrate measurement of drain current change with FIG. 7",
                        "describe attachment of MOSCs to SSS with chemical bonds",
                        "describe use of SSS scaffold in ion sensing device with FIG. 8",
                        "describe use of SSS scaffold in ion sensing device with FIG. 9",
                        "describe advantages of MOSC-based ion sensors"
                    ],
                    "num_characters": 11107,
                    "outline_medium": [
                        "introduce metal-organic supercontainers (MOSCs)",
                        "describe MOSC structure and properties",
                        "illustrate MOSC structure with figures",
                        "explain chemically tunable structure of MOSCs",
                        "describe use of MOSCs as ionophores in ion-selective electrodes (ISEs)",
                        "illustrate incorporation of MOSCs into substrates",
                        "describe various implementations of MOSC-based ISEs",
                        "explain size-selective ion sensing using MOSCs",
                        "describe advantages of MOSC-based ISEs",
                        "provide examples of MOSC-based ISEs",
                        "discuss environmental and biomedical applications of MOSC-based ISEs"
                    ],
                    "outline_short": [
                        "introduce metal-organic supercontainers (MOSCs) as size-selective ionophores",
                        "describe MOSC structures and their chemically tunable cavities",
                        "discuss incorporation of MOSCs into substrates for ion-selective electrodes (ISEs)",
                        "explain advantages of MOSCs in generating ion-specific sensing devices",
                        "outline various implementations of MOSC-based devices and systems"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A chemically tunable metal-organic system comprising:\na. a supercontainer comprising one or more of:\ni. an exo-cavity;\nii. an endo-cavity;\n\nb. a substrate, wherein the substrate is combined with the supercontainer to form a scaffold; and\nc. a reference probe,\nwherein the system is constructed and arranged to detect ions.",
        "2. The system of claim 1, wherein the system detects ions by measuring an electrical response.",
        "3. The system of claim 1, wherein the substrate comprises:\ni. a mixed-matrix membrane; or\nii. a solid sensing surface.",
        "4. The system of claim 3, wherein the mixed-matrix membrane is a polymer matrix.",
        "5. The system of claim 3, wherein the solid sensing surface is selected from the group consisting of oxide, nitride, and metal.",
        "6. The system of claim 1, wherein the system measures electrical response using a solid-contact ion sensing electrode.",
        "7. The system of claim 1, wherein the system measures electrical response using an ion-sensing electrode with an inner filling solution and an internal Ag/AgCl reference.",
        "8. The system of claim 1, wherein the system measures electrical response using an ion-sensing electrode constructed on an ion-sensitive field-effect transistor gate terminal.",
        "9. A device for sensing ions comprising:\na. a substrate, wherein the substrate consists of a metal organic super containers to form a scaffold;\nb. an ion sensing electrode; and\nc. a reference probe,\nwherein, the device is configured to detect specific ions by measuring electrical response.",
        "10. The device of claim 9, wherein the substrate is a mixed matrix membrane.",
        "11. The device of claim 10, wherein the mixed matrix membrane comprises a variety of polymers.",
        "12. The device of claim 11, wherein the polymer is selected from a group consisting of polyvinyl chloride, polydimethylsiloxane, poly(methyl methacrylate), Urushi, cellulose triacetate, poly aniline, poly urethane, siloprene, Poly-(vinyl chloride-co-vinyl acetate-co-hydroxypropyl acrylate), and Poly(vinyl chloride-co-vinyl acetate-co-vinyl alcohol).",
        "13. The device of claim 9, wherein the substrate is a solid sensing surface.",
        "14. The device of claim 13, wherein the solid sensing surface is selected from a group consisting of oxide, nitride, and metal.",
        "15. The device of claim 9, further comprising an ion-sensitive field-effect transistor.",
        "16. A system for sensing molecular ions comprising:\na. a substrate, wherein the substrate comprises a plurality of metal organic super containers designed to selectively bind a target molecular ion;\nb. an ion sensing electrode; and\nc. a reference electrode,\nwherein the target molecular ion is detected by measuring an electrical response.",
        "17. The system of claim 16, wherein the ion sensing electrode is a solid contact electrode and the substrate is placed on the electrode.",
        "18. The system of claim 16, wherein the system is placed on an ion-sensitive field-effect transistor gate terminal to measure drain current change of the ion-sensitive field-effect transistor.",
        "19. The system of claim 16, wherein the substrate is incorporated into the ion sensing electrode.",
        "20. The system of claim 16, wherein the plurality of metal organic super containers are MOSC-II-Co molecules."
    ]
}