{
    "id": "https://semopenalex.org/work/W2320760520",
    "authors": [
        "Mats Johansson",
        "Derek J. Irvine",
        "Steven M. Howdle",
        "Cor E. Koning",
        "José A. Souto",
        "Robert A. Stockman",
        "Susana Torron Timhagen",
        "Paul Buijsen",
        "Dominika Regentová",
        "Marina Sainz"
    ],
    "title": "A facile and green route to terpene derived acrylate and methacrylate monomers and simple free radical polymerisation to yield new renewable polymers and coatings",
    "date": "2016-01-01",
    "abstract": "We present new acrylic monomers, polymers and coatings derived directly from abundant naturally available terpenes via facile, green and catalytic approaches.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Most of the polymers we consume are derived from oil, but society requires that more and more of our consumable items are derived from natural sources and waste or are simply more carbon neutral. To achieve this, the chemicals industry must move away from the fossil fuel derived monomers that contribute to carbon footprint and add significantly to the energy costs of polymerisation processes and products. Plastics presently account for a global annual usage of more than 7% of all fossil fuels and this figure will undoubtedly grow, particularly as emerging economies expand and begin to consume at the same levels. 1 However, renewable polymers are making little headway with only a very small share (<5%) of the global polymers market, largely because of their perceived high cost and a perception of inferior performance compared with synthetic polymers produced from petroleum sources. 2 If there is to be a significant shift to renewables then we must develop new approaches that can be easily adopted and may simply be \"dropped-in\" to existing processes. They must also provide matching or improved properties and performance, and all this must be achieved without any significant increase in costs. But where will these new monomers and polymers come from?",
                "One potential source of renewable monomers is the terpenes, the most common of which are derived from citrus (e.g. D-limonene) and wood waste (e.g. the αand β-pinenes) (Fig. 1) and are already available on the multi-tonne scale; a scale that is likely to grow dramatically as new industrial biotechnology routes come on stream. 3 There have been significant efforts to create polymers directly from terpenes 4 because their structures contain alkene moieties that appear to offer the opportunity for facile polymerisation via free radical routes using readily accessible conditions. However, extensive research has shown that the terpenes do not easily homopolymerise, and even in the presence of a co-monomer (such as styrene or an acrylate) the level of incorporation of e.g. β-pinene or D-limonene is minimal and Fig. 1 The most commonly available terpenes and terpenoids (mildly oxidised eg carvone and camphor) and the resin acid/rosin (abietic acid). † Electronic supplementary information (ESI) available: Experimental procedures, detailed synthetic and characterisation data for all compounds. See DOI: 10.1039/c6py00357e the polymers produced thus far have only very low molecular weights. 5 A wide range of other methodologies have been applied to polymerise terpenes and have been reviewed extensively. [5][6][7][8] Amongst the few successes, (-)-β-pinene and (-)-α-phellandrene have been shown to polymerise via cationic routes 9 and can form a limited range of co-polymers, but very low temperatures are required (-80 to -40 °C) which cannot be easily reproduced on the commercial scale. Recently, Mecking cleverly utilised ruthenium catalysed ring opening metathesis to polymerise two natural sesquiterpenes, caryophyllene and humulene 10 yielding polymers with low glass transition temperatures (-15 to -50 °C). The method shows great promise, but cannot be applied to the most readily available terpenes. Others have taken different approaches and have modified terpene structures to create more reactive monomers. Hillmyer used a Baeyer-Villiger oxidation to create lactone monomers from menthone and carvone which could then be polymerised via ring-opening using a Zn catalyst to yield new polymers and copolymers with low T g (ca. -27 °C). 11 In a different approach, Coates used careful oxidation of D-limonene to create epoxides that could polymerise with CO 2 through a Zn catalyst 12 to form poly(carbonates) with controlled molecular weight and a high T g (ca. 100 °C) and recently has further demonstrated formation of stereocomplexed polymeric materials. 13 Hillmyer 14 has also shown that two pinene-derived monomers, α-methylp-methylstyrene and myrcene, can be incorporated into ABA tri-block copolymers. A significant step forward, but the processes rely upon anionic polymerisation at -78 °C and require scrupulously anaerobic and anhydrous conditions to make useful materials.",
                "Tang showed a route to prepare functionalised rosin based monomers with an acrylate functionality added via esterification to the naturally occurring carboxylic acid functionality (e.g. abietic acid). 7 Others have taken this route to create materials for negative photoresists. 15 Other related approaches can be found in the patent literature, [16][17][18][19] but all are limited to those few structures that have an available -COOH or -OH functionality for esterification; eliminating the potential to use most of the terpene and terpenoid structures that are commercially available (Fig. 1).",
                "We have taken a different approach. Focussing on the most commercially available terpenes we have developed new routes to prepare readily polymerisable monomers containing either acrylate or methacrylate moieties (Scheme 1). These new monomers undergo facile polymerisation using standard free radical and controlled polymerisation strategies to yield new polymers. In this paper, we describe facile and green synthetic approaches to the new monomers and demonstrate a wide range of new polymers and potential applications of these completely new, renewably sourced materials."
            ],
            "subsections": []
        },
        {
            "title": "Results and discussion",
            "paragraphs": [
                "The four most commercially available terpenes ((+)-α-pinene, (-)-β-pinene, (R)-(+)-limonene and (R)-(-)-carvone) were func-tionalised by adding acrylate and methacrylate groups to their chemical structure (Fig. 2). Our first approach was to modify the terpenes to alcohols, and then esterify with the corresponding acryloyl or methacryloyl chloride.",
                "(+)-α-Pinene, (-)-β-pinene and (R)-(+)-limonene were transformed into alcohol derivatives by use of a hydroboration/ oxidation protocol 20,21 (see Fig. S1 in ESI; † 1a, 2a, 3a). In the case of (R)-(-)-carvone), the corresponding alcohol (4a) was formed by reduction of the ketone functionality with lithium aluminium hydride. 22 The alcohol derivatives are obtained as single diasteromers in every case except for the limonene derivative (3a), which is obtained as a 1 : 1 mixture of diastereomers. 23 This simple but robust chemistry has allowed us to synthesise new terpene-based acrylic monomers in such a scale (50 g) that they can be polymerised (vide infra). However, we recognise that this synthetic route is not sustainable or green. We therefore took steps to improve this by eliminating the use of the toxic acryloyl and methacryloyl chloride and substituting with acrylic and methacrylic acid; both of which will become commercially available from renewable sources. To effect this strategy we introduced propyl phosphonic anhydride (T3P®) 24 to promote ester coupling between terpene alcohols and acrylic acid. This reagent gives an environmentally benign water-soluble triphosphate by-product; considerably more sustainable than chloride in any waste stream.",
                "The terpene-based acrylate and methacrylate monomers synthesized through this 2-step methodology were found to be easily polymerised using standard free radical techniques to yield a range of polymers with very different properties. The molecular weight of the polymer was easily controlled using a standard chain transfer agent e.g. dodecanemercaptan (DDM) (Table 1). For example, polymerisation of the α-pinene derivatives 1b and 1c in the presence of 0.5%, 1% and 5% of DDM produced polymers with molecular weights ranging between 4800 and 23 600 g mol -1 These data clearly show the expected dependence of the glass transition temperature (T g ) with molecular weight, which is observed for all of the polymers.",
                "There is a considerable difference between the α-pinene based polyacrylates (1d) and polymethacrylates (1e) with T g s in the ranges 12-71 °C and 85-142 °C respectively (Table 1 and Fig. 3). The presence of a methyl group in the chain backbone of the methacrylates brings increased steric hindrance to segmental rotation, therefore increasing chain stiffness and raising the T g significantly higher than the acrylate polymers. The α-pinene polymethacrylate (1e) is particularly notable because the T g of 142 °C is very high for an acrylic polymer and starts to approach the glass transition temperature of polycarbonates, which could open up new application opportunities previously inaccessible to acrylic based polymers.",
                "Surprisingly, the carvone-derived acrylate monomer (4b -Table S3 †entry 1) showed a strikingly low conversion at 65 °C. Increasing the reaction temperature to 110 °C raised conversion, but quickly resulted in an insoluble cross-linked gel; in complete contrast to all the other examples that formed readily soluble polymers. In order to synthesise a soluble polymer, 5% DDM was added and the reaction was quenched at 60% conversion just before the gel point. By contrast, the carvone-derived methacrylate polymer (4e) was prepared in high yield (at 65 °C using AIBN initiator) and surprisingly showed no tendency to crosslink. (See ESI † for Experimental detail).",
                "Using FTIR microscopy of thin films of each monomer, we followed these two polymerisations (Fig. 4). The data clearly show that for the methacrylate, only one of the olefinic moieties is consumed whilst for the carvone acrylate, bands corresponding to both terminal double bonds are considerably depleted demonstrating that the crosslinking arises from the reactivity of the exocyclic olefin. This difference in reactivity was likely attributable to initiator attacking to form the more stable thermodynamically favoured tertiary radical at the exocyclic olefin for the acrylate at 65 °C, leading to very low observed yields. At higher temperatures, the acrylic double bond was brought into play leading to cross-linked gels. The FTIR data clearly show consumption of both olefinic moieties. For the methacrylate, initiator attack at either site leads to tertiary radicals, but the electron-withdrawing character made the methacrylic moiety much more favoured and propagation proceeded to linear polymer with no detectable branching or  crosslinking. The FTIR data clearly showed consumption of only the methacrylic olefinic groups when polymerised at high temperature (schematic diagrams and further information in the ESI †). Intriguingly, this leaves the carvone methacrylate polymer with one potentially reactive double bond on each monomer unit; ideal for potential use as a biobased polymeric coating. Such coatings provide protection from corrosion for a wide range of surfaces from metals to ceramics, wood and synthetic materials. Acrylics in particular are valuable for architectural coatings, are the leading finishes in the paint and coatings industry because they are generally inert, and give excellent colour retention. Acrylics are also one of the fastest-growing new coatings accounting for about 25% of all applications, and new coatings derived from renewable resources are likely to play a significant future role.",
                "The relatively high T g (117 °C) of the carvone methacrylate is ideal for powder coatings. We added a commercial crosslinker trimethylolpropane tris(3-mercaptopropionate) (TMPMP (Thiocure®)) along with other processing aids to create a mixture which was then melt-mixed, extruded to a polymer strand and ground to powder. The sieve fraction with particle size below 90 μm was sprayed over aluminium Q-panels using an electrostatic air gun. The plate with the deposited powder was heated for 2 min at 120 °C in an oven to force flow and film formation and subsequently irradiated in a UV curing chamber (see ESI † for Experimental detail). The major advantage of acrylic coatings is that they are valued for their high transparency, gloss and excellent chemical resistance. The coating we obtained was transparent and highly glossy (Fig. 5) giving a moderate PCI smoothness value in the range 2-3. Standard mechanical tests revealed properties that were characteristic of acrylic coatings. The acetone-rub test showed a fully cross-linked coating that was not easily removed. Industry standard pencil hardness scratch testing yielded a highly promising 2B and a König hardness of 185 s.",
                "Challenging the surfaces with a Gitterschnitt (lattice cutter) and initial impact tests gave adhesion results that were consistent with other acrylic powder coating materials (Fig. 6). (Table 2 and see ESI † for Experimental detail).",
                "Finally, to improve upon the two step approach we have developed a new catalytic one pot route to β-pinene based acrylate and methacrylate monomers. We used the seminal work of White on catalytic allylic oxidation 25 as a starting point to develop a catalytic method to incorporate acrylates at allylic positions using C-H oxidation. Initial results using White's conditions of 10 mol% palladium acetate, 1 equivalent of benzoquinone in DMSO and a temperature of 50 °C gave a 16% yield of two completely new monomers 5 and 6 in a 1 : 1  ratio (Scheme 2). Optimisation of catalyst loading, benzoquinone, temperature and atmosphere allowed us to achieve a yield of 82% (10 : 1 ratio of 5 and 6) using just 2 mol% palladium acetate and 2 equivalents of benzoquinone in air at 50 °C. Note that the benzoquinone plays three important roles in this process acting as oxidant and ligand for Pd as well as polymerisation inhibitor for the monomer produced. A significant attraction for further scaling is our use of methacrylic acid as both solvent and reactant (2 equivalents).",
                "Interestingly, Meier 26 also reported palladium-catalysed coupling of acetic acid and limonene, but in their case DMSO was used as solvent with an iron co-catalyst, and gave mixtures of the diastereomeric and regioisomeric products attributed to the two olefinic moieties in limonene. Additionally, Ferret 27 showed coupling of a range of (generally simple) olefinic organic structures with acrylic acid and methacrylic acid. Of these, a limonene coupling showed three regioisomers in an almost 1 : 1 : 1 ratio in poor yield (40%). Whilst the conditions for coupling are similar to the example we give with pinene ( palladium catalyst and benzoquinonebut in their case also manganese dioxide as terminal oxidant), our method gives more than double the yield, and provides a 10 : 1 ratio of just two regioisomers. We believe that our catalytic system is significantly more flexible and hints at a more environmentally acceptable route to creating new monomers, whilst complementing the prior work on limonene.",
                "When the mixture of the two new methacrylate monomers (5 and 6) was heated at 65 °C in presence of AIBN full conversion led to an insoluble polymer, confirming ease of polymerisation and demonstrating that the retained exocyclic olefinic moiety does, as expected, lead to crosslinking (see ESI † for Experimental detail)."
            ],
            "subsections": []
        },
        {
            "title": "Conclusions",
            "paragraphs": [
                "In conclusion, we present a new approach to create novel polymers from readily available terpenes. Our approach requires simple, clean chemistry to create new acrylate and methacrylate monomers and we have further demonstrated a facile onepot catalytic approach that could be utilised on the large scale. Using completely standard methodologies, the monomers can be polymerised into useful materials with a wide range of physical properties. As an example we demonstrate preparation of a promising renewable acrylic powder coating using industry standard procedures. We will now use our full palette of available terpene monomers to optimise hardness, adhesion and impact resistance.",
                "Fig. 6 The Gitterschnitt (lattice cutter) is an industry standard method for assessing adhesion. These data show that there is some delamination, but this is typical for acrylic coatings.  Notes and references"
            ],
            "subsections": []
        },
        {
            "title": "Acknowledgements",
            "paragraphs": [
                "We thank Gert Dijkstra for assistance with powder coatings (DSM). We also acknowledge the assistance of undergraduate students Chris Seymour, Amy Stimpson & Andrew Law. We thank also Richard Wilson, Pete Fields, Martin Dellar and Mark Guyler (University of Nottingham) for their invaluable technical input."
            ],
            "subsections": []
        },
        {
            "title": "Funding statement",
            "paragraphs": [
                "The research leading to these results (MFS & STT) has received funding from the People Programme (Marie Curie Actions) of the European Union's Seventh Framework Programme FP7/ 2007-2013/under REA grants agreement no. [289253]. We are also grateful for EPSRC (Impact Accelerator Funding) EP/ K503800/1 (DR)."
            ],
            "subsections": []
        }
    ]
}