{
    "id": "https://semopenalex.org/work/W2119311209",
    "authors": [
        "Guillermo J. Tearney",
        "Jian Ren",
        "Changhuei Yang",
        "Xiquan Cui"
    ],
    "title": "Wavefront image sensor chip",
    "date": "2010-07-23",
    "abstract": "We report the implementation of an image sensor chip, termed wavefront image sensor chip (WIS), that can measure both intensity/amplitude and phase front variations of a light wave separately and quantitatively. By monitoring the tightly confined transmitted light spots through a circular aperture grid in a high Fresnel number regime, we can measure both intensity and phase front variations with a high sampling density (11 microm) and high sensitivity (the sensitivity of normalized phase gradient measurement is 0.1 mrad under the typical working condition). By using WIS in a standard microscope, we can collect both bright-field (transmitted light intensity) and normalized phase gradient images. Our experiments further demonstrate that the normalized phase gradient images of polystyrene microspheres, unstained and stained starfish embryos, and strongly birefringent potato starch granules are improved versions of their corresponding differential interference contrast (DIC) microscope images in that they are artifact-free and quantitative. Besides phase microscopy, WIS can benefit machine recognition, object ranging, and texture assessment for a variety of applications.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "A light wave contains two primary sets of characteristics -intensity/amplitude variations and phase front variations. At present, all commercial image sensor chips are designed to operate much like our retinas and are only responsive to the intensity variations of the light wave. However, the phase front of the light wave carries additional information that may not be present in the intensity variations. For example, many biological specimens are effectively transparent and only modulate the phase front of light transmitted through them. Optical phase microscopes are greatly valued for their ability to render contrast based on refractive index variations in unstained biological samples, and are useful in biomedical applications where minimal sample preparation procedures are required. Such applications can include field analysis of bloodborne and waterborne pathogens [1] where cost considerations and ease-ofuse are important, and analysis of biopsy sections to determine tumor margins during surgical procedures where rapid processing is critical [2]. The phase microscopes are also critical in scenarios where staining is undesirable or simply not an option. Such applications include examinations of oocytes and embryos during in-vitro fertilization procedures [3], and longitudinal imaging of live cells or organisms [4].",
                "DIC microscopes [5] and, to a lesser extent, phase contrast microscopes [6] and Hoffman phase microscopes [7] have been the primary phase microscopes of choice for the past five decades. However, the phase information is mixed with the intensity information for these phase microscopy techniques. This limitation introduces ambiguities in the rendered images and, additionally, prevents straightforward quantitative phase analysis. Moreover, these phase microscopes require special optical components that have to be switched in and out during operation. Additionally, DIC images of birefringent samples, such as muscle tissues and collagen matrices, can have significant artifacts as the DIC microscope uses polarization in its phase-imaging strategy [8]. The relative high cost of such systems also prevents the broader use of such phase microscopes. In recent years, numerous novel phase microscopy techniques have been developed [9][10][11]. However, the need for laser sources and the relatively high level of sophistication have thus far impeded the broader adoption of these techniques as a convenient and viable replacement for the DIC microscopes. Quantitative optical phase [12] can also be calculated by collecting 2 or 3 successive images of the sample around its focal plane. However, this technique requires the physical actuation of the camera to be placed in distinct positions, and is therefore intrinsically limited in speed. Finally, these systems typically use relatively complex and bulky optical arrangements to translate the phase front variations into the intensity variations that are then detectable by commercial image sensor chips.",
                "Based on our proof-of-concept experiment [13], we believe that the implementation of a sensor chip that is capable of phase front sensing can provide a simpler and more sensible solution. Such a sensor chip can substitute for the conventional camera in a standard microscope and provide a more direct means for performing phase imaging. If such a chip can be fabricated at the foundry level, it can significantly lower the cost of phase microscopy systems and allow greater phase imaging access to the broader biomedical community.",
                "In this paper, we report the implementation of such an image sensor chip, termed wavefront image sensor chip (WIS), that is capable of simultaneously measuring both the intensity and the phase front variations of an incident light field. The basic WIS design is closely related to the Hartmann sieve [14] -the predecessor of Hartmann Shack sensors. Here we incorporate a grid of apertures directly on a sensor chip at close proximity to the sensor pixels. Unlike in a typical Hartmann sieve design, the WIS is able to achieve a high grid density by operating in a high Fresnel number regime.",
                "In the Section 2, we will describe the implementation and characterization of the first fully integrated WIS prototype device. In the Section 3, we will demonstrate its capability for converting a standard microscope into a wavefront microscope (WM). In the Section 4, we will report the use of the WM for imaging polystyrene microspheres, unstained and stained starfish embryos, and strongly birefringent potato starch granules. In the Section 5, we will discuss the challenges and opportunities of the further development of the WIS. In the Section 6, we will conclude by briefly discussing the other applications of the WIS beyond enabling wavefront microscopy."
            ],
            "subsections": []
        },
        {
            "title": "Wavefront Image Sensor Chip",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Principle",
                    "paragraphs": [
                        "The WIS consists of a 2D array of circular apertures defined on top of a metal coated image sensor chip (e.g. a charge-coupled device (CCD) or complementary metal-oxidesemiconductor (CMOS) chip); a transparent spacer separates the apertures from the sensor pixels (Fig. 1(a), 1(b)). The coordinate systems we use in this paper are shown in Fig. 1(b). When a plane light wave is incident upon the aperture array, the transmission through each aperture forms a projection spot on the sensor pixels underneath. When a light wave with an unknown wavefront impinges upon the aperture array, the center of each projection spot will shift according to the phase gradient of the light wave over its corresponding aperture. Mathematically, this shift in the s direction can be expressed as:",
                        "when ( , )",
                        ", where H is the distance from the aperture to the image sensor chip, ( , )",
                        "x x y θ is the wavelength-independent normalized phase gradient of the light wave in the x direction over the aperture ( , )",
                        "x y , λ is the wavelength of the light wave, n is the refractive index of the spacer material, and ( , ) / x y x ϕ ∂ ∂ is the wavelength-dependent phase gradient in the x direction over the aperture (See Fig. 1(a), 1(b) for coordinate references) [13]. Corresponding expressions for the light wave in the y direction can be written in a similar fashion. The close relationship between θ x and ( , ) / x y x ϕ ∂ ∂ , and our subsequent choice of using θ x deserve some elaboration. The normalized phase gradient θ x (and θ y ) can be appreciated as a wavelength-independent measure of the angle at which the incoming light impinges upon the aperture. In other words, θ x (and θ y ) measures the directionality of the incoming light wave. As the light source employed in these experiments is a broadband halogen lamp in a standard microscope, the choice of θ x (and θ y ) for subsequent discussions is a more appropriate one. In addition to providing a measure of θ x (and θ y ), each projection spot also provides a measurement of the local intensity of the light wave over its corresponding aperture. We obtain this value by summing the total image sensor signal associated with the projection spot (Fig. 1(b)). Therefore, the WIS is able to retrieve the intensity and phase information of the unknown light wave separately by simply evaluating two independent aspects of each projection spot. We assign a grid of N × N pixels underneath each aperture to measure the transmission and shift of the projection spot. It has been proven in other studies [15,16] that estimating the shift of the projection spot with subpixel precision can be achieved with excellent precision even when the number of pixels involved (N) is small. If an image sensor chip with MN × MN pixels is used, we can then create a WIS with M × M apertures, or effectively generate a light wave image of M × M pixels. Throughout this article, we will refer to the pixels on the image sensor as sensor pixels, and the smallest image point in the rendered light wave image as image pixels.",
                        "WIS has close parallels to the Shack-Hartmann sensor [17] and its predecessor, the Hartmann sieve [14]. The Hartmann sieve, which consists of a macro-scale aperture array arranged above an image sensor grid, was first proposed as a system for examining the optical aberrations of a telescope. However, the broadened light spots due to diffraction in such a system significantly limit sensitive detection and necessitate wide separation between the apertures, which in turn also limits the number of useful image pixels. The incorporation of the lens array into Shack-Hartmann sensors allowed the formation of tighter light spots. Nevertheless, the relatively large lens dimensions (typically on the order of 100 microns), the associated low image pixel numbers and the general assembly difficulties have limited such sensors to phase measurements of relatively simple wavefronts in astronomy, metrology, and ophthalmology [14].",
                        "Our technology differs from these conventional methods in that we recognize that the projection spot from an aperture placed in appropriately close proximity to an image sensor grid operates in a high Fresnel number optical regime (0.86 in our case) (more specifically, ",
                        ") and can therefore be tightly confined (Fig. 1(c)). In other words, light transmitted through an aperture would actually focus itself near the aperture before spreading (diffraction); we design our device such that the image sensor grid is located at the plane where this self-focusing occurs. Additionally, the lateral shift of this projection spot is still responsive to the phase front gradient of the incident light wave. These two facts enable us to create a simple-to-implement, highly compact (over a sensor area of 3.08 mm × 3.85 mm), high-density (11 µm spacing between apertures), high image pixel count (280 × 350 image pixels) and highly sensitive WIS chip."
                    ],
                    "subsections": []
                },
                {
                    "title": "Self-focusing effect of the WIS apertures in the high Fresnel number regime",
                    "paragraphs": [
                        "We performed both a 3D and broadband finite-difference time-domain (FDTD) simulation (CST Microwave Studio from CST of America, Inc.) to determine the distribution of the light transmitted through a WIS aperture. The aperture diameter was set at 6 µm, and the refractive index of the spacer material was set at 1.6 (Fig. 1(c)). To reduce the complexity of the simulation, a 150 nm thick perfect electric conductor (PEC) film was modeled in place of the Al layer we deposited on our WIS chip. As we used a broadband light source -a halogen lamp -for all experiments in this article, our simulation was performed over the entire spectrum range of the halogen lamp (473 -713 nm) at a wavelength interval of 20 nm. We summed the spectrally weighted power flow distributions to approximate the real light projection of the WIS aperture. As we can see from Fig. 1(c), the light projection shrinks to a tightly confined spot (in the high Fresnel number regime) before expanding in an approximately linear fashion (as predicted by considering diffraction in the low Fresnel number regime).",
                        "Next, we implemented an experiment to quantitatively measure the actual projection light spot of a WIS aperture. First we punched a 6 µm aperture on an Al coated (150 nm thick) glass cover slip (refractive index of 1.5) with a focused ion beam (FIB) machine. Then we illuminated the aperture with the halogen lamp, and used a microscope with an oil immersion 100 × objective lens (N.A. = 1.3) to image the projection spot at different axial displacement (Fig. 2). The result is plotted in Fig. 1(d). We can see that the spot's width (full width at half maximum -FWHM) reached a minimum (measured width = 3.8 µm) at an axial displacement of H = 18 µm -37% smaller than the aperture diameter itself. This spot size confinement is surprisingly robust; we found that the spot diameter remained below 5 µm (FWHM) for H ranging between 4 and 34 µm. We note that these simulation and experiment results share similar trends but do differ to some extent. We believe that the discrepancies are attributable to the aperture profile difference (the experimentally milled apertures tend to be rounder around the edges and texturally rougher than the simulation ideals), the limitation of the finite grid density associated with the simulation and the inadequacies of the simulation's spectral range coverage. Our WIS prototype was designed and implemented based upon our experimental findings."
                    ],
                    "subsections": []
                },
                {
                    "title": "Fabrication",
                    "paragraphs": [
                        "Our high-density WIS (Fig. 3(a), 3(b)) prototype was fabricated with a commercially available CMOS image sensor chip (MT9P031I12STM from Aptina Imaging) as the substrate. There are 1944 × 2592 pixels of size 2.2 µm on the sensor. We removed its glass window to gain access to the surface of the sensor. Next we planarized the surface of the sensor die with a 10 µm thick layer of SU8 resin, and then coated it with a 150 nm thick layer of Al to mask the sensor from light. The SU8 layer served two functions. First, the SU8 layer nullified the optical properties of the lens on top of each sensor pixel. These tiny and relatively low-quality lenses are ubiquitous in the current generation of CMOS sensors. They serve to more efficiently funnel light onto the light sensitive region of the sensor pixels. Their presence should have minimal impact on our WIS prototype and, in fact, they should improve light collection efficiency and boost our signals. However, to make our initial WIS demonstration clear and unambiguous, we decided to nullify the lenses with the SU8 layer. The SU8 also served as a spacer between the Al layer and the sensor pixels. A stack of proprietary materials in the sensor functioned as an additional spacer as well. Next, we used photolithography to create a 2D aperture array (280 × 350 apertures, 6 µm aperture diameter and 11 µm aperture-to-aperture spacing) onto the Al film (Fig. 3(a)). We assigned a dedicated grid of 5 × 5 sensor pixels underneath each aperture to detect the associated projection spot. For all experiments discussed in this article, the total signal accumulation time was 1.0 second. This integration time directly relates to our phase gradient sensitivity and can be reduced with a trade-off in decreased sensitivity. The typical light intensity on the sensor is 9.2 µW/cm 2 . The summation of the signals detected by these pixels is a measure of the light intensity on the aperture. The lateral shift of the projection spot is related to the normalized phase gradient of the incident light over the aperture. We employed the algorithm described in Section 2.4. to determine the lateral shift with excellent sub-pixel accuracy. This algorithm is a modified version of the Fourier-demodulation algorithm for wavefront sensing [18]. By assuming the effective refractive index of the whole stack of the SU8 and proprietary materials is 1.6, we estimated that the distance H from the aperture to the actual photosensitive area of the sensor pixels was 28 ± 1 µm (Section 2.5.). This configuration generated smoothly focused aperture projections on the image sensor chips, and enabled good performance of our WIS prototype. Based on our experimental data in (Section 2.2.), we determined that the projection spots have the diameter of 4.5 µm (FWHM) -25% narrower than the parent apertures. The slight mismatch between our achieved and the optimal spot size is attributable to the fact that our fabricated effective SU8 spacer thickness was larger than expected. Nevertheless, we expected this WIS prototype to be able to perform well.",
                        "Our calibration experiments (Section 2.5.) established that under the typical working condition we can determine the center of the projection spot with a precision of 1.8 nm (equal to 8 × 10 -4 sensor pixel width); this translates to a local normalized phase gradient sensitivity of 0.1 mrad. Our experiments also show that we can measure the local normalized phase gradient linearly over a range of +/-15 mrad. This range is adequate in addressing our microscopy application needs. If desired, our WIS prototype is capable of measuring normalized phase gradients over a broader range as long as we collect a more extended set of calibration data."
                    ],
                    "subsections": []
                },
                {
                    "title": "Cyclic algorithm for estimating the center of each projection spot",
                    "paragraphs": [
                        "The centroid method is the most straightforward algorithm for determining the center of each projection spot. However, because the centroid method assigns significant weights to the more noise-corrupted data from dark pixels, it is intrinsically an unstable position estimator. The Fourier-demodulation algorithm, recently developed by Ribak's group [18], for dealing with light spots arranged in an approximately regular grid is intrinsically more robust. We developed a modified version, termed cyclic algorithm, that is suited for our purpose. This algorithm uses cyclic and uni-norm complex weights. To clearly illustrate its principle, we will first discuss the cyclic algorithm for the 1D case in the s direction. Suppose the distribution of a light spot on the image sensor chip is ( )",
                        ", then we can define a complex number 0 s ɶ for its initial position, / 2 0 / 2"
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "( ) exp(",
            "paragraphs": [
                ") .",
                "If the center of the light spot shifts s ∆ , the complex number 1 s ɶ for the second position will be",
                ") .",
                "The last approximation is true when s T ∆ << , which is usually the case for the wavefront microscopy. We can see that 1 s ɶ is nothing but 0 s ɶ rotated by an angle 2 s T π ∆ in the complex plane, so the shift of the light spot can be easily calculated from the above two complex numbers,",
                "For the discrete data from the 2D image sensor pixels, we assigned a dedicated grid of 5 × 5 sensor pixels (the horizontal and vertical indexes of the pixels are m = -2, -1, 0, 1, 2 and n = -2, -1, 0, 1, 2 respectively) underneath each aperture to measure the shift of the light spot, and we replaced the integrals in Eq. ( 2)-( 4) with summations, ",
                "There might be some bias introduced by this simple replacement. However, this bias can be corrected with careful calibrations (Section 2.5.). In order to test the linearity and sensitivity of our WIS, we introduced a specific normalized phase gradient to all WIS apertures (Fig. 4(a), 4(b)) by illuminating them with a plane halogen light at a corresponding incident angle. Figure 4(c), 4(d) show good linearity of the normalized phase gradient responses in both the x and y directions. Each data point is the average normalized phase gradient measurement of the 350 apertures from the central row of our WIS; each error bar corresponds to the standard deviation among them. This normalized phase gradient variation between these apertures is ~0.5 mrad."
            ],
            "subsections": [
                {
                    "title": "Calibration experiment for the normalized phase gradient response of our WIS",
                    "paragraphs": [
                        "From the slopes of the calibration curves, we can estimate the distance from the WIS apertures to the photo-sensitive areas of the sensor pixels. They are 27.2 µm and 28.0 µm in the x and y directions respectively, assuming the effective refractive index of the whole stack of the SU8 and proprietary materials is 1.6. The discrepancy between these two numbers might be due to the slight aperture-pixel misalignment in the x and y directions.",
                        "From the fluctuation of each aperture projection spot over time, we estimate that the sensitivity of our normalized phase gradient measurement is better than 0.1 mrad under the typical working condition -1.0 second total signal accumulation time and 9.2 µW/cm 2 light intensity on the WIS. Besides the normalized phase gradient of the light wave, the normalized intensity gradient can also induce a shift to each aperture projection spot of the WIS. For example, if at the center of a WIS aperture (with a radius of a ) the intensity gradient of the light wave is 0 / I x ∂ ∂ and the intensity is 0 I (Fig. 5), the center of the projection spot will be shifted by approximately: "
                    ],
                    "subsections": []
                },
                {
                    "title": "Influence of the normalized intensity gradient to the measurement of the normalized phase gradient by the WIS",
                    "paragraphs": [
                        "assuming the intensity change is slow over the WIS aperture, i.e. as the normalized intensity gradient over the WIS aperture under consideration. The shift of each projection spot is proportional to the normalized intensity gradient over its corresponding aperture, and it can be reduced by decreasing the size of the aperture. In addition, since the projection spot spreads out symmetrically as we increase the distance H from the aperture to the CMOS image sensor, the normalized intensity gradient induced shift is constant with respect to the distance H. Therefore, we can also reduce the influence of the normalized intensity gradient to the measurement of the normalized phase gradient by increasing the distance"
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Wavefront microscopy setup",
            "paragraphs": [
                "By employing our WIS chip in place of the conventional camera in a standard bright-field microscope, we can transform the standard microscope into a WM that is capable of simultaneously acquiring bright-field and quantitative normalized phase gradient images. The operation and Köhler illumination associated with a standard microscope can be found in Ref [19].",
                "To demonstrate that this is indeed a viable camera-based device for converting a standard microscope into a WM, we attached it to an Olympus BX 51 microscope via its camera port (Fig. 3(c)). The microscope was outfitted with a standard halogen microscope light source. We also equipped the microscope with push-in and pull-out DIC prisms and polarizers, so that the microscope could be easily reconfigured into a DIC microscope for comparison. We used a CMOS image sensor chip of size 9.9 µm pixels (MT9V403C12STM from Micron technology, Inc.) to record the DIC images. This allowed for a fair comparison of the image quality as the effective image pixel size of our WIS device is 11 µm. We note that such a microscope operating with 40 × , N.A. = 0.75 objective has a resolution of 0.49 µm. As the microscope magnifies the image by the magnification factor, the projected image should have a resolution of 20 µm. Since our WIS prototype has an effective image pixel size of 11 µm (~2 times the image resolution -Nyquist criterion consideration), its use with this particular microscope will allow the microscope to accomplish a resolution of 0.55 µm (only 10% off its specific resolution). In general, our WIS prototype performs even better with higher magnification objectives. For example, a 60 × , N.A. = 0.9 objective and a 100 × , N.A. = 1.3 objective based microscope would be able to achieve their specific resolution of 0.41 µm and 0.28 µm, respectively, with our WIS prototype. For a 20 × , N.A. = 0.5 objective based microscope, we note that the images collected in this particular microscope configuration have a resolution of 2.2 µm instead of the specified microscopy resolution of 1.2 µm because the image can only be sampled at a sub-Nyquist rate by the WIS prototype. This problem can be resolved by designing the WIS prototype with a smaller aperture-to-aperture pitch.  Figure 6(c)-6(e) are the images of the WM, the intensity image (Fig. 6(c)), the normalized phase gradient image in the y direction (Fig. 6(d)), and the normalized phase gradient image in the x direction (Fig. 6(e)) of the microspheres respectively, that are rendered from a single data acquisition process. We can see that the intensity image of the WM is consistent with the bright-field image, and the normalized phase gradient image of the in the y direction is consistent with the DIC image. However, the normalized phase gradient image of the WM in the x direction contains phase information orthogonal to the DIC image and the directional normalized phase gradient image of the WM in the y direction."
            ],
            "subsections": []
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Polystyrene microspheres",
                    "paragraphs": [
                        "As we discussed in the Section 2.6., the normalized intensity gradient can contribute to the measurement of the normalized phase gradient by the WIS. We have developed a method to remove the component of the normalized intensity gradient from the normalized phase gradient images in this article (Fig. 6, 8-10). Here we will use the WM imaging of the microspheres in the x direction as an example to illustrate this procedure. First, we use the intensity image of the WM to calculate the normalized intensity gradient in the x direction over each WIS aperture. Then, we use the Eq. ( 7) to calculate the component of the normalized intensity gradient PhasGrad",
                        "As we can see from the comparison of the line profiles from the above three images (Fig. 7(d)), the component of the normalized intensity gradient is large at the edges of the microspheres, but is moderate at the most part of the sample. "
                    ],
                    "subsections": []
                },
                {
                    "title": "Unstained starfish embryo in the late gastrula stage",
                    "paragraphs": [
                        "To demonstrate the potential utility of the WM in the biological imaging, we used our prototype to image an unstained starfish embryo in the late gastrula stage. The sample was fixed by 10% formalin, and sandwiched between a microscope slide and a cover slip. A 20 × objective lens (N.A. = 0.5) and a condenser lens (N.A. = 0.35) were used during imaging. Figure 8(a), 8(b) are the acquired bright-field and DIC images of the starfish embryo. Because the sample was not stained, the DIC image provided much better contrast than the bright-field image. Figure 8(c)-8(e) are the images of the WM. We can see that the intensity image of the WM is consistent with the bright-field image, and the normalized phase gradient image of the WM in y direction is consistent with the DIC image. However, the normalized phase gradient image of the WM in x direction contains phase information orthogonal to the DIC image and the normalized phase gradient image of the WM in y direction. The phase of a light wave is a fixed scalar potential function, so our two orthogonal normalized phase gradient θ x and θ y images are a complete set of the phase gradient information for the sample. They can be represented in other forms that are more amenable to the specific needs of doctors or bio-scientists. For example, the magnitude of the phasegradient-vector,   It is well known that the DIC image carries mixed amplitude and phase information of the sample image [20]. As such, stained samples can generate ambiguous DIC images where a dark spot in the images may be attributable to an absorption site or a location where the normalized phase gradient has a large negative value. In this experiment, we imaged a stained starfish embryo in the early gastrula stage (fixed by 10% formalin and stained with hematoxylin) to demonstrate the advantage of the WM over the DIC microscope in imaging stained samples. The stained starfish embryo appears as dark regions in both the bright-field (Fig. 9(a)) and the DIC image (Fig. 9(b)). In contrast, the WM rendered relief-like normalized phase gradient images (Fig. 9(d), 9(e)), which is the signature of a correct phase gradient image. The comparison of the line profiles (Fig. 9(f)) from the DIC image and the phase gradient image of the WM in the y direction further highlights the difference. Because there is no structure at this focus in the blastocoel area, we would have expected the brightness of this area to be the same as the background. However, the DIC trace has an obvious signal dip in the middle that is attributable to light absorption by the stain while such a dip is absent from the WM trace. Additionally, the bright-field and the intensity images of the WM (Fig. 9(a), 9(c)) are very similar in appearance. More excitingly, we can see the fertilization membrane in the normalized phase gradient image of the WM in the x direction, which is absent in all the other images (Fig. 9(a)-9(d)). A 20 × objective lens (N.A. = 0.5) and a condenser lens (N.A. = 0.35) were used during imaging. Many biological samples, such as muscle tissues and collagen matrices, show strong birefringence due to their asymmetrical material properties. The DIC microscope generates severe artifacts when imaging a birefringent sample. This is because the difference in refractive indices in orthogonal directions of the sample disrupts the polarization condition in the DIC microscope [13,21]. The WM does not rely on the manipulation of polarized light for its phase imaging ability and, as such, we can expect the WM to image birefringent samples well. In the third set of experiments, we imaged potato starch granules (on a microscope slide and exposed to the air) which is known to be birefringent. A 20 × objective lens (N.A. = 0.5) and a condenser lens (N.A. = 0.35) were used during imaging. As with our other experiments, the bright-field image and the intensity image of the WM (Fig. 9(a), 9(c)) are consistent with each other. However, the severe birefringence artifact (the dramatic brightness variation on the granules) in the DIC image (Fig. 9(b))) hindered the viewing of the potato starch granules. In contrast, our WM did not generate the birefringent artifact, and the ball shape is clearly revealed in the normalized phase gradient images (Fig. 9(d), 9(e)). Finally, we note that the images collected in this particular microscope configuration have a resolution of 2.2 µm instead of the specified microscopy resolution of 1.2 µm because the image can only be sampled at a sub-Nyquist rate by the WIS prototype. This problem can be resolved by designing the WIS prototype with a smaller aperture-to-aperture pitch."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "The added low-cost and convenient phase front sensing ability of the WIS does come at a price. First, we sacrifice the number of image pixels that the sensor possesses for this added ability. Fortunately, today's image sensor chip has an abundance of pixels and is in fact reaching a point where the number of pixels exceeds the number of useful resolvable image points that the associated optical system can deliver. For applications that require a phase measurement, the consolidation of these sensor pixels that reduces the number of useful image pixels and that adds the phase front sensing ability is therefore a worthy one. Second, the WIS necessarily collects less light than a normal image sensor chip as only a fraction of the total incident light will transmit through the aperture sieve -for our prototype, < 23% of the light is transmitted by the aperture sieve. The trade-off of potential light sensitivity for greater sensor functionality is not unique to our WIS sensor. A typical commercial color sensor chip based on a Bayer color filter pattern likewise sacrifice 75% of incident red and blue light to obtain its color functionality. Our particular prototype has an additional loss mechanism -the nullification of the lens above each sensor pixel prevents efficient channelling of the light to the actual sensing area of each pixel. This loss mechanism can be eliminated in future WIS designs by allowing that lenslet grid to be preserved during the fabrication process. Third, due to the averaging of signals from the N × N sensor pixels involved for image pixels, our rendered intensity images would contain more readout noise. This issue can be addressed by collecting the phase and intensity images separately and allowing pre-readout binning of relevant sensor pixels during the intensity image acquisition step.",
                "The ability to perform quantitative phase imaging is useful in numerous applications. For example, we can use this phase imaging capability to quantify the optical thickness of a cell or organelle [22], and to determine the chemical concentration in a microfluidic system [23]. Currently, performing such measurements requires fairly sophisticated and well designed interferometer schemes. The use of the WIS in a WM provides an alternate approach that is simple to set up and easy to use.",
                "Finally, it is worth noting that the incorporation of WIS functionality into a color sensor can be accomplished by starting with a substrate sensor chip that has stratified color sensing sites (such as Foveon X3). The implementation is straight forward in this case. WIS capable color sensors can also be built with the conventional color sensors with Bayer color pixel arrangements as long as more sophisticated projection spot localization algorithms are developed. The development of such sensors will simplify a microscopist's camera choicewith WIS functionality and color imaging capability on the same sensor, a microscopist would not need to switch between different cameras to collect phase-gradient and color images."
            ],
            "subsections": []
        },
        {
            "title": "Conclusion",
            "paragraphs": [
                "We have created the first integrated high-density WIS, and have demonstrated that this sensor is a viable camera sensor replacement that can transform a standard microscope into a WM. This WM not only provides standard bright-field images, but it can also provide quantitative normalized phase gradient images. These images are improvements over standard DIC images in that 1) they are quantitative, 2) immune to birefringence-generated artifacts, 3) and they clearly separate the intensity and phase information of a light wave. In a practical context, they are easy to use, cheap to implement and does not require the use of complex bulk optical arrangements. The required fabrication processes are compatible with semiconductor foundry procedures and, as such, WIS can be cheaply made in large quantities in much the same way commercial image sensor chips are currently made. Another advantage of the WIS is that it can be easily adapted into most standard optical microscope systems without any major modification. It provides an easy and cost-effective solution for researchers and clinicians to incorporate phase imaging functionality into their current microscope systems. The use of the WIS in a microscopy format can further include corrections of the aberrations generated by the heterogeneity of tissue samples via adaptive optics strategies to facilitate deep tissue imaging of multiphoton microscopy [24,25].",
                "Since the WIS is fully capable of capturing light intensity variations, it can serve as a direct camera chip replacement in other applications beyond the microscopy applications mentioned earlier. A camera that can image a wavefront is potentially useful in adaptive optics, machine recognition (for determining if a corner is pointed in or out), texture assessment, and object ranging. Among other applications in the medical field, this technology can significantly impact LASIK surgery and high-resolution retinal imaging. As the cost for transforming a standard image sensor chip into a WIS is incremental on the foundry level, this is a low-cost and compact wavefront sensor that can address new applications for which the current wavefront sensing standard, the Shack -Hartmann sensor, is simply too costly and bulky to contemplate."
            ],
            "subsections": []
        },
        {
            "title": "Acknowledgements",
            "paragraphs": [
                "We are grateful for the constructive discussions with and the generous help from Professor Paul Sternberg, Professor Scott Fraser, Professor Colin J.R. Sheppard, Shan Shan Kou, Dr. Thomas Vangsness, Dr. Jigang Wu, Emily Mcdowell, Andrea Choe, Sean Pang, Guoan Zheng, Tony Wu, and Anne Sullivan. A portion of this work was done in the UCSB nanofabrication facility, part of the NSF funded NNIN network. The assistance from Caltech Kavli Nanoscience Institute, Watson cleanroom, and Aptina Imaging is much appreciated. This project is funded by the Wallace Coulter Foundation, NSF career award BES-0547657 and NIH R21EB008867."
            ],
            "subsections": []
        }
    ]
}