{
    "id": "US20190055205",
    "authors": [
        "Mingji Dai",
        "Zhishi Ye"
    ],
    "title": "New Methods for 1,4-Diazo N-Heterocycle Synthesis",
    "date": "2018-07-13 00:00:00",
    "abstract": "The present disclosure relates to novel synthetic method of making 1, 4-diazo N-heterocycles via intermolecular amphoteric diamination of allenes, and to the compounds made by the novel synthetic method.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "The present disclosure relates to novel synthetic methods of making 1,4-diazo N-heterocycles via intermolecular amphoteric diamination of allenes, and relates to the compounds made by the novel synthetic method."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define technical field"
                    ],
                    "num_characters": 211,
                    "outline_medium": [
                        "define technical field"
                    ],
                    "outline_short": [
                        "define technical field"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "This section introduces aspects that may help facilitate a better understanding of the disclosure. Accordingly, these statements are to be read in this light and are not to be understood as admissions about what is or is not prior art.",
                        "More than half of the FDA-approved small-molecule therapeutics contain at least one N-heterocycles. Among N-heterocycles, the saturated 1,4-diazo heterocycles including piperazine, 1,4-diazepane, and 1,4-diazocane are highly important for the development of new therapeutics. However, there is a significant lack of structural diversity of these 1,4-diazo heterocycles, especially their substation pattern on the carbon atoms, due to the lack of efficient methods or the synthetic limitations of the existing methods to synthesize these N-heterocycles.",
                        "Novel synthetic method to prepare novel diazo heterocycles are therefore needed."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate novel synthetic methods"
                    ],
                    "num_characters": 871,
                    "outline_medium": [
                        "motivate novel synthetic methods"
                    ],
                    "outline_short": [
                        "motivate novel synthetic methods"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "The present disclosure provides novel and convenient amphoteric diamination strategy to synthesize carbon-substituted 1,4-diazo N-heterocycles in a one-pot reaction. This strategy assembles readily available 1,2-, 1,3- or 1,4-diamine derivatives with electron-deficient allenes via a formal [n+2] (n=4, 5, 6) cyclization mode with an appropriate reagents such as N-iodosuccinimide (NIS) or a combination of N-chlorosuccinimide and KI to produce various piperazines, 1,4-diazepanes, and 1,4-diazocanes, respectively. The reaction features mild reaction conditions, high functional group tolerance, and scalability (gram scale). The reagents are cheap and readily available and no precious transition metal catalysts are needed. In addition to a direct one-pot reduction to the corresponding fully saturated N-heterocycles, the present disclosure also demonstrated that the primary vinylogous amide products can be converted to much more sophisticated products by using a trifluoromethyl addition or an intromolecular Mannich reaction.",
                        "The present invention provides compounds with novel structures that may possess one or more of the following activities: antibacterial, antifungal, antiviral, anticancer, and antiparasitic activity. The compounds disclosed in the present disclosure may also be used for the compound building block for the development of new therapeutics. Specifically, the compounds of the present invention are represented in Formula I below:",
                        "or any derivative or salt thereof, wherein\n\n\n- - R¹ is R⁵—S(═O)₂—, or a nitrogen protecting group selected from the\n    group consisting of acetyl (Ac), trifluoroacetyl (TFA),\n    trichloroacetyl (TCA), tert-butyloxycarbonyl (Boc), carbobenzyloxy\n    (Cbz), vinyloxycarbonyl (Voc), allyloxycarbonyl (Alloc), and\n    9-fluorenylmethyloxycarbonyl (Fmoc);\n  - R² is optionally substituted C₁-C₁₂ straight or branched alkyl,\n    C₁-C₁₂ alkenyl, C₁-C₁₂ alkynyl, C₃-C₁₀ cycloalkyl, C₃-C₁₀ hetero\n    cycloalkyl, wherein one or more hydrogen is optionally substituted\n    by an optionally substituted aryl, heteroaryl, C₃-C₁₀ cycloalkyl,\n    C₃-C₁₀ hetero cycloalkyl, F, Cl, Br, I, hydroxyl, C₁-C₈ alkoxyl,\n    amino group, or NHBoc, or R² may form a fused ring with one adjacent\n    carbon atom next to the nitrogen that R² is attached;\n  - R³ and R⁴ are each independently H, optionally substituted C₁-C₁₂\n    straight or branched alkyl, C₁-C₁₂ alkenyl, C₁-C₁₂ alkynyl, C₃-C₁₀\n    cycloalkyl, C₃-C₁₀ hetero cycloalkyl, or an electro withdrawing\n    group (EWG), wherein at least one of R³ and R⁴ is an electro\n    withdrawing group.\n  - R⁵ is optionally substituted C₁-C₁₂ straight or branched alkyl,\n    C₁-C₁₂ alkenyl, C₁-C₁₂ alkynyl, C₃-C₁₀ cycloalkyl, C₃-C₁₀ hetero\n    cycloalkyl, aryl, heteroaryl; and\n  - X is a C₂-C₄ saturated carbon linker, wherein C₂-C₄ saturated carbon\n    linker is optionally substituted with 4-8 hydrogen, 4-8 optionally\n    substituted C₁-C₁₂ straight or branched alkyl, wherein one of the\n    4-8 optionally substituted C₁-C₁₂ straight or branched alkyl may\n    form a fused ring with the C₂-C₄ saturated carbon linker or with R₁,\n    or from a spiro ring with the carbon atom on the C₂-C₄ saturated\n    carbon linker that the straight or branched alkyl is attached.",
                        "In one embodiment, the present disclosure provides methods of making N-heterocycles via intermolecular amphoteric diamination of allenes.",
                        "In one embodiment, the present disclosure provides methods of using compounds of N-heterocycles made via intermolecular amphoteric diamination of allenes for the development of new therapeutics."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce novel synthetic method",
                        "describe reaction conditions",
                        "describe scalability",
                        "describe reagents",
                        "describe conversion to sophisticated products",
                        "describe potential activities",
                        "define compounds of the invention"
                    ],
                    "num_characters": 3593,
                    "outline_medium": [
                        "summarize novel synthetic method",
                        "describe reaction features",
                        "introduce compounds with novel structures"
                    ],
                    "outline_short": [
                        "summarize novel amphoteric diamination strategy"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "For the purposes of promoting an understanding of the principles of the present disclosure, reference will now be made to the embodiments illustrated in the drawings, and specific language will be used to describe the same. It will nevertheless be understood that no limitation of the scope of this disclosure is thereby intended.",
                        "The term “substituted” as used herein refers to a functional group in which one or more hydrogen atoms contained therein are replaced by one or more non-hydrogen atoms. The term “functional group” or “substituent” as used herein refers to a group that can be or is substituted onto a molecule. Examples of substituents or functional groups include, but are not limited to, a halogen (e.g., F, Cl, Br, and I); an oxygen atom in groups such as hydroxyl groups, alkoxy groups, aryloxy groups, aralkyloxy groups, oxo(carbonyl) groups, carboxyl groups including carboxylic acids, carboxylates, and carboxylate esters; a sulfur atom in groups such as thiol groups, alkyl and aryl sulfide groups, sulfoxide groups, sulfone groups, sulfonyl groups, and sulfonamide groups; a nitrogen atom in groups such as amines, azides, hydroxylamines, cyano, nitro groups, N-oxides, hydrazides, and enamines; and other heteroatoms in various other groups.",
                        "Non-limiting examples of substituents, that can be bonded to a substituted carbon (or other such as nitrogen) atom include F, Cl, Br, I, OR, OC(O)N(R)2, CN, NO, NO2, ONO2, azido, CF3, OCF3, R, O (oxo), S (thiono), C(O), S(O), methylenedioxy, ethylenedioxy, N(R)2, SR, SOR, SO2R, SO2N(R)2, SO3R, (CH2)0-2P(O)OR2, C(O)R, C(O)C(O)R, C(O)CH2C(O)R, C(S)R, C(O)OR, OC(O)R, C(O)N(R)2, OC(O)N(R)2, C(S)N(R)2, (CH2)0-2N(R)C(O)R, (CH2)0-2N(R)C(O)OR, (CH2)0-2N(R)N(R)2, N(R)N(R)C(O)R, N(R)N(R)C(O)OR, N(R)N(R)CON(R)2, N(R)SO2R, N(R)SO2N(R)2, N(R)C(O)OR, N(R)C(O)R, N(R)C(S)R, N(R)C(O)N(R)2, N(R)C(S)N(R)2, N(COR)COR, N(OR)R, C(═NH)N(R)2, C(O)N(OR)R, or C(═NOR)R wherein R can be hydrogen or a carbon-based moiety, and wherein the carbon-based moiety can itself be further substituted; for example, wherein R can be hydrogen, alkyl, acyl, cycloalkyl, aryl, aralkyl, heterocyclyl, heteroaryl, or heteroarylalkyl, wherein any alkyl, acyl, cycloalkyl, aryl, aralkyl, heterocyclyl, heteroaryl, or heteroarylalkyl or R can be independently mono- or multi-substituted; or wherein two R groups bonded to a nitrogen atom or to adjacent nitrogen atoms can together with the nitrogen atom or atoms form a heterocyclyl, which can be mono- or independently multi-substituted.",
                        "The term “aryl” as used herein refers to substituted or unsubstituted cyclic aromatic hydrocarbons that do not contain heteroatoms in the ring. Thus aryl groups include, but are not limited to, phenyl, azulenyl, heptalenyl, biphenyl, indacenyl, fluorenyl, phenanthrenyl, triphenylenyl, pyrenyl, naphthacenyl, chrysenyl, biphenylenyl, anthracenyl, and naphthyl groups. In some embodiments, aryl groups contain about 6 to about 14 carbons (C6-C14) or from 6 to 10 carbon atoms (C6-C10) in the ring portions of the groups. Aryl groups can be unsubstituted or substituted, as defined herein. Representative substituted aryl groups can be mono-substituted or substituted more than once, such as, but not limited to, 2-, 3-, 4-, 5-, or 6-substituted phenyl or 2-8 substituted naphthyl groups, which can be substituted with carbon or non-carbon groups such as those listed herein.",
                        "A heteroaryl ring is an embodiment of a heterocyclyl group. The phrase “heterocyclyl group” includes fused ring species including those that include fused aromatic and non-aromatic groups. Representative heterocyclyl groups include, but are not limited to pyrrolidinyl, azetidinyl, piperidynyl, piperazinyl, morpholinyl, chromanyl, indolinonyl, isoindolinonyl, furanyl, pyrrolidinyl, pyridinyl, pyrazinyl, pyrimidinyl, triazinyl, thiophenyl, tetrahydrofuranyl, pyrrolyl, oxazolyl, oxadiazolyl, imidazolyl, triazyolyl, tetrazolyl, benzoxazolinyl, benzthiazolinyl, and benzimidazolinyl groups.",
                        "The terms “halo,” “halogen,” or “halide” group, as used herein, by themselves or as part of another substituent, mean, unless otherwise stated, a fluorine, chlorine, bromine, or iodine atom. The compounds described herein may contain one or more chiral centers, or may otherwise be capable of existing as multiple stereoisomers. It is to be understood that in one embodiment, the invention described herein is not limited to any particular stereochemical requirement, and that the compounds, and compositions, methods, uses, and medicaments that include them may be optically pure, or may be any of a variety of stereoisomeric mixtures, including racemic and other mixtures of enantiomers, other mixtures of diastereomers, and the like. It is also to be understood that such mixtures of stereoisomers may include a single stereochemical configuration at one or more chiral centers, while including mixtures of stereochemical configuration at one or more other chiral centers.",
                        "Similarly, the compounds described herein may include geometric centers, such as cis, trans, E, and Z double bonds. It is to be understood that in another embodiment, the invention described herein is not limited to any particular geometric isomer requirement, and that the compounds, and compositions, methods, uses, and medicaments that include them may be pure, or may be any of a variety of geometric isomer mixtures. It is also to be understood that such mixtures of geometric isomers may include a single configuration at one or more double bonds, while including mixtures of geometry at one or more other double bonds.",
                        "The term “optionally substituted,” or “optional substituents,” as used herein, means that the groups in question are either unsubstituted or substituted with one or more of the substituents specified. When the groups in question are substituted with more than one substituent, the substituents may be the same or different. When using the terms “independently,” “independently are,” and “independently selected from” mean that the groups in question may be the same or different. Certain of the herein defined terms may occur more than once in the structure, and upon such occurrence each term shall be defined independently of the other.",
                        "As used herein, the term “salts” and/or “pharmaceutically acceptable salts” refer to derivatives of the disclosed compounds wherein the parent compound is modified by making acid or base salts thereof. Examples of pharmaceutically acceptable salts include, but are not limited to, mineral or organic acid salts of basic groups such as amines; and alkali or organic salts of acidic groups such as carboxylic acids. Pharmaceutically acceptable salts include the conventional non-toxic salts or the quaternary ammonium salts of the parent compound formed, for example, from non-toxic inorganic or organic acids. For example, such conventional non-toxic salts include those derived from inorganic acids such as hydrochloric, hydrobromic, sulfuric, sulfamic, phosphoric, and nitric; and the salts prepared from organic acids such as acetic, propionic, succinic, glycolic, stearic, lactic, malic, tartaric, citric, ascorbic, pamoic, maleic, hydroxymaleic, phenylacetic, glutamic, benzoic, salicylic, sulfanilic, 2-acetoxybenzoic, fumaric, toluenesulfonic, methanesulfonic, ethane disulfonic, oxalic, and isethionic, and the like.",
                        "As used herein, the term “nitrogen-protecting group” in the present disclosure may be any functional group that can make the amine nitrogen to be protected as any form of carbamate, benzyl amine, amide, thioamide, sulfonamide, urea, or thiourea. The nitrogen-protecting group may include but is not limited to benzoyl, benzyloxycarbonyl, t-butoxycarbonyl, benzene sulfonyl, toluene sulfonyl, benzyl, benzhydryl, trityl, acetyl, or trifluoroacetyl.",
                        "As used herein, the term “electron withdrawing group (EWG)” in the present disclosure may be any functional group that removes electron density from a π system, such as the conjugated carbon-carbon double bond system, making the π system more electrophilic. In the present disclosure, an electron withdrawing group may be but is not limited to aldehyde group, ketone group, carboxylic acid group, acyl group, ester group, amide group, trihalide group, cyano group, sulfonyl group, phosphono group, nitro group, F, or Cl.",
                        "As used herein, the term “1,4-diazo N-heterocycles” refers to a compound comprising a nitrogen-containing ring wherein the ring comprises two nitrogen atoms and the two nitrogen atoms are separated by a linker comprising two carbons from at least one side of the nitrogen-containing ring.",
                        "The present invention provides compounds with novel structures that may possess one or more of the following activities: antibacterial, antifungal, antiviral, anticancer, and antiparasitic activity. Specifically, the compounds of the present invention are represented in Formula I below:",
                        "or any derivate or salt thereof, wherein\n\n\n- - R¹ is R⁵—S(═O)₂—, or a nitrogen protecting group selected from the\n    group consisting of acetyl (Ac), trifluoroacetyl (TFA),\n    trichloroacetyl (TCA), tert-butyloxycarbonyl (Boc), carbobenzyloxy\n    (Cbz), vinyloxycarbonyl (Voc), allyloxycarbonyl (Alloc), and\n    9-fluorenylmethyloxycarbonyl (Fmoc);\n  - R² is optionally substituted C₁-C₁₂ straight or branched alkyl,\n    C₁-C₁₂ alkenyl, C₁-C₁₂ alkynyl, C₃-C₁₀ cycloalkyl, C₃-C₁₀ hetero\n    cycloalkyl, wherein one or more hydrogen is optionally substituted\n    by an optionally substituted aryl, heteroaryl, C₃-C₁₀ cycloalkyl,\n    C₃-C₁₀ hetero cycloalkyl, F, Cl, Br, I, hydroxyl, C₁-C₈ alkoxyl,\n    amino group, or NHBoc, or R² may form a fused ring with one adjacent\n    carbon atom next to the nitrogen that R² is attached;\n  - R³ and R⁴ are each independently H, optionally substituted C₁-C₁₂\n    straight or branched alkyl, C₁-C₁₂ alkenyl, C₁-C₁₂ alkynyl, C₃-C₁₀\n    cycloalkyl, C₃-C₁₀ hetero cycloalkyl, or an electro withdrawing\n    group (EWG), wherein at least one of R³ and R⁴ is an electro\n    withdrawing group.\n  - R⁵ is optionally substituted C₁-C₁₂ straight or branched alkyl,\n    C₁-C₁₂ alkenyl, C₁-C₁₂ alkynyl, C₃-C₁₀ cycloalkyl, C₃-C₁₀ hetero\n    cycloalkyl, aryl, heteroaryl; and\n  - X is a C₂-C₄ saturated carbon linker, wherein C₂-C₄ saturated carbon\n    linker is optionally substituted with 4-8 hydrogen, 4-8 optionally\n    substituted C₁-C₁₂ straight or branched alkyl, wherein one of the\n    4-8 optionally substituted C₁-C₁₂ straight or branched alkyl may\n    form a fused ring with the C₂-C₄ saturated carbon linker or with R₁,\n    or from a spiro ring with the carbon atom on the C₂-C₄ saturated\n    carbon linker that the straight or branched alkyl is attached.",
                        "In one embodiment, the present invention provides a compound of Formula I, wherein R1 is R5—S(═O)2—, and R5 is selected from the group consisting of:",
                        "In one embodiment, the present invention provides a compound of Formula I, wherein R2 is optionally substituted C1-C12 straight or branched alkyl, C1-C12 alkenyl, C3-C10 cycloalkyl, wherein one or more hydrogen of the C1-C12 straight or branched alkyl, C1-C12 alkenyl, or C3-C10 cycloalkyl is optionally substituted with a benzene ring, quinolin ring, pyrrol ring, furan ring, or indole ring, wherein the benzene ring, quinolin ring, pyrrol ring, furan ring, or indole ring is further optionally substituted with 1-3 C1-C6 alkyl, halide, C1-C4 alkoxyl, trihalide methyl, or nitro group.",
                        "In one embodiment, the present invention provides a compound of Formula I, wherein electro withdrawing group (EWG) is selected from the group consisting of aldehyde group, ketone group, carboxylic acid group, acyl group, ester group, amide group, trihalide group, cyano group, sulfonyl group, phosphono group, nitro group, F, and C1.",
                        "In one embodiment, the present invention provides a compound of Formula I, wherein electro withdrawing group (EWG) is may be but is not limited to methoxycarbonyl, ethoxycarbonyl, butoxycarbonyl, t-butoxycarbonyl, phenoxycarbonyl, (3-methoxyphenoxy)carbonyl, ((3-methoxybenzyl)oxy)carbonyl, furan-2-carbonyl, benzoyl, fluorobenzoyl, chlorobenzoylmethoxybenzoyl, trifluoromethylbenzoyl, diethoxyphosphoryl, diphenylphosphoryl, phenylsulfonyl, cyano, or 2-oxy-4-phenylbutyl.",
                        "In one embodiment, the present invention provides a compound of Formula II:",
                        "or any derivative or salt thereof, wherein\n\n\n- - R¹ is R⁵—S(═O)₂—, or a nitrogen protecting group selected from the\n    group consisting of acetyl (Ac), trifluoroacetyl (TFA),\n    trichloroacetyl (TCA), tert-butyloxycarbonyl (Boc), carbobenzyloxy\n    (Cbz), vinyloxycarbonyl (Voc), allyloxycarbonyl (Alloc), and\n    9-fluorenylmethyloxycarbonyl (Fmoc);\n  - R² is optionally substituted C₁-C₁₂ straight or branched alkyl,\n    C₁-C₁₂ alkenyl, C₁-C₁₂ alkynyl, C₃-C₁₀ cycloalkyl, C₃-C₁₀ hetero\n    cycloalkyl, wherein one or more hydrogen is optionally substituted\n    by an optionally substituted aryl, heteroaryl, C₃-C₁₀ cycloalkyl,\n    C₃-C₁₀ hetero cycloalkyl, F, Cl, Br, I, hydroxyl, C₁-C₈ alkoxyl,\n    amino group, or NHBoc, or R² may form a fused ring with one adjacent\n    carbon atom next to the nitrogen that R² is attached;\n  - R³ and R⁴ are each independently H, optionally substituted C₁-C₁₂\n    straight or branched alkyl, C₁-C₁₂ alkenyl, C₁-C₁₂ alkynyl, C₃-C₁₀\n    cycloalkyl, C₃-C₁₀ hetero cycloalkyl, or an electro withdrawing\n    group (EWG), wherein at least one of R³ and R⁴ is an electro\n    withdrawing group.\n  - R⁵ is optionally substituted C₁-C₁₂ straight or branched alkyl,\n    C₁-C₁₂ alkenyl, C₁-C₁₂ alkynyl, C₃-C₁₀ cycloalkyl, C₃-C₁₀ hetero\n    cycloalkyl, aryl, heteroaryl;\n  - R⁶ is H, nitro, F, Cl, Br, I, amino, cyano, C₁-C₄ straight,\n    branched, or cycloalkyl, C₁-C₄ trifluoroalkyl, hydroxyl, C₁-C₄\n    alkoxyl, or —SH;\n  - R⁷ is H, C₁-C₄ straight, branched, or cycloalkyl; and\n  - X is a C₂-C₄ saturated carbon linker, wherein C₂-C₄ saturated carbon\n    linker is optionally substituted with 4-8 hydrogen, 4-8 optionally\n    substituted C₁-C₁₂ straight or branched alkyl, wherein one of the\n    4-8 optionally substituted C₁-C₁₂ straight or branched alkyl may\n    form a fused ring with the C₂-C₄ saturated carbon linker or with R₁,\n    or from a spiro ring with the carbon atom on the C₂-C₄ saturated\n    carbon linker that the straight or branched alkyl is attached",
                        "In one embodiment, the present invention provides a compound of Formula II:",
                        "wherein the compound is selected from the group consisting of:",
                        "any derivative or salt thereof.",
                        "In one embodiment, the present invention provides a method of preparing a compound of Formula I comprising reacting a compound of R1NHXNYR2 with a compound of CH2═C═CR3R4:",
                        "or any derivative or salt thereof, wherein\n\n\n- - R¹ is R⁵—S(═O)₂—, or a nitrogen protecting group selected from the\n    group consisting of acetyl (Ac), trifluoroacetyl (TFA),\n    trichloroacetyl (TCA), tert-butyloxycarbonyl (Boc), carbobenzyloxy\n    (Cbz), vinyloxycarbonyl (Voc), allyloxycarbonyl (Alloc), and\n    9-fluorenylmethyloxycarbonyl (Fmoc);\n  - R² is optionally substituted C₁-C₁₂ straight or branched alkyl,\n    C₁-C₁₂ alkenyl, C₁-C₁₂ alkynyl, C₃-C₁₀ cycloalkyl, C₃-C₁₀ hetero\n    cycloalkyl, wherein one or more hydrogen is optionally substituted\n    by an optionally substituted aryl, heteroaryl, C₃-C₁₀ cycloalkyl,\n    C₃-C₁₀ hetero cycloalkyl, F, Cl, Br, I, hydroxyl, C₁-C₈ alkoxyl,\n    amino group, or NHBoc, or R² may form a fused ring with one adjacent\n    carbon atom next to the nitrogen that R² is attached;\n  - R³ and R⁴ are each independently H, optionally substituted C₁-C₁₂\n    straight or branched alkyl, C₁-C₁₂ alkenyl, C₁-C₁₂ alkynyl, C₃-C₁₀\n    cycloalkyl, C₃-C₁₀ hetero cycloalkyl, or an electro withdrawing\n    group (EWG), wherein at least one of R³ and R⁴ is an electro\n    withdrawing group;\n  - R⁵ is optionally substituted C₁-C₁₂ straight or branched alkyl,\n    C₁-C₁₂ alkenyl, C₁-C₁₂ alkynyl, C₃-C₁₀ cycloalkyl, C₃-C₁₀ hetero\n    cycloalkyl, aryl, heteroaryl;\n  - X is a C₂-C₄ saturated carbon linker, wherein C₂-C₄ saturated carbon\n    linker is optionally substituted with 4-8 hydrogen, 4-8 optionally\n    substituted C₁-C₁₂ straight or branched alkyl, wherein one of the\n    4-8 optionally substituted C₁-C₁₂ straight or branched alkyl may\n    form a fused ring with the C₂-C₄ saturated carbon linker or with R₁,\n    or from a spiro ring with the carbon atom on the C₂-C₄ saturated\n    carbon linker that the straight or branched alkyl is attached; and\n  - Y is H, Cl, Br, or I.",
                        "In one embodiment, the present invention provides a method of preparing a compound of Formula I comprising reacting a compound of R1NHXNYR2 with a compound of CH2═C═CR3R4, wherein the substitution groups are defined as in the previous paragraphs, wherein the reaction condition comprising the use of an appropriate base and an appropriate halide ion. In one aspect, the halide ion is iodide ion (I−). In one aspect, an appropriate base may be but is not limited to Cs2CO3.",
                        "In one embodiment, the present invention provides a method of preparing a compound of Formula II from a compound of Formula I:",
                        "or any derivative or salt thereof, wherein\n\n\n- - R¹ is R⁵—S(═O)₂—, or a nitrogen protecting group selected from the\n    group consisting of acetyl (Ac), trifluoroacetyl (TFA),\n    trichloroacetyl (TCA), tert-butyloxycarbonyl (Boc), carbobenzyloxy\n    (Cbz), vinyloxycarbonyl (Voc), allyloxycarbonyl (Alloc), and\n    9-fluorenylmethyloxycarbonyl (Fmoc);\n  - R² is optionally substituted C₁-C₁₂ straight or branched alkyl,\n    C₁-C₁₂ alkenyl, C₁-C₁₂ alkynyl, C₃-C₁₀ cycloalkyl, C₃-C₁₀ hetero\n    cycloalkyl, wherein one or more hydrogen is optionally substituted\n    by an optionally substituted aryl, heteroaryl, C₃-C₁₀ cycloalkyl,\n    C₃-C₁₀ hetero cycloalkyl, F, Cl, Br, I, hydroxyl, C₁-C₈ alkoxyl,\n    amino group, or NHBoc, or R² may form a fused ring with one adjacent\n    carbon atom next to the nitrogen that R² is attached;\n  - R³ and R⁴ are each independently H, optionally substituted C₁-C₁₂\n    straight or branched alkyl, C₁-C₁₂ alkenyl, C₁-C₁₂ alkynyl, C₃-C₁₀\n    cycloalkyl, C₃-C₁₀ hetero cycloalkyl, or an electro withdrawing\n    group (EWG), wherein at least one of R³ and R⁴ is an electro\n    withdrawing group;\n  - R⁵ is optionally substituted C₁-C₁₂ straight or branched alkyl,\n    C₁-C₁₂ alkenyl, C₁-C₁₂ alkynyl, C₃-C₁₀ cycloalkyl, C₃-C₁₀ hetero\n    cycloalkyl, aryl, heteroaryl;\n  - R⁶ is H, nitro, F, Cl, Br, I, amino, cyano, C₁-C₄ straight,\n    branched, or cycloalkyl, C₁-C₄ trifluoroalkyl, hydroxyl, C₁-C₄\n    alkoxyl, or —SH;\n  - R⁷ is H, C₁-C₄ straight, branched, or cycloalkyl; and\n  - X is a C₂-C₄ saturated carbon linker, wherein C₂-C₄ saturated carbon\n    linker is optionally substituted with 4-8 hydrogen, 4-8 optionally\n    substituted C₁-C₁₂ straight or branched alkyl, wherein one of the\n    4-8 optionally substituted C₁-C₁₂ straight or branched alkyl may\n    form a fused ring with the C₂-C₄ saturated carbon linker or with R₁,\n    or from a spiro ring with the carbon atom on the C₂-C₄ saturated\n    carbon linker that the straight or branched alkyl is attached.",
                        "In one embodiment, the present invention provides a method of preparing a compound of Formula II from a compound of Formula I, wherein the reaction comprising the use of an appropriate nucleophile and an appropriate electrophile compound. In one aspect, an appropriate nucleophile may be but is not limited to a compound that may provide a hydride ion. In one aspect, a compound that may provide a hydride ion may be but is not limited to NaBH3CN. In one aspect, an appropriate electrophile compound may be any compound that may provide proton (H+), for example, water or acetic acid.",
                        "In one embodiment, the present disclosure provides a method of preparing the compound of Formula II through the preparation of the compound of Formula I, wherein the method may be a two-step one pot reaction, wherein the compound of Formula I is not separated and/or purified when the compound of Formula I is prepared and converted to the compound of Formula II."
                    ],
                    "subsections": [
                        {
                            "title": "EXPERIMENTAL SECTIONS",
                            "paragraphs": [
                                "General Procedure for Syntheses of Starting Material Diamines of R1NHXNYR2",
                                "The starting material 1,2-diamines with a general formula of R1NHXNYR2 can be purchased if commercial available or prepared according to literature publications. The general procedures for syntheses of starting material 1,2-diamines can be found in Squires, C., Baxter, C. W., Campbell, J., Lindoy, L. F., McNab, H., Parkin, A., Parsons, S., Tasker, P. A., Wei, G. & White, D. J. Design of base metal extractants. Part 1. Inter-ligand hydrogen bonding in the assembly of pseudo-macrocyclic bis(aminosulfonamidato)M(II) complexes. Dalton Trans. 2026-2034 (2006).",
                                "A Representative Procedure to Prepare Diamines with Formula of R1NHXNYR2:",
                                "A reaction mixture of a terminal unsubstituted diamine (10 mmol), an aldehyde (10 mmol) or ketone (10 mmol) and dry 4 Å molecular sieve (5.0 g) in dry MeOH (20 mL) was stirred for overnight under argon at room temperature. Then the reaction was then cooled to 0° C. before NaBH4 (15 mmol) was added slowly. The reaction process was monitored by TLC. Upon full conversion of the starting material, the 4 Å molecular sieve was removed by filtration. Added dichloromethane (DCM, 100 mL) and water to the filtrate. The organic layer was separated and the aqueous phase was further extracted with DCM three times. The combined organic extracts were dried over Na2SO4, filtered, and concentrated in vacuo. The crude residue was purified on a silica gel column (the silica gel was pre-treated with Et3N) with hexane/EtOAc as the eluents to give the desired products as the starting material diamines with the formula of R1NHXNYR2.",
                                "**Step 1: General Procedure for Syntheses of 1.4 diazo N-heterocycles of Formula I**",
                                "To a 2-dram vial wrapped with aluminum foil was added a 1diamine substrate with formula of R1NHXNYR2 (0.1 mmol), NIS (0.105 mmol), and dry THF (1 mL). The reaction mixture was stirred for 1 h under argon before an allene substrate (0.15 mmol) and Cs2CO3 (0.15 mmol) was added and the reaction mixture was let to stir. An intermediate compound of Formula I as previous defined was made at this step.",
                                "Examples 1-2 were Prepared According to the General Procedure for Syntheses of 1.4 diazo N-heterocycles of Formula I:",
                                "The intermediate compound of Formula I may be separated or carried over to the next step without separation/purification.",
                                "**Step 2: General Procedure for Syntheses of 1.4 diazo N-heterocycles of Formula II**",
                                "After the reaction mixture was stirred for 24 h, NaBH3CN (0.2 mmol) and a co-solvent of MeOH/AcOH (pH=4, 1 mL) were added to the reaction mixture with the prepared product of Formula I. After 3 h, the reaction was quenched with a saturated aqueous solution of NaHCO3, extracted with CH2Cl2 for three times. The combined organic extracts were dried over Na2SO4, filtered, and concentrated in vacuo. The crude mixture was purified on silica gel column with hexane/EtOAc as eluents to give the desired 1,4-diazo N-heterocycles with the Formula II such as a piperazine product.",
                                "Examples 3-97 were Prepared According to the General Procedure for Syntheses of 1.4 diazo N-heterocycles of Formula I.",
                                "Those skilled in the art will recognize that numerous modifications can be made to the specific implementations described above. The implementations should not be limited to the particular limitations described. Other implementations may be possible."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce general procedure for syntheses of starting material diamines",
                                "provide representative procedure to prepare diamines",
                                "outline step 1 for syntheses of 1.4 diazo N-heterocycles of Formula I",
                                "describe examples 1-2 preparation according to step 1",
                                "outline step 2 for syntheses of 1.4 diazo N-heterocycles of Formula II",
                                "note possible modifications to specific implementations"
                            ],
                            "num_characters": 3399,
                            "outline_medium": [
                                "outline synthesis of diamines",
                                "describe step 1 of diazo N-heterocycles synthesis",
                                "describe step 2 of diazo N-heterocycles synthesis"
                            ],
                            "outline_short": [
                                "outline synthesis procedures"
                            ]
                        }
                    ],
                    "outline_long": [
                        "define substituted",
                        "define functional group",
                        "list examples of substituents",
                        "define aryl",
                        "describe aryl groups",
                        "define heterocyclyl group",
                        "list examples of heterocyclyl groups",
                        "define halo group",
                        "discuss chiral centers and stereoisomers",
                        "discuss geometric centers and geometric isomers",
                        "define optionally substituted",
                        "define salts and pharmaceutically acceptable salts",
                        "list examples of pharmaceutically acceptable salts",
                        "define nitrogen-protecting group",
                        "list examples of nitrogen-protecting groups",
                        "define electron withdrawing group (EWG)",
                        "list examples of electron withdrawing groups",
                        "define 1,4-diazo N-heterocycles",
                        "introduce compounds with novel structures",
                        "describe Formula I",
                        "specify embodiment of Formula I",
                        "define compound of Formula I",
                        "specify R2 options",
                        "specify EWG options",
                        "specify additional EWG options",
                        "define compound of Formula II",
                        "specify R1 options",
                        "specify R2 options",
                        "specify R3 and R4 options",
                        "specify R5 options",
                        "specify R6 options",
                        "specify R7 options",
                        "specify X options",
                        "provide method of preparing compound of Formula I",
                        "specify reaction conditions",
                        "provide method of preparing compound of Formula II",
                        "specify reaction conditions",
                        "provide alternative method of preparing compound of Formula II",
                        "provide two-step one pot reaction method"
                    ],
                    "num_characters": 20050,
                    "outline_medium": [
                        "define substituted and functional group",
                        "explain examples of substituents",
                        "define aryl and heteroaryl groups",
                        "describe heterocyclyl groups",
                        "explain halo, halogen, and halide groups",
                        "discuss stereochemical and geometric isomers",
                        "define optionally substituted and independent selection",
                        "explain salts and pharmaceutically acceptable salts",
                        "define nitrogen-protecting group and electron withdrawing group",
                        "introduce 1,4-diazo N-heterocycles and Formula I compounds",
                        "define compound of Formula I",
                        "define compound of Formula II",
                        "provide method of preparing compound of Formula I",
                        "provide method of preparing compound of Formula II from compound of Formula I",
                        "specify reaction conditions for method of preparing compound of Formula I",
                        "specify reaction conditions for method of preparing compound of Formula II",
                        "provide examples of compounds of Formula I",
                        "provide examples of compounds of Formula II",
                        "provide two-step one pot reaction method for preparing compound of Formula II"
                    ],
                    "outline_short": [
                        "define substituents and functional groups",
                        "define aryl and heterocyclyl groups",
                        "describe stereochemical and geometric isomer requirements",
                        "define salts and nitrogen-protecting groups",
                        "introduce compounds with novel structures and their activities",
                        "define compounds of Formula I",
                        "define compounds of Formula II",
                        "describe methods of preparing compounds of Formula I",
                        "describe methods of preparing compounds of Formula II"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A compound of formula I:\n\n\nOr any derivative or salt thereof, wherein\nR1 is R5—S(═O)2—, or a nitrogen protecting group selected from the group consisting of acetyl (Ac), trifluoroacetyl (TFA), trichloroacetyl (TCA), tert-butyloxycarbonyl (Boc), carbobenzyloxy (Cbz), vinyloxycarbonyl (Voc), allyloxycarbonyl (Alloc), and 9-fluorenylmethyloxycarbonyl (Fmoc);\nR2 is optionally substituted C1-C12 straight or branched alkyl, C1-C12 alkenyl, C1-C12 alkynyl, C3-C10 cycloalkyl, C3-C10 hetero cycloalkyl, wherein one or more hydrogen is optionally substituted by an optionally substituted aryl, heteroaryl, C3-C10 cycloalkyl, C3-C10 hetero cycloalkyl, F, Cl, Br, I, hydroxyl, C1-C8 alkoxyl, amino group, or NHBoc, or R2 may form a fused ring with one adjacent carbon atom next to the nitrogen that R2 is attached;\nR3 and R4 are each independently H, optionally substituted C1-C12 straight or branched alkyl, C1-C12 alkenyl, C1-C12 alkynyl, C3-C10 cycloalkyl, C3-C10 hetero cycloalkyl, or an electro withdrawing group (EWG), wherein at least one of R3 and R4 is an electro withdrawing group;\nR5 is optionally substituted C1-C12 straight or branched alkyl, C1-C12 alkenyl, C1-C12 alkynyl, C3-C10 cycloalkyl, C3-C10 hetero cycloalkyl, aryl, heteroaryl; and\nX is a C2-C4 saturated carbon linker, wherein C2-C4 saturated carbon linker is optionally substituted with 4-8 hydrogen, 4-8 optionally substituted C1-C12 straight or branched alkyl, wherein one of the 4-8 optionally substituted C1-C12 straight or branched alkyl may form a fused ring with the C2-C4 saturated carbon linker or with R1, or from a spiro ring with the carbon atom on the C2-C4 saturated carbon linker that the straight or branched alkyl is attached.",
        "2. The compound of claim 1, wherein R1 is R5—S(═O)2—, and R5 is selected from the group consisting of:",
        "3. The compound of claim 1, wherein R2 is optionally substituted C1-C12 straight or branched alkyl, C1-C12 alkenyl, C3-C10 cycloalkyl, wherein one or more hydrogen of the C1-C12 straight or branched alkyl, C1-C12 alkenyl, or C3-C10 cycloalkyl is optionally substituted with a benzene ring, quinolin ring, pyrrol ring, furan ring, or indole ring, wherein the benzene ring, quinolin ring, pyrrol ring, furan ring, or indole ring is further optionally substituted with 1-3 C1-C6 alkyl, halide, C1-C4 alkoxyl, trihalide methyl, or nitro group.",
        "4. The compound of claim 1, wherein the electro withdrawing group (EWG) is selected form the group consisting of methoxycarbonyl, ethoxycarbonyl, butoxycarbonyl, t-butoxycarbonyl, phenoxycarbonyl, (3-methoxyphenoxy)carbonyl, ((3-methoxybenzyl)oxy)carbonyl, furan-2-carbonyl, benzoyl, fluorobenzoyl, chlorobenzoylmethoxybenzoyl, trifluoromethylbenzoyl, diethoxyphosphoryl, diphenylphosphoryl, phenylsulfonyl, cyano, and 2-oxy-4-phenylbutyl.",
        "5. A compound of formula II:\n\n\nor any derivative or salt thereof, wherein\nR1 is R5—S(═O)2—, or a nitrogen protecting group selected from the group consisting of acetyl (Ac), trifluoroacetyl (TFA), trichloroacetyl (TCA), tert-butyloxycarbonyl (Boc), carbobenzyloxy (Cbz), vinyloxycarbonyl (Voc), allyloxycarbonyl (Alloc), and 9-fluorenylmethyloxycarbonyl (Fmoc);\nR2 is optionally substituted C1-C12 straight or branched alkyl, C1-C12 alkenyl, C1-C12 alkynyl, C3-C10 cycloalkyl, C3-C10 hetero cycloalkyl, wherein one or more hydrogen is optionally substituted by an optionally substituted aryl, heteroaryl, C3-C10 cycloalkyl, C3-C10 hetero cycloalkyl, F, Cl, Br, I, hydroxyl, C1-C8 alkoxyl, amino group, or NHBoc, or R2 may form a fused ring with one adjacent carbon atom next to the nitrogen that R2 is attached;\nR3 and R4 are each independently H, optionally substituted C1-C12 straight or branched alkyl, C1-C12 alkenyl, C1-C12 alkynyl, C3-C10 cycloalkyl, C3-C10 hetero cycloalkyl, or an electro withdrawing group (EWG), wherein at least one of R3 and R4 is an electro withdrawing group.\nR5 is optionally substituted C1-C12 straight or branched alkyl, C1-C12 alkenyl, C1-C12 alkynyl, C3-C10 cycloalkyl, C3-C10 hetero cycloalkyl, aryl, heteroaryl;\nR6 is H, nitro, F, Cl, Br, I, amino, cyano, C1-C4 straight, branched, or cycloalkyl, C1-C4 trifluoroalkyl, hydroxyl, C1-C4 alkoxyl, or —SH;\nR7 is H, C1-C4 straight, branched, or cycloalkyl; and\nX is a C2-C4 saturated carbon linker, wherein C2-C4 saturated carbon linker is optionally substituted with 4-8 hydrogen, 4-8 optionally substituted C1-C12 straight or branched alkyl, wherein one of the 4-8 optionally substituted C1-C12 straight or branched alkyl may form a fused ring with the C2-C4 saturated carbon linker or with R1, or from a spiro ring with the carbon atom on the C2-C4 saturated carbon linker that the straight or branched alkyl is attached.",
        "6. The compound of claim 5, wherein R1 is R5—S(═O)2—, and R5 is selected from the group consisting of:",
        "7. The compound of claim 5, wherein R2 is optionally substituted C1-C12 straight or branched alkyl, C1-C12 alkenyl, C3-C10 cycloalkyl, wherein one or more hydrogen of the C1-C12 straight or branched alkyl, C1-C12 alkenyl, or C3-C10 cycloalkyl is optionally substituted with a benzene ring, quinolin ring, pyrrol ring, furan ring, or indole ring, wherein the benzene ring, quinolin ring, pyrrol ring, furan ring, or indole ring is further optionally substituted with 1-3 C1-C6 alkyl, halide, C1-C4 alkoxyl, trihalide methyl, or nitro group.",
        "8. The compound of claim 5, wherein the electro withdrawing group (EWG) is selected form the group consisting of methoxycarbonyl, ethoxycarbonyl, butoxycarbonyl, t-butoxycarbonyl, phenoxycarbonyl, (3-methoxyphenoxy)carbonyl, ((3-methoxybenzyl)oxy)carbonyl, furan-2-carbonyl, benzoyl, fluorobenzoyl, chlorobenzoylmethoxybenzoyl, trifluoromethylbenzoyl, diethoxyphosphoryl, diphenylphosphoryl, phenylsulfonyl, cyano, and 2-oxy-4-phenylbutyl.",
        "9. The compound of claim 5, wherein the compound is selected from the group consisting of:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nany derivative and salt thereof.",
        "10. A method of preparing the compound of claim 5, wherein the method comprises a step of reacting a compound of R1NHXNYR2 with a compound of CH2═C═CR3R4 to provide the compound of claim 1:\n\n\nwherein Y is H, Cl, Br, or I.",
        "11. The method of claim 10, wherein the method further comprises a step of reduction reaction by converting the compound of claim 1 to the compound of claim 5."
    ]
}