{
    "id": "https://semopenalex.org/work/W2117916958",
    "authors": [
        "Chen Davidovich",
        "Ada Yonath",
        "Anat Bashan",
        "Matthew J. Belousoff",
        "Alexander S. Mankin",
        "Kenji Arakawa",
        "Haruyasu Kinashi",
        "Liqun Xiong",
        "Ella Zimmerman",
        "Dorota Klepacki",
        "Tamar Auerbach",
        "Itai Wekselman",
        "Inbal Mermershtain"
    ],
    "title": "The structure of ribosome-lankacidin complex reveals ribosomal sites for synergistic antibiotics",
    "date": "2010-01-11",
    "abstract": "Crystallographic analysis revealed that the 17-member polyketide antibiotic lankacidin produced by Streptomyces rochei binds at the peptidyl transferase center of the eubacterial large ribosomal subunit. Biochemical and functional studies verified this finding and showed interference with peptide bond formation. Chemical probing indicated that the macrolide lankamycin, a second antibiotic produced by the same species, binds at a neighboring site, at the ribosome exit tunnel. These two antibiotics can bind to the ribosome simultaneously and display synergy in inhibiting bacterial growth. The binding site of lankacidin and lankamycin partially overlap with the binding site of another pair of synergistic antibiotics, the streptogramins. Thus, at least two pairs of structurally dissimilar compounds have been selected in the course of evolution to act synergistically by targeting neighboring sites in the ribosome. These results underscore the importance of the corresponding ribosomal sites for development of clinically relevant synergistic antibiotics and demonstrate the utility of structural analysis for providing new directions for drug discovery.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Biochemical, genetic and functional evidence indicated that a great variety of antibiotics inhibits protein synthesis by binding to ribosomal functional regions and crystallographic studies, performed over the last decade revealed their exact binding sites (e.g 1,2). Many natural antibiotics, as well as their clinically relevant semisynthetic derivatives, bind at the peptidyl transferase center (PTC) in the large ribosomal subunit. The PTC provides binding pockets for phenicols (e.g. chloramphenicol), lincosamides (e.g. clindamycin), pleuromutilins (e.g. tiamulin, retapamulin) and oxazolidinones (e.g. linezolid) (3)(4)(5)(6)(7)(8)(9)(10)(11)(12)(13)(14). Most of these compounds inhibit cell growth by interfering with peptide bond formation (15), a few, like chloramphenicol, occupy the tRNA binding site (3). The second major antibiotic binding site in the large ribosomal subunit is located at the upper segment of the nascent peptide exit tunnel (NPET), adjacent to the PTC, and is used by macrolides and streptogramins B (3,7,(16)(17)(18)(19)(20)(21).",
                "Binding to this site seems to impede progression of the nascent proteins towards the tunnel exit. Thus, compounds binding to the PTC and NPET inhibit successive steps in protein synthesis: formation of the nascent chains and their export from the ribosome.",
                "Simultaneous inhibition of successive steps of a specific biochemical pathway often results in a synergistic action of the inhibitors (22). Nature has not ignored this opportunity when evolving ribosomal antibiotics. For example, streptogramin antibiotics, produced by several Streptomyces species, are secreted as a combination of two structurally distinct compounds that inhibit cell growth by acting upon the PTC and NPET (23,24). Streptogramin A (S A ) compounds are cyclic poly-unsaturated macrolactones that bind in the PTC, whereas streptogramin B (S B ) compounds are cyclic depsipeptides that bind in the NPET (6,7,25). Each of the individual streptogramin components is a weak antibiotic on its own, but in combination they exhibit strong inhibitory effect. The synergistic antibiotic effect of streptogramins is medically relevant -the semisynthetic formulation Synercid composed of dalfopristin (the S A derivative) and quinupristin (the S B derivative) is widely used for treatment of complicated Gram-positive infections (26).",
                "Lankacidin and lankamycin are two inhibitory compounds produced by Streptomyces rochei 7434AN4i (27,28). The structures of lankacidin and lankamycin are chemically distinct and rather different from those of streptogramins (Figure 1). Lankacidin C (LC) is a macrocyclic compound composed of a 17-membered carbocyclic ring, bridged by a 6membered lactone. Lankamycin (LM) is a 14-member ring macrolide whose 14-member lactone ring is decorated with 4-acetyl-L-arcanose and D-chalcose sugars (29)(30)(31) resembling erythromycin (ERY) (Figure 1) . LC exhibits both antibiotic and antitumour activities and is used in veterinary medicine (32)(33)(34)(35). Lankamycin exhibits a weak antibiotic activity against several Gram-positive bacteria (36). LC competition with chloramphenicol for binding to the ribosome reveals the large ribosomal subunit as a likely target of its action, in accord with its classification as a protein synthesis inhibitor (37,38). Though little data is available about activity of LM, the similarity of its structure to that of ERY indicates that it may act as a typical macrolide. Co-regulation of production of LC and LM (39,40) suggests that these drugs have been evolutionary optimized to work together. Nevertheless, although LC and LM are co-produced by the Streptomyces strain, there has been no information about their sites of action, nor any evidence of functional interaction between these two antibiotic compounds.",
                "We performed crystallographic and biochemical analysis to identify the modes of action of LC and LM. Here we show that these two compounds bind at neighboring sites in the large ribosomal subunit, which partially overlap with the binding sites of two streptogramin components. We present evidence that LC can bind simultaneously with LM and that the two drugs act synergistically, suggesting that the structures of LC and LM have been optimized in the course of evolution to allow for their simultaneous action. Based on our structural results we also suggest means for enhancing their synergetic inhibitory effect. This is one of the rare cases in which crystallographic analysis provided functional insights and stimulated advanced biochemical and genetic studies."
            ],
            "subsections": []
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Lankacidin binding site",
                    "paragraphs": [
                        "The 3.5 Å resolution (Table 1) difference electron density map calculated between the structure amplitudes of the large ribosomal subunits from Deinococcus radiodurans (D50S) in complex with LC (D50S-LC) and of the D50S native structure (41) allowed the unambiguous determination of the location (Figure 2A) and conformation of LC in the PTC (Figure 2B).   A. Superposition of lankacidin in cyan and dalfopristin in metallic blue (6) B. Superposition of lankacidin and other PTC antibiotics binding sites: a section through the volume occupied by lankacidin is shown in transparent cyan;, clindamycin (3) in magenta, tiamulin (5) in purple; retapamulin (9) in slate, chloramphenicol (3) in red, dalfopristin (6) in metallic blue and methymycin (14) in orange. For orientation, the 3' ends of an A-site tRNA mimic is shown in dark blue and the derived P-site tRNA in green (44).. C. Superposition of lankacidin in cyan, dalfopristin in metallic blue and its mate, quinupristin (6) in gold."
                    ],
                    "subsections": []
                },
                {
                    "title": "D. The relative positions of lankacidin in cyan, and the docked erythromycin(3), in red.",
                    "paragraphs": [
                        "Selected distances between the two, indicating short contacts are shown in the lower panel."
                    ],
                    "subsections": []
                },
                {
                    "title": "Note the marked difference in size between quinupristin (C) and ERY that represents LM (D).",
                    "paragraphs": [
                        "The re-positioning of the rRNA residues that occurs as a consequence of LC binding creates a unique network of interactions between five re-oriented nucleotides: U2506, G2505, G2581, C2610 and G2576. Within this network G2576 stacks upon G2505, C2610 stacks upon G2581, and the exocyclic amine of G2505 reaches hydrogen bonding distance from and O2 of C2610, via CG rS* base pairing (42). Also, the amino group of G2502 is within a hydrogen bond reach of O4 of U2506, which shifts towards the lankacidin the 1,3 dicarbonyl system.",
                        "These newly established contacts stabilize the placement of G2505 and U2506 in a conformation that favors binding of LC. Additionally, similar to pleuromutilins that utilize a network of remote interactions, LC interacts with second-shell nucleotides, specifically G2576, A2062, C2530, U2531, C2507, U2584, G2581, C2610 and A2059. It also exploits the PTC inherent flexibility for induced-fit binding mechanism (9,10).",
                        "In its binding site, LC macrolactone ring fits in the shallow depression in the wall of the PTC A-site and forms van der Waals interactions with U2504, G2505 and U2506. The contribution of these interactions to the drug binding is manifested by structure-activity studies that showed that hydrogenation of the macrocyclic ring, which should alter the ring conformation, reduced the inhibitory activity of LC (32). The 2-methyl group at the lactone edge of the macrocyclic ring inserts in the opening of the hydrophobic crevice formed by the splayed out bases of A2451 and C2452. This cleft also hosts the aminoacyl moiety of A-sitebound aminoacyl-tRNA (3,13,43), and is involved in binding of other PTC-targeting antibiotics, the phenicols, lincosamides, pleuromutilins, oxazolidinones, and S A antibiotic compounds such as dalfopristin (Figure 3B) and virginiamycin M. The overlap of the LC and chloramphenicol binding sites provides the structural basis for their competition for binding to the ribosome (38).",
                        "Despite significant size differences, the position of LC closely resembles those of dalfopristin ( 6) and virginiamycin M (4). However, substantial differences were observed in the interactions of these compounds with the ribosome. For example, in the D50S-Synercid complex (6) dalfopristin ring extends further towards the P-site (Figure 3A). As LC reaches the PTC center, its binding causes the flexible base of A2602, which plays a major role in tRNA translocation (44,45), to undergo a significant re-orientation, i.e. rotation by 45 0 , compared to its orientation in D50S or its Synercid bound complex. U2585, the second flexible nucleotide that also seems to play a role in A-tRNA translocation undergoes only a minor alteration in D50S-LC complex, while it is rotated by 180 0 in D50S-Synercid complex. This significant rotation seems to occur owing to steric hindrance of the dalfopristin large macrocyclic ring and to the occupation of the S B site by quinupristin, Synercid S B component. Other common features of LC and dalfopristin binding to D50S are interactions with G2061 (LC carbonyl oxygen O1 is H-bonded with G2061 N2, whereas two H-bonds of dalfopristin with N2 and O2 (6). Also a similar conformational change of C2610, albeit because of different reasons, occurs.",
                        "In D50S-LC complex C2610 stacks with G2581 and is H-bonded to G2505, whereas in the D50-Synercid complex it flipped away because of steric hindrance cause by quinupristin.",
                        "Additionally, while both LC and dalfopristin re-orient the U2506 base, the shift of this base toward LC is unique.",
                        "Consistent with its binding to the PTC, the ribosome main functional center, LC inhibited bacterial (E. coli) cell-free transcription-translation system, with a respectable IC 50 of 1.5 0.1 M (Figure 4A). Furthermore, confirming previous observation (37), we found that the drug readily interfered with the peptide bond formation inhibiting the puromycin reaction catalyzed by either Staphylococcus aureus 70S ribosomes (IC 50 0.32 0.02 M) or isolated large ribosomal subunits of D. radiodurans (IC 50 10.0 6.0 M) (Figure 4B). This result affirmed LC as an effective PTC inhibitor.",
                        "Lankacidin and lankamycin can simultaneously bind to the ribosome S. rochei secretes two antibiotics, a 17-member ring macrocyclic LC and a 14member ring macrolide, lankamycin (LM). LM is structurally similar to ERY (Figure 1) and thus we assumed that it is likely to bind to the ribosome at the site and orientation similar to ERY, namely at the NPET in immediate proximity to the PTC, the LC binding site. However, docking the position of ERY in D50S (#3) onto the crystal structure of D50S-LC complex (Figure 3D) revealed that the desosamine sugar of ERY approaches the macrocyclic ring of LC somewhat too close for simultaneous binding of both drugs, in accord with competition experiments that showed that LC displaced 14 C-ERY from D50S (Figure 4C). These observations raised the question whether similar to ERY, LM will also compete with LC for ribosome binding. If so, why would an antibiotic producing microorganism synthesize two competing drugs?",
                        "The lack of radiolabeled LC and LM precluded direct measurement of their binding to the ribosome.",
                        "In order to address this puzzle, we first verified that LM binds to the ribosome and inhibit protein synthesis. We then used RNA probing to follow binding of LC and LM to the ribosome.",
                        "In the E. coli cell-free system, LM inhibited translation (IC 50 of 275 36 M) (Figure 4D)",
                        "arguing that the antibiotic does bind to the ribosome, albeit with only moderate affinity. For the consistency of structural data, we carried out RNA probing experiments using D. radiodurans large ribosomal subunits. Binding of LC and LM was analyzed using chemical modifying reagents 1-cyclohexyl-3-(2-morpholinoethyl) carbodiimide metho-p-toluene sulfonate (CMCT) and dimethyl sulfate (DMS) (46). In accord with crystallographic data, association of LC with D50S results in a strong protection of the PTC nucleotide residues U2506 and U2585 from CMCT modification (Figure 5A). We also noted that upon LC binding, A2059 becomes partially protected from dimethyl sulfate (DMS), in accord to the crystallographic analysis that indicated that upon LC binding A2059 is stacks to A2503, and thus should protect it from modification. This A2059/A2503 stacking may relieve part of the surface of A2058, which becomes more readily modified with DMS than in the absence of the drug (Figure 5B). This result indicated that LC-induced re-structuring of the D50S nucleotide residues in the PTC that propagates allosterically to the proximal segment of the NPET. We found that similar to ERY and other 14 member-ring macrolides, binding of LM results in protection of U2609 from CMCT modification and of A2058 and A2059 from DMS modification (Figure 5 C,D). We then exploited the idiosyncratic protections of 23S rRNA residues against CMCT modification afforded by LC and LM to interrogate their simultaneous interaction with the ribosome. At 50 M, LC shields U2506 and U2585 from alterations, however, the accessibility of these residues to CMCT is not affected by LM or by ERY (Figure 5). Conversely, LM (at 500 M) or ERY (at 50 M) strongly protect U2609, while LC has no effect on this nucleotide. Thus, LC binding protects U2506 and U2585, whereas protection of U2609 revealed LM or ERY binding. When LC and LM are present together, all the three residues (U2506, U2585 and U2609) are protected, indicating that LC and LM are simultaneously bound to the ribosome. In contrast, and in agreement with the binding experiments, the LC-mediated protection of U2506 and U2585 is partially relieved upon addition of ERY (Figure 5D) and ERY-dependent protection of U2609 is partly reversed when LC is present. Thus, while LC and ERY compete for the binding to the ribosome, LC and LM can bind simultaneously to their respective targets in the PTC and NPET."
                    ],
                    "subsections": []
                },
                {
                    "title": "LC and LM act synergistically upon bacterial cells",
                    "paragraphs": [
                        "As the binding site of LC and LM partially overlaps with that of S A and S B antibiotics, and as S A and S B act synergistically, despite the difference in size and chemical properties, we anticipated that LC and LM also exhibit synergy. To address this issue we performed in vivo and in vitro experiments, using whole cell bacteria as well bacterial cell-free system. Synergism was observed by an in vivo assay that utilizes a susceptible strain of Gram-positive S. aureus.",
                        "We analyzed the minimal inhibitory concentrations (MIC) in a checkerboard fashion and plotted the results as fraction of MIC (FIC) of individual compounds (Figure 6). As routinely performed for testing synergism, antibiotics are considered synergistic if the curve has a concave shape; whereas a linear plot reflects additive action of the drugs and a convex graph shows antagonistic interaction (47). These findings were further verified in E. coli cell-free transcription-translation system by an in vitro assay (see supplementary information). Thus, similar to streptogramins, the two antibacterial compounds produced by S. rochei, which bind simultaneously to neighboring sites in the ribosome, can synergistically inhibit growth of sensitive bacteria. "
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "The crystallographic and biochemical data presented here established PTC as the site of LC action. The inhibitory effect of the antibiotic upon peptide bond formation is likely to be achieved by preventing the binding or the proper placement of aminoacyl moiety of the A sitebound aminoacyl-tRNA (Figure 3A). As LC trespass the P site, it may also affect the exact positioning of the peptidyl tRNA c-termini.",
                "Although LC is chemically distinct and is less bulky than most streptogramin A-type drugs, its binding site partially overlaps with that of S A compounds (4,6). Furthermore, both, LC and S A drugs shift U2585 and U2506 that are involved in PTC functions (44,(48)(49)(50). As can be concluded from the similarity of chemical structures of LM and ERY and from the overlap of the set of nucleotides protected by these two compounds, LM binds to the NPET macrolide binding site in a fashion similar, albeit not identical to the other macrolides (Figure 5). The same NPET region accommodates the B components of streptogramin antibiotics, but owing to differences in chemical nature (Figure 1), the streptogramin B compounds are likely to exploit a different set of interactions.",
                "The LC and S A binding sites in the PTC (Figure 3C) are adjacent to the macrolides and S B binding sites, it is conceivable that compounds acting upon these two sites can either compete or cooperate in binding to the ribosome. The cooperativity of S A and S B streptogramins (50) makes evolutionary sense: the same microorganism produces streptogramin components and their mutually enhanced action should be highly beneficial for the antibiotic producer. Our experiments showed that LC and ERY compete for binding to the D. radiodurans ribosome.",
                "Hindrance may result from a direct clash between ERY desosamine sugar and the LC macrocyclic ring (Figure 3D) or by allosteric modulation the binding site of its counterparts.",
                "The altered reactivity of A2058, a nucleotide located in the heart of the macrolide binding site (Figure 5A) (3), upon the LC binding, might be a reflection of such allostery.",
                "The competition between LC and ERY is not surprising: these drugs are produced by different microorganisms and were not 'designed' to work together. In contrast, LM is coproduced with LC and both drugs appear to be co-regulated and thus, similar to the streptogramins case. Hence, they might have been selected in the course of evolution to work together (39,40), in accord with our results that show their simultaneous binding to the ribosome. The small structural differences between ERY and LM (Figure 1) are to cause the diversity in their binding properties. One of the important distinctions between LM and ERY is the nature of the C5-linked sugar residue, which is an important factor for the drug's activity: even small modifications of desosamine in ERY weaken the antibiotic's inhibitory action (52).",
                "Minute modifications in the antibiotic structure and/or in the exact composition and conformation of the binding site, identified at the atomic level, leading to significant binding and potency properties have been reported for several antibiotics, including macrolides. A striking example is the immense influence of the difference between adenine and guanine in position 2058 on the affinity of macrolides to the NPET. In eubacteria this nucleotide is adenine whereas in archaea, eukaryotes and several resistant MLS B stains it is a guanine. The sole G->A mutation increases macrolide binding affinity of macrolides and ketolides to the ribosome of the archon Haloarcula marismortui by 10000-fold ( 7), but did not significantly improve the clinical effectiveness. This seemingly surprising finding indicates that although the identity of the nucleotide at position 2058 determines whether binding occurs, the conformations and the chemical identities of the other nucleotide in the macrolide-pocket govern the antibiotics binding-modes and, subsequently, the drug effectiveness (53). Other examples include the marked difference in the binding modes of ERY and troleanomycin, a 14-member ring macrolide (20) and the conservative mutational alteration of the polymorphic 2057-2611 base pair from A-U to G-C in isogenic mutants of Mycobacterium smegmatis that significantly affects susceptibility to ketolides (54).",
                "In accord with the notion of enhanced potency by synergism, LM on its own is a less potent protein synthesis inhibitor than ERY. However, LM reduced activity is compensated by the ability of LM to act synergistically with LC. Thus, it appears that the LM synthetic pathway has been evolutionary optimized to generate a 14-member ring macrolide capable of simultaneous binding and synergistic action with LC. It is hardly a coincidence that the combinations of synergistic protein synthesis inhibitors, the S A and S B components of streptogramins or LC and LM, utilize the same two adjacent sites in the large ribosomal subunit. These sites might be best suited within the ribosome for accommodating pairs of compounds that would be able to tightly bind and inhibit protein synthesis in a synergistic fashion. Previously, significant resources went into development of streptogramins into a clinical drug. This effort resulted in a useful and successful antibiotic, Synercid. Yet, to the best of our knowledge, no focused attempt was dedicated to optimizing the combination of LC/LM, or for that matter, LC with any other compound. Our studies proved the validity of LC/LM synergism and provided structural basis for small structural modifications that should lead to the improvement of the inhibitory action of the LC/LM pair and its clinical relevance. Notably, both quinupristin and virginiamycin S are significantly larger than LM (Figure 1 and Figure 3 C,D) and therefore contain more chemical entities capable of binding to the ribosome pocket and of forming rather stable network of interactions. It is likely, therefore that enlargement of LM size as well as the introduction of chemical moieties that can interact with the ribosome as well as with LC, will add to the potency of the LC/LM pair."
            ],
            "subsections": []
        },
        {
            "title": "Conclusions",
            "paragraphs": [
                "We showed that two antibiotics, LC and LM, produced by S. rochei are protein synthesis inhibitors that act upon neighboring sites in the large ribosomal subunit and that simultaneous action of LC and LM synergistically inhibits growth of sensitive bacteria. Our structural and biochemical data imply that drug optimization leading to high affinity concurrent binding of the compounds to the ribosome may be reached by minor chemical alterations. Furthermore, our results suggest that certain combinations of PTC inhibitors with the NPET-bound compounds in their natural or chemically modified versions might exhibit synergy. Exploring such drug combinations by co-optimizing their structure or by linking them together into a single molecule may pave the way for developing new antibiotics targeting the ribosome."
            ],
            "subsections": []
        },
        {
            "title": "Materials and Methods",
            "paragraphs": [
                "Crystals of D50S, grown as in (41), were soaked in a solution containing lankacidin.",
                "Crystallographic data were collected with highly collimated synchrotron X-ray beam and processed with HKL2000 ( 55) and ( 56), using the available crystal structure of lankacidin C (29). After map tracing and refinement by COOT (57) and CNS (58,59) ribosome-antibiotic interactions were identified by LigPlot (60) and LPC (61) and images were generated by PyMol (62). Coordinates were deposited in the protein data bank (PDB), with accession code 3JQ4.",
                "Antibiotic binding was determined by incubating various drug concentrations to D50S and followed by purification by gel filtration as described (63) radioactivity measurements.",
                "Inhibition of the peptidyl transferase reaction by LC was performed and analyzed as described in (64) and (65). The data were analyzed using Prism 4 (GraphPad Software). RNA probing was carried out as described in (56) using D50S. Cell free extract was prepared according to (66). Additional details can be found in \"Supplementary information\". pH 7.5, 10 mM MgCl 2 , 250 mM NH 4 Cl, 6 mM -mercaptoethanol). LC was then added at varying concentrations (0-2 M) and incubation continued for 30 min. The ribosome-antibiotic complexes were purified by gel filtration in BioGel P30 spin columns as described (63) and the amount of ribosome-bound radioactivity was measured in scintillation counter. The data were processed using Prism 4 (GraphPad Software)."
            ],
            "subsections": [
                {
                    "title": "Inhibition of cell-free protein synthesis by LC and LM",
                    "paragraphs": [
                        "The E. coli cell-free transcription-translation system for circular DNA (Promega) was preincubated with varying concentrations of antibiotics for 5 min at 20 °C. The reactions (10 l final volume) were initiated by adding 0.64 g of pBestLuc plasmid DNA (Promega).",
                        "Reactions were incubated for 40 min at 20°C and stopped by chilling on ice. The activity of firefly luciferase synthesized in the reaction was determined in 96-well plates using Bright-Glo Luciferase Assay System (Promega) as recommended by the manufacturer. The data were analyzed using Prism 4 (GraphPad Software). After addition of varying concentrations of LC, puromycin was added to the final concentration of 0.5 mM and reactions were incubated for 15 m{Maguire, 2005 #63}in at 37°C. Reactions were stopped and processed as in (64)."
                    ],
                    "subsections": [
                        {
                            "title": "RNA probing",
                            "paragraphs": [
                                "RNA probing was carried out essentially as described (46) using D. radiodurans 50S ribosomal subunits at 200 nM concentration and antibiotics at the following concentrations:",
                                "LC -50 M, LM -500 M, ERY -50 M. Prior to addition of the modifying reagents, ribosomal subunits were pre-incubated with the drug 10 min at 37°C and then 10 min at 20°C."
                            ],
                            "subsections": [
                                {
                                    "title": "Cell-free translation system used for detecting synergism in vitro",
                                    "paragraphs": [
                                        "Inhibition of cell-free protein synthesis by LC and LM was measured using the E. coli cell-free transcription-translation and the firefly luciferase activity assay. Cell free extract was prepared from Escherichia Coli (Strain BL21-DE3) in a manner similar to that previously reported (66). An aqueous containing amino acid mix (1.3 mM for each amino acid), magnesium acetate (20 mM), NTP mix (0.9 mM), ATP (0.4 mM), potassium glutamate (150 mM), E. Coli tRNA mixture (0.17 mg/mL), DTT (1.8 mM), folinic acid (35 µg/mL), cAMP (0.65 mM), NH 4 OAc (28 mM), creatine phosphate (80 mM), HEPES (pH = 7.5 @ 37 °C, 140 mM), 9.5% w/v PEG-8000, tyrosine (0.4 mg/mL), creatine kinase (0.35 mg/mL) and S12 cell free extract (12% v/v) was prepared. To this solution as added PIVEX.6D plasmid encoding wild-type GFP (1 ng/µL), commencing the transcription-translation reaction.",
                                        "This solution was immediately added to a 96 well plate containing serial dilutions of lankamycin and lankacidin. After incubation for 1 hour at 37°C, 50 µL of Erythromyin (8 µM) was added to each well to completely stop the translation reaction. The fluorescence data were collected on a TECAN SpectraFluor PlusTM 96-well plate reader ( excite = 485 nm, emit = 535 nm). The data were fitted using the least-squared regression analysis package in Igor Pro TM .",
                                        "A control experiment was performed in the absence of the antibiotics. This experiment was also used for the determination of the time window required for maximum GFP production before the reaction was quenched. "
                                    ],
                                    "subsections": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "Acknowledgements",
                    "paragraphs": [
                        "We thank the ribosome group at the Weizmann Institute for participating in the experiments reported here and Dr. Llano-Sotelo (UIC) for helping with the analysis of the inhibitory and competition data. We thank Drs. Kinashi and Arakawa (Hiroshima University) and Dr. Weisblum (University of Wisconsin) for providing samples of lankamycin and Pfizer, Inc. for lankacidin. Crystallographic data were collected at station 19ID at the Advanced Photon Source (Argonne National Laboratory) and ID23-2 at European Synchrotron Radiation Facility, and we thank the staff of both facilities for excellent assistance. This work was supported by the US National Institutes of Health grants GM34360 (to AY), and U19 AI56575 (to ASM) and by Kimmelman Center for Macromolecular Assemblies. CD is supported by the Adams Fellowship Program of the Israel Academy of Sciences and Humanities. AY holds the Martin and Helen Kimmel Professorial Chair."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Materials and Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Crystallography",
                    "paragraphs": [
                        "Crystals of D50S that were grown as in (41) were soaked in solutions containing 0.025mM of lankacidin for 20 hours at 20o C, transferred into cryo-buffer and shock-frozen in liquid nitrogen. X-ray data were collected at 85-100 K from shock-frozen crystals at wave length of ~ 1.0 and 0.837 Å, at crystal to detector distance of 430 mm, using oscillation range of 0.3 with synchrotron radiation beam at 19ID at the Advanced Photon Source/Argonne National Laboratory and at ID23-2 at the European Synchrotron Radiation Facility (ESRF), respectively. Data were recorded on charge-coupled device and processed with HKL2000 (55). Complete Xray data sets were obtained from two crystals. The structure of D50S was refined against the structure factor amplitudes of the antibiotic complex D50S-LC using rigid body refinement as implemented in CNS (58,59). For free R-factor calculation, random 5% of the data were omitted during refinement. To obtain an unbiased electron density map a composite omit map of the entire unit cell was calculated. Further refinement was carried out using CNS 1.2 minimization combined with various (56) programs, exploiting the available crystal structure of Bundlin-A (lankacidin) (29).",
                        "Finally, the complete molecules were subjected to restraint minimization and grouped B factor refinement with CNS. The ribosome-antibiotic interactions were determined with LigPlot (60) and LPC (61). Images were generated using PyMol (62)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Antibiotic binding",
                    "paragraphs": [
                        "D. radiodurans 50S subunits (0.1 M) were preincubated 15 min at 37°C with 0.1 M of"
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}