{
    "id": "US20180023100",
    "authors": [
        "Aysenur Eminoglu",
        "Daniel G. Olson",
        "Lee R. Lynd"
    ],
    "title": "INCREASED ETHANOL PRODUCTION BY THERMOPHILIC MICROORGANISMS WITH DELETION OF INDIVIDUAL HFS HYDROGENASE SUBUNITS",
    "date": "2017-07-21 00:00:00",
    "abstract": "Disclosed are methods for engineering bacteria, for example, Thermoanaerobacterium saccharolyticum, that convert biomass to ethanol at high yield by deleting a single gene. Deletion of subunit A or subunit B of the hfs hydrogenase, but not deletion of subunit C or subunit D, results in an increase in ethanol yield.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "I. Field of the Invention",
                            "paragraphs": [
                                "The disclosure relates to conversion of biomass to biofuel or other useful products. More particularly, the disclosure pertains to the generation of microorganisms having higher ethanol yields."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define field of invention"
                            ],
                            "num_characters": 193,
                            "outline_medium": [
                                "define field of invention"
                            ],
                            "outline_short": [
                                "define field of invention"
                            ]
                        },
                        {
                            "title": "II. Description of the Related Art",
                            "paragraphs": [
                                "Thermophilic bacteria have been engineered to produce ethanol from the cellulose and/or hemicellulose fractions of biomass. Examples of such thermophilic bacteria include Clostridium thermocellum and Thermoanaerobacterium saccharolyticum, among others.",
                                "Thermoanaerobacterium saccharolyticum is a thermophilic, anaerobic bacterium able to ferment hemicellulose but not cellulose. Wild-type strains produce ethanol, acetic acid and under certain conditions, lactic acid as the main fermentation products.",
                                "Thermoanaerobacterium saccharolyticum may consume a variety of sugars derived from the hemicellulose fraction of lignocellulosic biomass and convert them to acetate, lactate and ethanol. A number of strategies have been pursued to engineer this organism for increased ethanol production. Generally these strategies involve deleting genes for lactate production, acetate production or both. These strategies have helped improve the ethanol yield, but each approach has its own limitations.",
                                "The primary hydrogenase in T. saccharolyticum is called hfs, which has four subunits, hfsA, hfsB, hfsC and hfsD. Complete deletion of all four subunits (A, B, C and D) has been reported (Shaw et al. 2009). Deletion of hfs (A, B, C and D subunits) does not increase ethanol yield. Deletion of hfs and ldh in combination increases ethanol yield by 44%. In a different approach, a mutant hfs operon (called hfs*), containing several point mutations from a high-ethanol-producing strain, is re-introduced into the wild-type strain. The resultant strain shows 36% increase in ethanol yield as compared to the parental strain (Shaw et al. 2015)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe thermophilic bacteria",
                                "describe limitations of prior art",
                                "summarize prior art strategies"
                            ],
                            "num_characters": 1634,
                            "outline_medium": [
                                "summarize related art"
                            ],
                            "outline_short": [
                                "summarize related art"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "The presently disclosed instrumentalities advance the art by providing methods for engineering a thermophilic bacterium to produce ethanol at high yield by deleting a single gene. In one embodiment, it is shown here that single deletion of hfsA or hfsB allows for increased ethanol yield in a variety of thermophilic bacterial strains. In another embodiment, although deleting hydrogenases is typically accompanied by an increase in lactate production, deletion of the hfsA or hfsB, as shown here, does not result in a substantial increase in lactate production.",
                        "In one embodiment, the present disclosure provides T. saccharolyticum strains in which subunit A and/or subunit B (but not subunit C or subunit D) is disrupted. The resultant strain shows an increase of ethanol yield by 77% as compared to the parental strain (FIGS. 2A and 2B). In another embodiment, microorganisms suitable for the improvement from hfs deletions may include but are not limited to the genus of Thermoanaerobacterium. Examples of such microorganisms may include, Thermoanaerobacterium saccharolyticum, Thermoanaerobacterium thermosaccharolyticum and Thermoanaerobacterium xylanolyticum. The same or similar hfs deletions may be applied to these other organisms as well.",
                        "In one embodiment, a genetically engineered microorganism is disclosed, which comprises a functional hfsC subunit and/or a functional hfsD subunit of the hfs hydrogenase, wherein expression of at least one subunit of the hfs hydrogenase is disrupted. The disrupted subunit may be hfsA and/or hfsB, and there may be only one or two disrupted subunits. For purpose of this disclosure, the term “functional” means the protein is performing the same or substantially the same role as its counterpart in a wild-type strain. In one aspect, the disclosed microorganism may belong to the genus of Thermoanaerobacterium. In another aspect, the disclosed microorganism may be selected from the group consisting of Thermoanaerobacterium saccharolyticum, Thermoanaerobacterium thermosaccharolyticum and Thermoanaerobacterium xylanolyticum.",
                        "In another embodiment, the disclosed microorganism may have an ethanol yield that is equal to or greater than 70%, 80% or 90% of theoretical yield.",
                        "In another embodiment, the disclosed microorganism may have intact or functional pta and ack genes. In one aspect, the sequences of the pta and ack genes in the disclosed microorganism are identical to the pta and ack genes in a wildtype strain of the same species.",
                        "In another embodiment, the disclosed microorganism may have intact or functional ldh gene. In one aspect, the sequence of the ldh gene is identical to the ldh gene in a wildtype strain of the same species.",
                        "In another embodiment, the HfsA protein of the disclosed microorganism of may be at least 45, 60, 70, 80, 90, 95% or 100% identical to a sequence selected from the group consisting of SEQ ID No. 1, SEQ ID No. 2 and SEQ ID No. 3.",
                        "In another embodiment, the HfsB protein of the disclosed microorganism of may be at least 45, 60, 70, 80, 90, 95% or 100% identical to a sequence selected from the group consisting of SEQ ID No. 4, SEQ ID No. 5 and SEQ ID No. 6."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce invention",
                        "describe single gene deletion",
                        "describe increased ethanol yield",
                        "describe microorganisms suitable for improvement",
                        "describe genetically engineered microorganism",
                        "describe various embodiments"
                    ],
                    "num_characters": 3162,
                    "outline_medium": [
                        "motivate invention",
                        "describe embodiments",
                        "summarize advantages"
                    ],
                    "outline_short": [
                        "summarize invention"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "Disclosed here are methods to generate microorganisms capable of producing ethanol from lignocellulosic feedstock with high yield. In one embodiment, disruption of specific subunits of the hfs hydrogenase are shown to result in higher ethanol yield in Thermoanaerobacterium saccharolyticum.",
                        "The primary hydrogenase in T. saccharolyticum is called hfs, which consists of 4 subunits, hfsA, hfsB, hfsC and hfsD (FIG. 1). Sequences of these genes and the encoded proteins in T. saccharolyticum and other species have been described in, for example, Shaw A J, et al., Metabolic engineering of a thermophilic bacterium to produce ethanol at high yield. Proc. Natl. Acad. Sci. U.S.A. 2008, 105:13769-74; Herring C D, et al., Strain and bioprocess improvement of a thermophilic anaerobe for the production of ethanol from wood. Biotechnol. Biofuels 2016, 9:125; Shaw A J, et al., Identification of the [FeFe]-hydrogenase responsible for hydrogen generation in Thermoanaerobacterium saccharolyticum and demonstration of increased ethanol yield via hydrogenase knockout. J. Bacteriol. 2009, 191:6457-64. It has been shown that the hfs hydrogenase is responsible for H2 production in T. saccharolyticum. Deletion of the hfs operon has been shown to result in a decrease in H2 and acetate, but no change in ethanol production. In a previous report, all 4 subunits of the hfs gene have been deleted in one strain. However, no significant increase in ethanol yield has been observed in the strain in which all 4 subunits have been deleted.",
                        "In one embodiment, it is disclosed that when the hfsA and/or hfsB gene is deleted in Thermoanaerobacterium organisms, such as Thermoanaerobacterium saccharolyticum, Thermoanaerobacterium thermosaccharolyticum, and Thermoanaerobacterium xylanolyticum, the resultant strains have increased ethanol yield. Even on 20 g/l cellobiose, the strains may perform almost as well as another engineered strains, M1442 (Δ(pta-ack) Δldh Δor795::metE-ure Δeps).",
                        "This genetic modification is a quick way to generate high-ethanol-producing strains. In another embodiment, these hfsA or hfsB deletion strains may be paired with cellulolytic strains (i.e. C. thermocellum) to convert plant biomass into ethanol.",
                        "Various manipulations of bacteria, DNA/RNA and protein may be performed as described in the literature. Transgenic and homologous recombination in Thermoanaerobacterium saccharolyticum may be performed as described in Shaw, A. J., Covalla, S. F., Hogsett, D. A & Herring, C. D. Marker removal system for Thermoanaerobacterium saccharolyticum and development of a markerless ethanologen. Appl. Environ. Microbiol. 77, 2534-6 (2011) and Shaw, A. J., Hogsett, D. A. & Lynd, L. R. Natural competence in Thermoanaerobacter and Thermoanaerobacterium species. Appl. Environ. Microbiol. 76, 4713-4719 (2010).",
                        "The term “biomass” refers to non-fossilized renewable materials that are derived from or produced by living organisms. In its broadest term, biomass may include animal biomass, plant biomass, and human waste and recycled materials, among others. Examples of animal biomass may include animal by-product and animal waste, etc. In one embodiment of this disclosure, biomass refers to plant biomass which includes any plant-derived matter (woody or non-woody) that is available on a sustainable basis. Plant biomass may include, but is not limited to, agricultural crop wastes and residues such as corn stover, corn processing byproducts such as corn bran or corn fiber, wheat straw, rice straw, sugar cane bagasse and the like, grass crops, such as switch grass, alfalfa, winter rye, and the like. Plant biomass may further include, but is not limited to, woody energy crops, wood wastes and residues such as trees, softwood forest thinnings, barky wastes, sawdust, paper and pulp industry residues or waste streams, wood fiber, and the like. In urban areas, plant biomass may include yard waste, such as grass clippings, leaves, tree clippings, brush, etc., vegetable processing waste, as well as recycled cardboard and paper products.",
                        "In one embodiment, grassy biomass may be used in the present disclosure. In another embodiment, winter cover crops such as winter rye may be used as a bioenergy feedstock using existing equipment and knowhow. Winter cover crops have little and arguably no competition with food crops for land or revenue, and they also positively impact soil and water quality as well as farm income, and offer important co-product opportunities. A recent study estimated that 200 million dry tons of winter rye per year could be produced in the U.S. on land used to grow corn and soybeans, which has a liquid fuel production potential equal to that of the current U.S. and Brazilian industries combined.",
                        "By using the system and methods disclosed herein, other cellulosic feedstocks may also be processed into biofuels without pretreatment. Examples of microorganisms may include but are not limited to Thermoanaerobacterium saccharolyticum, Thermoanaerobacterium thermosaccharolyticum, Thermoanaerobacterium xylanolyticum, Clostridium thermocellum, Clostridium clariflavum, Caldicellulosiruptor bescii, or Clostridium thermocellum/Thermoanaerobacterium saccharolyticum co-culture as fermentation systems. Various techniques known in the art for enhancing ethanol yield may be employed to further enhance the conversion.",
                        "The terms “disrupted” or “disruption of a gene” means the functionality of a gene is manipulated such that the disrupted gene no longer leads to expression of a functional protein that would perform the normal functionality in a wild-type organism. In one embodiment, a gene may be disrupted by introduction of one or more deletion, addition (insertion), substitution mutations in its coding region or in its regulatory elements. In one particular embodiment, a gene is disrupted by introduction of one or more deletion, addition (insertion), substitution mutations in its coding region.",
                        "The terms “targeted disruption” or “targeted deletion” refer to disruption of the functionality of a gene or a coding region of a gene by introduction of at least one deletion, addition, substitution mutation at a specific location of the gene or coding region which results in a loss of function of the protein encoded by the mutated gene or mutated coding region.",
                        "It will be readily apparent to those skilled in the art that the systems and methods described herein may be modified and substitutions may be made using suitable equivalents without departing from the scope of the embodiments disclosed herein. Having now described certain embodiments in detail, the same will be more clearly understood by reference to the following examples, which are included for purposes of illustration only and are not intended to be limiting."
                    ],
                    "subsections": [
                        {
                            "title": "EXAMPLES",
                            "paragraphs": [
                                "**Example 1 Deletion of Specific Hfs Hydrogenase Subunits Increases Ethanol Production in T. saccharolyticum**",
                                "The primary hydrogenase in Thermoanaerobacterium. saccharolyticum is called hfs, which has 4 subunits, hfsA, hfsB, hfsC and hfsD (FIG. 1). In this Example, specific subunit(s) of the Hfs gene in Thermoanaerobacterium saccharolyticum were disrupted to generate strains with higher ethanol yield.",
                                "When either hfsA or hfsB was disrupted, but hfsC and hfsD were kept intact, ethanol production was similar to the high ethanol (ethanologen) strains (FIG. 2).",
                                "In order to understand the mechanism for increased ethanol production, the strains were analyzed by whole genome re-sequencing to identify secondary mutations, and by RNAseq to measure changes in gene expression. LC/MS-MS was also used to measure changes in protein abundance. adhE was found to be consistently over-expressed in the high ethanol producing strains, such as the HfsA and HfsB deletion strains. Significant (4-5×) upregulation of adhE at both gene and protein levels were observed in the hfsA or hfsB deletion strains. By contrast, hfs deletions of the other subunits have almost no effects on downstream gene expression.",
                                "Enzymatic assays were used to check for the possibility of regulatory effects. ADH, ALDH and FNOR activities were measured with both NADH and NADPH cofactors. High ADH-NADH specific activity was observed in ΔhfsB strain.",
                                "In summary, this Example shows the presence of a previously-unknown regulatory mechanism of the ethanol production pathway in T saccharolyticum. This experiment has also demonstrated a tool for rapid creation of ethanologen strains by deletion of hfsA or hfsB, which is sufficient to generate an ethanologen phenotype in T. saccharolyticum and other members of the genus.",
                                "**Example 2 Deletion of Hfs Subunit B in Other Thermoanaerobacterium Strains**",
                                "The improvement from hfsA or hfsB deletions is not limited to T saccharolyticum. Similar effects were also observed in two other organisms, Thermoanaerobacterium thermosaccharolyticum and Thermoanaerobacterium xylanolyticum (FIG. 3). In all 3 organisms, ethanol yield was greater than 80% of the theoretical maximum. The hfsB deletion strains performed almost as well as another engineered strains, M1442 (Δ(pta-ack) Δldh Δor795::metE-ure Δeps) on 20 g/l cellobiose (FIG. 4). (Note, strain M1442 is also described as strain LL1049 in FIG. 2B) This genetic modification is a quick way to generate high-ethanol-producing strains. These strains could be paired with cellulolytic strains (i.e. C. thermocellum) to convert plant biomass into ethanol.",
                                "**Materials and Methods**",
                                "Media and Growth Conditions.",
                                "Genetic modifications of T. saccharolyticum JW/SL-YS485 strains were performed in CTFUD medium, containing 1.3 g/L (NH4)2SO4, 1.5 g/L KH2PO4, 0.13 g/L CaCl2. 2H2O, 2.6 g/L MgCl2.6H2O, 0.001 g/L FeSO4.7H2O, 4.5 g/L yeast extract, 5 g/L cellobiose, 3 g/L sodium citrate tribasic dihydrate, 0.5 g/L L-cysteine-HCl monohydrate, 0.002 g/L resazurin and 10 g/L agarose (for solid media only). The pH was adjusted to 6.7 for selection with kanamycin (200 μg/ml), or pH was adjusted to 6.1 for selection with erythromycin (25 μg/ml).",
                                "Measurement of fermentation products and growth of T saccharolyticum were performed in MTC-6 medium [12], including 5 g/L cellobiose, 9.25 g/L MOPS (morpholinepropanesulfonic acid) sodium salt, 2 g/L ammonium chloride, 2 g/L potassium citrate monohydrate, 1.25 g/L citric acid monohydrate, 1 g/L Na2SO4, 1 g/L KH2PO4, 2.5 g/L NaHCO3, 2 g/L urea, 1 g/L MgCl2.6H2O, 0.2 g/L CaCl2.H2O, 0.1 g/L FeCl2.6H2O, 1 g/L L-cysteine HCl monohydrate, 0.02 g/L pyridoxamine HCl, 0.004 g/L p-aminobenzoic acid (PABA), 0.004 g/L D-biotin, 0.002 g/L Vitamin B12, 0.04 g/L thiamine, 0.005 g/L MnCl2.4H2O, 0.005 g/L CoCl2.6H2O, 0.002 g/L ZnCl2, 0.001 g/L CuCl2.2H2O, 0.001 g/L H3BO3, 0.001 g/L Na2MoO4.2H2O, 0.001 g/L NiCl2.6H2O. It was prepared by combining six sterile solutions with minor modification under nitrogen atmosphere as described before [11]. All of six solutions were sterilized through a 0.22 μm filter (Corning, #430517). A solution, concentrated 2.5-fold, contained cellobiose, MOPS sodium salt and distilled water. B Solution, concentrated 25-fold, contained potassium citrate monohydrate, citric acid monohydrate, Na2SO4, KH2PO4, NaHCO3 and distilled water. C solution, concentrated 50-fold, contained ammonium chloride and distilled water. D solution, concentrated 50-fold, contained MgCl2.6H2O, CaCl2.H2O, FeCl2.6H2O, L-cysteine HCl monohydrate. E solution, concentrated 50-fold, contained thiamine, pyridoxamine HCl, p-aminobenzoic acid (PABA), D-biotin, Vitamin B12. F solution, concentrated 1000-fold, contained MnCl2.4H2O, CoCl2.6H2O, ZnCl2, CuCl2.2H2O, H3BO3, Na2MoO4.2H2O, NiCl2.6H2O. For some fermentation required additional compositions, additional compositions were added after six solutions were combined. The pH was adjusted to 6.1 as the optimal pH for growth. Fermentations of T. saccharolyticum were done in 125-ml glass bottles at 55° C. under nitrogen atmosphere. The working volume is 50 ml with shaking at 250 rpm. Fermentations were allowed to proceed for 72 h at which point samples were collected for analysis.",
                                "E. coli strains used for cloning were grown aerobically at 37° C. in Lysogeny Broth (LB) [14] medium with either kanamycin (200 μg/ml) or erythromycin (25 μg/ml). For cultivation on solid medium, 15 g/L agarose was added.",
                                "All reagents used were from Sigma-Aldrich unless otherwise noted. All solutions were made with water purified using a MilliQ system (Millipore, Billerica, Mass.).",
                                "Plasmid Construction.",
                                "Plasmids for gene deletion were designed as previously described [15] with either kanamycin or erythromycin resistance cassettes from plasmids pMU433 or pZJ23 flanked by 1.0 to 0.5-kb regions homologous to the 5′ and 3′ regions of the deletion target of interest. Plasmid pZJ23 was created as a new deletion vector by assembling an erythromycin cassette from the ALK2 strain and E. coli replication region from plasmid pUC19. Homologous regions of deletion targets of interest were amplified from wild type T. saccharolyticum (LL1025).",
                                "Plasmids were assembled by Gibson assembly master mix (New England Biolabs, Ipswich, Mass.). The assembled circular plasmids were transformed into E. coli DH5α chemical competent cells (New England Biolabs, Ipswich, Mass.) for propagation. Plasmids were purified by a Qiagen miniprep kit (Qiagen Inc., Germantown, Md.).",
                                "Transformation of T. saccharolyticum.",
                                "Plasmids were transformed into naturally-competent T. saccharolyticum as described before [16, 17]. Mutant were grown and selected on solid medium with kanamycin (200 μg/ml) at 55° C. or with erythromycin (20 μg/ml) at 48° C. in an anaerobic chamber (COY Labs, Grass Lake, Mich.). Mutant colonies appeared on selection plates after about 3 days. Target gene deletions with chromosomal integration of both homology regions were confirmed by PCR with primers external to the target genes.",
                                "Preparation of Cell-Free Extracts.",
                                "T. saccharolyticum cells were grown in CTFUD medium in an anaerobic chamber (COY labs, Grass Lake, Mich.), and harvested in the exponential phase of growth. To prepare cell-free extracts, cells were collected by centrifugation at 6000 g for 15 minutes and washed twice under similar conditions with a deoxygenated buffer containing 100 mM Tris-HCl (pH 7.5 at 0° C.) and 5 mM dithiothreitol (DTT). Cells were resuspended in 3 ml of the washing buffer. Resuspended cells were lysed by adding 104 U of Ready-lyse lysozyme solution (Epicentre, Madison, Wis.) and 50 U of DNase (Thermo scientific, Waltham, Mass.) and then incubated at room temperature for 20 minutes. The crude lysate was centrifuged at 12,000 g for 5 minutes and the supernatant was collected as cell-free extract. The total amount of protein in the extract was determined by Bradford assay, using bovine serum albumin as the standard.",
                                "Enzymes Assays.",
                                "Enzyme activity was assayed in an anaerobic chamber (COY labs, Grass Lake, Mich.) using an Agilent 8453 spectrophotometer with Peltier temperature control module (part number 89090A) to maintain assay temperature. The reaction volume was 1 ml, in reduced-volume quartz cuvettes (part number 29MES10; Precision Cells Inc., NY) with a 1.0 cm path length. All enzyme activities are expressed as μmol of product·min−1·(mg of cell extract protein)−1. For each enzyme assay, at least two concentrations of cell extract were used to confirm that specific activity was proportional to the amount of extract added.",
                                "All chemicals and coupling enzymes were purchased from Sigma except for coenzyme A, which is from EMD Millipore (Billerica, Mass.). All chemicals were prepared fresh weekly.",
                                "Ferredoxin nicotinamide oxidoreductase (FNOR) was assayed by the reduction of benzyl viologen at 578 nm at 55° C. with minor modifications as described before in Lo, J. et al. Deletion of nfnAB in Thermoanaerobacterium saccharolyticum and its effect on metabolism. J. Bacteriol. 197, JB.00347-15 (2015). An extinction coefficient of ξ578=7.8 mM−1 cm−1 was used for calculating activity. The assay mixture contained 100 mM Tris-HCl (pH=7.5 at 55° C.), 0.5 mM DTT, 1 mM benzyl viologen and cell extract. The reaction was started by adding 0.3 mM NADH or NADPH. Alcohol and aldehyde dehydrogenase activity (ADH and ALDH, respectively) were measured as described in Lo, J., Zheng, T., Hon, S., Olson, D. G. & Lynd, L. R. The bifunctional alcohol and aldehyde dehydrogenase gene, adhe, is necessary for ethanol production in Clostridium thermocellum and Thermoanaerobacterium saccharolyticum. J. Bacteriol. (in press), JB.02450-14 (2015). Briefly, the oxidation of NAD(P)H was followed by spectrophotometric observation at 340 nm (ε=6,220M−1 cm−1). In all cases, the final assay volume was 0.8 ml. For the ADH (acetaldehyde reduction) reactions, the anaerobic reaction mixture contained 100 mM Tris-HCl buffer (pH 7.0), 5 mM FeSO4, 0.25 mM NAD(P)H, 18 mM acetaldehyde, 1 mM DTT, and cell extract as indicated. For the ALDH (acetyl-CoA reduction) reactions, the anaerobic reaction mixture contained 100 mM Tris-HCl buffer (pH 7.0), 5 uM FeSO4, 0.25 mM NAD(P)H, 1.25 mM acetyl-CoA, 1 mM DTT, and cell extract.",
                                "RNA Isolation, RT-PCR and qPCR for Determining Transcriptional Expression Level.",
                                "3 ml of bacterial culture was pelleted and lysed by digestion with lysozyme (15 mg/ml) and proteinase K (20 mg/ml). RNA was isolated with an RNeasy minikit (Qiagen Inc., Germantown, Md.) and digested with TURBO DNase (Life Technologies, Grand Island, N.Y.) to remove contaminating DNA. cDNA was synthesized from 500 ng of RNA using the iScript cDNA synthesis kit (Bio-Rad, Hercules, Calif.). Quantitative PCR (qPCR) was performed using cDNA with SsoFast EvaGreen Supermix (Bio-Rad, Hercules, Calif.) at an annealing temperature of 55° C. to determine expression levels of Tsac_0046, Tsac_0628 and Tsac_0629. In each case, expression was normalized to recA RNA levels. In order to confirm removal of contaminating DNA from RNA samples, cDNA was synthesized in the presence and absence of reverse transcriptase followed by qPCR using recA primers to insure only background levels were detected in the samples lacking reverse transcriptase. Standard curves were generated using a synthetic DNA template (gBlock, IDT, Coralville, Iowa) containing the amplicons.",
                                "**Genomic Sequencing.**",
                                "Genomic DNA was submitted to the Joint Genome Institute (JGI) for sequencing with an Illumina MiSeq instrument. Paired-end reads were generated, with an average read length of 150 bp and paired distance of 500 bp. Raw data was analyzed using CLC Genomics Workbench, version 7.5 (Qiagen, USA). First reads were mapped to the reference genome (NC_017992). Mapping was improved by 2 rounds of local realignment. The CLC Probabilistic Variant Detection algorithm was used to determine small mutations (single and multiple nucleotide polymorphisms, short insertions and short deletions). Variants occurring in less than 90% of the reads and variants that were identical to those of the wild type strain (i.e. due to errors in the reference sequence) were filtered out. To determine larger mutations, the CLC InDel and Structural Variant algorithm was run. This tool analyzes unaligned ends of reads and annotates regions where a structural variation may have occurred, which are called breakpoints. Since the read length averaged 150 bp and the minimum mapping fraction was 0.5, a breakpoint can have up to 75 bp of sequence data. The resulting breakpoints were filtered to eliminate those with fewer than 10 reads or less than 20% “not perfectly matched.” The breakpoint sequence was searched with the Basic Local Alignment Search Tool (BLAST) algorithm for similarity to known sequences. Pairs of matching left and right breakpoints were considered evidence for structural variations such as transposon insertions and gene deletions.",
                                "Analytical Techniques.",
                                "Fermentation products: cellobiose, glucose, acetate, lactate, formate, pyruvate, succinate, malate and ethanol were analyzed by a Waters (Milford, Mass.) high pressure liquid chromatography (HPLC) system with an Aminex HPX-87H column (Bio-Rad, Hercules, Calif.). The column was eluted at 60° C. with 0.25 g/L H2SO4 at a flow rate of 0.6 ml/min Cellobiose, glucose, acetate, lactate, formate, succinate, malate and ethanol were detected by a Waters 410 refractive-index detector and pyruvate was detected by a Waters 2487 UV detector. Sample collection and processing were as reported previously.",
                                "Carbon from cell pellets were determined by elemental analysis with a TOC-V CPH and TNM-I analyzer (Shimadzu, Kyoto, Japan) operated by TOC-Control V software. Fermentation samples were prepared as described with small modifications [22]. A 1 ml sample was centrifuged to remove supernatant at 21,130×g for 5 minutes at room temperature. The cell pellet was washed twice with MilliQ water. After washing, the pellet was resuspended in a TOCN 25 ml glass vial containing 19.5 ml MilliQ water. The vials were then analyzed by the TOC-V CPH and TNM-I analyzer.",
                                "Hydrogen was determined by gas chromatography using a Model 310 SRI Instruments (Torrence, Calif.) gas chromatograph with a HayeSep D packed column using a thermal conductivity detector and nitrogen carrier gas. The nitrogen flow rate was 8.2 ml/min.",
                                "**Example 3 Deletion of Hfs Subunit in Other Bacterial Species**",
                                "To determine if the hfsB regulation system is present in other organisms, hfsB was deleted in Clostridium thermocellum, Thermoanaerobacter mathranii, Thermoanaerobacterium xylanolyticum and Thermoanaerobacterium thermosaccharolyticum (FIG. 6). In all of these organisms, ethanol production increased as a result of the disruption. In C. thermocellum, we made a deletion of the whole hfs operon (Clo1313_1796 to 1793) in addition to the deletion of just the hfsB subunit. In this organism, a pattern similar to that of T. saccharolyticum: deletion of the hfsB subunit alone that improved ethanol production was observed, whereas deletion of the whole hfs operon did not.",
                                "Strains used in this work were re-sequenced to confirm that the genetic modification had been made as intended, to check for possible contamination and to identify the presence of secondary mutations. All strains were correct, no evidence of contamination was found.",
                                "The contents of all cited references (including literature references, patents, patent applications, and websites) that may be cited throughout this application or listed below are hereby expressly incorporated by reference in their entirety for any purpose into the present disclosure. The disclosure may employ, unless otherwise indicated, conventional techniques of microbiology, molecular biology and cell biology, which are well known in the art.",
                                "The disclosed methods and systems may be modified without departing from the scope hereof. It should be noted that the matter contained in the above description or shown in the accompanying drawings should be interpreted as illustrative and not in a limiting sense."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce example 1",
                                "describe hfs gene in T. saccharolyticum",
                                "disrupt specific subunit(s) of hfs gene",
                                "analyze ethanol production",
                                "perform whole genome re-sequencing",
                                "perform RNAseq",
                                "measure protein abundance by LC/MS-MS",
                                "analyze adhE expression",
                                "perform enzymatic assays",
                                "measure ADH, ALDH and FNOR activities",
                                "summarize results of example 1",
                                "introduce example 2",
                                "describe deletion of hfsB in other Thermoanaerobacterium strains",
                                "analyze ethanol production in other strains",
                                "compare results to engineered strain M1442",
                                "discuss potential applications",
                                "introduce materials and methods",
                                "describe media and growth conditions",
                                "describe measurement of fermentation products",
                                "describe plasmid construction",
                                "describe transformation of T. saccharolyticum",
                                "describe preparation of cell-free extracts",
                                "describe enzyme assays",
                                "describe RNA isolation and RT-PCR",
                                "describe qPCR",
                                "describe genomic sequencing",
                                "describe analysis of genomic sequencing data",
                                "introduce example 3",
                                "describe deletion of hfsB in other bacterial species",
                                "analyze ethanol production in other species",
                                "discuss results of example 3",
                                "conclude examples"
                            ],
                            "num_characters": 16135,
                            "outline_medium": [
                                "introduce example 1: deletion of specific hfs hydrogenase subunits",
                                "describe experimental design of example 1",
                                "present results of example 1: ethanol production increase",
                                "analyze results of example 1: adhE over-expression",
                                "perform enzymatic assays to check regulatory effects",
                                "summarize findings of example 1: new regulatory mechanism",
                                "introduce example 2: deletion of hfs subunit B in other thermoanaerobacterium strains",
                                "describe experimental design of example 2",
                                "present results of example 2: ethanol yield increase",
                                "compare results of example 2 to engineered strains",
                                "introduce materials and methods",
                                "describe media and growth conditions",
                                "outline plasmid construction and transformation",
                                "describe preparation of cell-free extracts and enzyme assays",
                                "introduce example 3: deletion of hfs subunit in other bacterial species",
                                "summarize findings of example 3: hfsB regulation system in other organisms"
                            ],
                            "outline_short": [
                                "describe deletion of specific Hfs hydrogenase subunits",
                                "show increased ethanol production in T. saccharolyticum",
                                "analyze mechanism of increased ethanol production",
                                "demonstrate deletion of Hfs subunit B in other Thermoanaerobacterium strains",
                                "describe materials and methods used in experiments",
                                "detail plasmid construction and transformation of T. saccharolyticum",
                                "describe enzyme assays and analytical techniques",
                                "demonstrate deletion of Hfs subunit in other bacterial species"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce microorganism ethanol production",
                        "describe hfs hydrogenase structure",
                        "summarize prior art on hfs deletion",
                        "disclose hfsA and/or hfsB gene deletion",
                        "describe resultant strain characteristics",
                        "propose pairing with cellulolytic strains",
                        "discuss genetic manipulation techniques",
                        "define biomass and its types",
                        "describe plant biomass examples",
                        "discuss winter cover crops as bioenergy feedstock",
                        "define disrupted gene and targeted disruption",
                        "discuss applicability to other cellulosic feedstocks",
                        "note scope of embodiments and modifications"
                    ],
                    "num_characters": 6790,
                    "outline_medium": [
                        "introduce microorganism for ethanol production",
                        "describe hfs hydrogenase structure",
                        "motivate hfsA and/or hfsB gene deletion",
                        "define biomass and its types",
                        "describe genetic modification techniques",
                        "define disruption and targeted disruption of genes"
                    ],
                    "outline_short": [
                        "motivate microorganism modification",
                        "describe hfs hydrogenase disruption",
                        "define biomass and microorganism applications"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A genetically engineered microorganism comprising a functional hfsC subunit and a functional hfsD subunit of the hfs hydrogenase, wherein expression of at least one subunit of the hfs hydrogenase is disrupted, said at least one subunit being selected from the group consisting of hfsA and hfsB.",
        "2. The microorganism of claim 1, wherein said microorganism belongs to a genus selected from the group consisting of Thermoanaerobacterium, Thermoanaerobacter and Clostridium.",
        "3. The microorganism of claim 1, wherein said microorganism is selected from the group consisting of Thermoanaerobacterium saccharolyticum, Thermoanaerobacterium thermosaccharolyticum, Thermoanaerobacterium xylanolyticum, Thermoanaerobacter mathranii and Clostridium thermocellum.",
        "4. The microorganism of claim 1, wherein said microorganism is Thermoanaerobacterium saccharolyticum.",
        "5. The microorganism of claim 1, wherein only one subunit of the Hfs hydrogenase is disrupted.",
        "6. The microorganism of claim 5, wherein the subunit hfsA is disrupted by targeted mutation.",
        "7. The microorganism of claim 5, wherein the subunit hfsB is disrupted by targeted mutation.",
        "8. The microorganism of claim 1, wherein both subunits hfsA and hfsB of the hfs hydrogenase are disrupted.",
        "9. The microorganism of claim 1, wherein said microorganism has an ethanol yield greater than 80% of theoretical yield.",
        "10. The microorganism of claim 1, wherein the pta and ack genes in said microorganism are identical to the pta and ack genes in a wildtype strain of the same species.",
        "11. The microorganism of claim 1, wherein ldh the gene in the microorganism is identical to the ldh gene in a wildtype strain of the same species.",
        "12. The microorganism of claim 1, wherein the amino acid sequence of HfsA is at least 80% identical to a sequence selected from the group consisting of SEQ ID No. 1, SEQ ID No. 2 and SEQ ID No. 3.",
        "13. The microorganism of claim 1, wherein the amino acid sequence of HfsB is at least 80% identical to a sequence selected from the group consisting of SEQ ID No. 4, SEQ ID No. 5 and SEQ ID No. 6.",
        "14. The microorganism of claim 1, wherein said HfsC subunit has an amino acid sequence identical to that of wild-type HfsC subunit, and wherein said HfsD subunit has an amino acid sequence identical to that of wild-type HfsD subunit.",
        "15. A method of producing ethanol from biomass, comprising contacting the biomass with a genetically engineered microorganism to produce ethanol, said microorganism comprising a functional hfsC subunit and a functional hfsD subunit of the hfs hydrogenase, wherein expression of at least one subunit of the hfs hydrogenase is disrupted, said at least one subunit being selected from the group consisting of hfsA and hfsB.",
        "16. The method of claim 15, wherein said microorganism is selected from the group consisting of Thermoanaerobacterium saccharolyticum, Thermoanaerobacterium thermosaccharolyticum, Thermoanaerobacterium xylanolyticum, Thermoanaerobacter mathranii and Clostridium thermocellum.",
        "17. The method of claim 15, wherein the microorganism is co-cultured with Clostridium thermocellum to produce ethanol from the biomass, wherein the Clostridium thermocellum is genetically engineered.",
        "18. A method of generating a microorganism, comprising disrupting expression of at least one subunit of the Hfs hydrogenase, said at least one subunit being selected from the group consisting of HfsA and HfsB, said HfsA having an amino acid sequence at least 80% identical to a sequence selected from the group consisting of SEQ ID No. 1, SEQ ID No. 2 and SEQ ID No. 3, said HfsB having an amino acid sequence at least 80% identical to a sequence selected from the group consisting of SEQ ID No. 4, SEQ ID No. 5 and SEQ ID No. 6, wherein said microorganism comprises a functional HfsC subunit and a functional HfsD subunit of the Hfs hydrogenase.",
        "19. The method of claim 18, wherein said microorganism belongs to the genus selected from the group consisting of Thermoanaerobacterium, Thermoanaerobacter and Clostridium.",
        "20. The method of claim 19, wherein said microorganism is selected from the group consisting of Thermoanaerobacterium saccharolyticum, Thermoanaerobacterium thermosaccharolyticum, Thermoanaerobacterium xylanolyticum, Thermoanaerobacter mathranii and Clostridium thermocellum."
    ]
}