{
    "id": "https://semopenalex.org/work/W2015779168",
    "authors": [
        "Yanling Liu",
        "Johan R. Johansson",
        "Ulf Landegren",
        "Mats Gullberg",
        "Ola Söderberg",
        "Maria Hammond",
        "Jijuan Gu",
        "Åsa Hagner-McWhirter",
        "Daniel Ivansson",
        "Poojahrau Sathiyanarayanan"
    ],
    "title": "Western Blotting via Proximity Ligation for High Performance Protein Analysis",
    "date": "2011-11-01",
    "abstract": "Western blotting is a powerful and widely used method, but limitations in detection sensitivity and specificity, and dependence upon high quality antibodies to detect targeted proteins, are hurdles to overcome. The in situ proximity ligation assay, based on dual antibody recognition and powerful localized signal amplification, offers increased detection sensitivity and specificity, along with an ability to identify complex targets such as phosphorylated or interacting proteins. Here we have applied the in situ proximity ligation assay mechanism in Western blotting. This combination allowed the use of isothermal rolling circle amplification of DNA molecules formed in target-specific ligation reaction, for 16-fold or greater increase in detection sensitivity. The increased specificity because of dual antibody recognition ensured highly selective assays, detecting the specific band when combinations of two cross-reactive antitubulin antibodies were used (i.e. both producing distinct nonspecific bands in traditional Western blotting). We also demonstrated detection of phosphorylated platelet-derived growth factor receptor β by proximity ligation with one antibody directed against the receptor and another directed against the phosphorylated tyrosine residue. This avoided the need for stripping and re-probing the membrane or aligning two separate traditional blots. We demonstrate that the high-performance in situ proximity ligation-based Western blotting described herein is compatible with detection via enhanced chemiluminescence and fluorescence detection systems, and can thus be readily employed in any laboratory.",
    "sections": [
        {
            "title": "EXPERIMENTAL PROCEDURES",
            "paragraphs": [
                "PLA Probes-Duolink ® II PLA probes (OLINK Bioscience), composed of secondary antirabbit, antimouse and antichicken IgG antibodies conjugated with the oligonucleotides 5Ј-AAA AAA AAA ATA TGA CAG AAC TA GAC ACT CTT and 5Ј -AAA AAA AAA AGA CGC TAA TAG TTA AGA CGC TTU UU, respectively, were used for PLA WB detection.",
                "Antibodies and Their Specificities-The following antibodies were used for both traditional WB and PLA WB: Polyclonal rabbit antihuman transferrin antibody (Dako) specific for human transferrin, mouse FIG. 1. The probing steps of single-and dual-recognition PLA WB. Protein samples are first separated by SDS-PAGE and transferred to a PVDF membrane. After blocking, the blotted membrane is incubated with primary antibodies to probe target proteins, as in a standard two-step WB protocol. Instead of adding a secondary antibody with a detectable function, a pair of PLA probes are then added. These two reagents are composed of species-specific anti-Ig secondary antibodies conjugated with oligonucleotides of two different sequences. Both PLA probes can recognize one protein in reactions depending on target recognition by single primary antibodies (A) or the secondary reagents can be used to bind two primary antibodies directed against different epitopes (B) and against post-translational modifications (C) in reactions dependent on dual recognition of target molecules. Only when both PLA probes bind in close proximity to each other can a circular DNA strand be formed by ligation of the two added oligonucleotides (yellow and black) using a DNA ligase (step 2). The circularized oligonucleotide template formed by ligation triggers isothermal RCA from the 3Ј end of an oligonucleotide on one of the PLA probes, giving rise to a long single stranded DNA concatemer containing around 1000 complements of the DNA circle (step 3). Hybridization of HRP-or fluorophore-labeled detection probes to the concatemers results in dramatically amplified ECL or fluorescence signals specific for the target protein (step 4).",
                "anti-␤-tubulin (Sigma, T4026) specific for all five isoforms of ␤-tubulin (␤1-␤5), and rabbit antiPDGFR␤ (28E1) mAb (Cell Signaling, Danvers, MA; #3169) specific for endogenous PDGFR␤ were applied to detect human transferrin, ␤-tubulin, and PDGFR␤, respectively. Two pairs of antibodies were used to detect phosphorylated PDGFR␤: Mouse antiphospho-PDGFR␤ (Tyr751) (88H8) (Cell Signaling, #3166), specific for PDGFR␤ phosphorylated at tyrosine 751, was paired with rabbit anti-PDGFR␤ (28E1), and mouse anti-PDGFR␤ (2B3) mAb (Cell Signaling, #3175) specific for endogenous PDGFR␤, was paired with rabbit antiphospho-PDGFR ␣/␤ (C43E9) mAb (Cell Signaling, #3170) specific for PDGFR␣ phosphorylated on Tyr849 and PDGFR␤ phosphorylated on Tyr857 to detect PDGFR␤ phosphorylation. Finally, polyclonal rabbit antitubulin whole antiserum (Sigma, T3526) targeting tubulin, was paired with mouse anti-␤-tubulin, or polyclonal chicken anti-TUBB2A (Sigma, GW21263) specific for tubulin on beta polypeptide, to specifically detect human ␤-tubulin.",
                "Preparation of BJ hTert Cell Lysate-An aliquot of 10 6 human foreskin fibroblast BJ hTert cells were seeded on a 10-cm dish and grown in Dulbecco's Modified Eagle Medium/F-12 Ham's nutrient (Sigma) 1:1 mix containing 10% fetal calf serum, 50 units/ml penicillin, 50 g/ml streptomycin and 1 mM L-glutamine, for 2 days until the cells reached about 80% confluence. After starvation overnight in the Dulbecco's Modified Eagle Medium/F-12 medium containing 0.5% fetal calf serum, cells were kept on ice for about 10 min and subsequently incubated with or without human platelet-derived growth factor (PDGF) BB (PeproTech, Rocky Hill, NJ; 100 ng/ml working concentration) on ice for 1 h, gentle shaking. Cells were washed once with 2 ml ice cold PBS buffer, then lysed for 5 min on ice by adding 700 l cold cell lysis buffer (150 mM NaCl, 10 mM Tris, 0.5% Nonidet P-40, 1% Triton X-100, 1 mM EDTA, 1 mM EGTA, pH 7.4) per 10-cm dish followed by detaching the cells with a rubber policeman. To protect cellular proteins against activities of protease and phosphatase, one tablet of Complete Mini and PhosSTOP (Roche) was freshly added to 10 ml lysis buffer before use. The cell lysate was collected in an Eppendorf tube and centrifuged at 13,000 ϫ g for 8 min at 4 °C, and the supernatant was transferred to a new tube. The total protein concentration was determined to be 62 g (1.7 ϫ 10 6 cells)/100 l by using BCA protein assay kit (Pierce, Waltham, MA) and the cell lysate was stored at Ϫ20 °C until use."
            ],
            "subsections": [
                {
                    "title": "SDS-PAGE Electrophoresis and Membrane",
                    "paragraphs": [
                        "Transfer-A twofold dilution series of transferrin human Plasma (Calbiochem, San Diego, CA®) ranging from 2.5 ng to 0.08 pg was loaded on Novex® 12% Tris-glycine precast gel (Invitrogen) and electrophoresis was run at 120 V for 2 h with miniVE Vertical Electrophoresis system (GE Healthcare). ECL Plex™ Rainbow™ marker (GE Healthcare) was used to monitor the size-separated proteins. After electrophoresis, cellular proteins were wet transferred onto Hybond-P™ PVDF membrane (GE Healthcare) at 25 V for 2.5 h at 4 °C. The blotted membrane, containing proteins of interest, was cut into 2 ϫ 5 cm pieces.",
                        "Dilution series of lysate from BJ hTert cells ranging from 1500 to 10 5 cells, or from PDGF-induced CCD-1064sk cells sc-2264 (Santa Cruz Biotechnology, Santa Cruz, CA) ranging from 0.12 to 4 g of total cellular protein, were loaded per lane on a Criterion™ Tris-HCl pre-cast gel (Bio-Rad, Hemel Hempstead, UK; 7.5% polyacrylamide gel, 26-well) and subjected to gel electrophoresis (170 V, 1 h). PageRuler™ Prestained Protein Ladder (Fermentas, Hanover, MD) was used to monitor the size-separated proteins. After electrophoresis, cellular proteins were wet transferred onto Hybond-LFP™ PVDF membrane (GE Healthcare) at 100 V for 45 min. The blotted membrane, containing proteins of interest, was cut into pieces of 1 ϫ 4 cm.",
                        "Traditional WB Detection of Transferrin-The blotted and pre-cut membranes were blocked with 3% bovine serum albumin (BSA) (w/v), 0.1% Tween 20 in TBS buffer, 1 h with gentle orbital rotation at room temperature (RT). The membranes were then incubated with a pri-mary rabbit antihuman transferrin antibody (1:750 dilution) in Trisbuffered saline/Tween 20 (TBST) buffer overnight with gentle orbital rotation at 4 °C. After two brief rinses and 5 ϫ 5 min washes in TBST buffer, the membranes were incubated with ECL TM HRP-conjugated antirabbit IgG secondary antibody from donkey (GE Healthcare, diluted 1:30 000) for 1 h at RT with gentle rotation. The membranes were briefly rinsed twice and then washed 5 ϫ 5 min in TBST. Finally, the membrane was immersed in TBS buffer for 2 min before ECL detection using ECL Plus™ reagent (GE Healthcare) according to the manufacturer's instruction.",
                        "Traditional WB Detection of ␤-Tubulin and Platelet-derived Growth Factor Receptor ␤ (PDGFR␤)-The blotted and precut membranes were blocked with 3% BSA (w/v), 0.1% Tween 20 in TBS buffer for 1 h at RT with shaking. Next, the membranes were incubated with primary antibodies diluted in TBS with 1% BSA (w/v), 0.1% Tween 20 in a 5 ml plastic tube chamber with gentle orbital rotation, overnight at 4 °C. Mouse anti-␤-tubulin and rabbit anti-PDGFR␤ (28E1) were both diluted 1:2000 before incubation with the membrane. Rabbit antitubulin (1:200 dilution) and chicken anti-TUBB2A antibodies (1:3000 dilution) were used for detection specificity study of ␤-tubulin. After primary antibody probing, the membranes were rinsed once and washed with TBST (TBS with 0.1% Tween 20) for 3 ϫ 9 min, gently rocking at RT. Horse radish peroxidase (HRP) (Jackson Immuno-Research, diluted 1:50 000) or ECL Plex Cy™ 5 (GE Healthcare, diluted 1:2500) conjugated antimouse, antirabbit, or antichicken IgG secondary antibodies were incubated with the membrane for 1 h with gentle rotation at RT. After rinsing once and washing 3 ϫ 9 min with TBST, the probed membrane was immersed in TBS buffer for 2 min before detection. ECL detection using ECL Plus reagent (GE Healthcare) was performed according to the manufacturer's instruction. Before fluorescence detection the membrane was dried overnight at RT or for 1 h at 37 °C protected from light.",
                        "Traditional WB Detection of Phosphorylated PDGFR␤-Two sets of primary antibodies were used for detection of phosphorylated PDGFR␤. Cell lysates from control and stimulated BJ hTert cells (5 ϫ 10 5 cells/well) and PDGF-induced lysate of CCD-1064sk (1.9 g/well) were applied to WB and assayed either by traditional WB or dual recognition PLA WB (Fig. 1C) with ECL readout. Rabbit anti-PDGFR␤ (28E1) (1:2000 dilution) and mouse antiphospho-PDGFR␤ (Tyr751) (88H8) (1:1300 dilution) antibodies were paired to identify phosphorylated PDGFR␤ in BJ hTert cell lysates. Mouse anti-PDGFR␤ (2B3) mAb (1:850 dilution) and rabbit antiphospho-PDGFR ␣/␤ (C43E9) mAb (1:1000 dilution) antibodies were used to detect phosphorylation of specific receptor (PDGFR␤) in lysates from CCD-1064sk cells. For traditional WB detection, membranes were probed separately either with rabbit or mouse anti-PDGFR␤ antibodies overnight at 4 °C and the corresponding antispecies IgG secondary antibodies (1 h at RT) to detect the presence of PDGFR␤. Alternatively they were treated with mouse antiphospho-PDGFR␤ and rabbit antiphospho-PDGFR ␣/␤ (C43E9) antibodies overnight at 4 °C and the secondary antispecies IgG antibodies for 1 h at RT to detect the corresponding phosphorylated tyrosine residues.",
                        "PLA WB Assay-The general procedure for PLA WB is described in Fig. 1. The blotted membrane was blocked with PLA membrane blocking buffer (3% BSA (w/v), 0.1% Tween 20, 100 g/ml salmon sperm DNA in TBS buffer) for 1 h with gentle orbital rotation at RT. The membrane was then incubated with the same primary antibody dilution as in the traditional WB protocol described above. All the following reactions were performed in a 5-ml plastic tube with gentle orbital rotation and TBST buffer was used for washes. After rinsing once and washing 3 ϫ 9 min, a pair of PLA probes were diluted in PLA buffer (0.5 mg/ml BSA, 5 g/ml salmon sperm DNA, 5 mM EDTA, 0.05% Tween 20 in TBS buffer) to a final concentration of 0.2 g/ml and incubated with the membrane for 1 h, with gentle rotation at RT. The PLA probes are a pair of antispecies antibodies with attached DNA strands, either specific for primary antibodies from the same species (for recognition of individual bound antibodies) or for those from two different species (for recognition of pairs of primary antibodies).",
                        "After a brief rinse and washing 2 ϫ 9 min, 10 nM each of two oligonucleotides (5Ј phosphate-CTA TTA GCG TCC AGT GAA TGC GAG TCC GTC TAA GAG AGT AGT ACA GCA GCC GTC AAG AGT GTC TA and 5Ј phosphate-GTT CTG TCA TAT TTA AGC GTC TTA A; Integrated DNA Technologies, Coralville, IA) were added and allowed to hybridize to the bound PLA probes. The added oligonucleotide pairs were ligated to form circular DNA strands, using T4 DNA ligase (Fermentas, 0.05 U/l) for 40 min at 37 °C in oligonucleotide hybridization-ligation buffer (200 mM NaCl, 10 mM Tris-Ac, 10 mM MgAc, 50 mM KAc, 0.25 mg/ml BSA, 0.05% Tween 20, 0.5 mM ATP). The membranes were rinsed briefly and washed 2 ϫ 6 min before the RCA step where 0.05 U/l Phi29 polymerase (Fermentas) in RCA buffer (50 mM Tris-HCl, 10 mM MgCl 2 , 10 mM (NH 4 ) 2 SO 4 , 0.16 mM each of four dNTPs, 0.25 mg/ml BSA, 0.05% Tween 20, pH 7.5) was added for 1 h at 37 °C. After two brief rinses, HRP (5 nM, Biomers) or Cy5 (15 nM, Integrated DNA Technologies) conjugated detection probe (5Ј AAA AAA AAA CAG TGA ATG CGA GTC CGT CT) in detection buffer (2ϫSSC, 0.5 mg/ml BSA, 2 g/ml salmon sperm DNA, 5% formamide, 0.05% Tween 20) was applied to hybridize to the RCA products for 30 min at 37 °C. The membranes were rinsed twice and washed 3 ϫ 9 min, followed by a final rinse in TBS buffer to remove Tween 20 before detection.",
                        "PLA WB Detection of Transferrin, ␤-Tubulin and PDGFR␤-The PLA WB assay for detection of individual bound primary antibodies was applied to probe the precut membranes blotted with the dilution series of purified human transferrin and cell lysates using single primary antibodies. Binding of these antibodies were revealed by adding a pair of the corresponding PLA probes directed against immunoglobulin of the species of the primary antibodies. The DNA strands attached to the secondary antibodies guided the formation of an amplifiable DNA circle, and this was followed by RCA as described in the PLA WB assay.",
                        "PLA WB Detection of Phosphorylated PDGFR␤-The dual recognition PLA WB assay was performed as described above with the use of the same sets of antibodies applied in traditional WB. The primary antibody pair was incubated with the probing membrane, overnight at 4 °C. After washing, bound primary antibodies were detected by adding the corresponding antimouse and antirabbit PLA probes, followed by oligonucleotide ligation and RCA as described in the PLA WB assay.",
                        "PLA WB Specific Detection of ␤-Tubulin-Two pairs of antitubulin antibodies, i.e. rabbit antitubulin (1:200 dilution) and mouse anti-␤tubulin or rabbit antitubulin and chicken anti-TUBB2A antibodies (1:3000 dilution), were used for specific detection of ␤-tubulin. The same dual-recognition PLA WB detection (Fig. 1B) procedures as described above were followed.",
                        "Detection and Image Analysis-ECL signals were captured by exposing the membrane to Hyperfilm™ (GE Healthcare) and digitalized by using a CanoScan LiDE 200 scanner, or by using a CCD camera (ImageQuant LAS 4000 mini, GE Healthcare). The integrated signal intensities (pixel counts) of the target protein bands were measured using the software Adobe Photoshop CS4 or ImageQuant™ TL image analysis software (GE Healthcare).",
                        "Fluorescence signals were captured by employing a Typhoon™ FLA 9000 imager (GE Healthcare) to scan the probed membranes with the PMT setting 450 V. ImageQuant TL image analysis software was used to quantify the integrated signal intensities of the target bands."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "RESULTS",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Signal Amplification and Detection",
                    "paragraphs": [
                        "Sensitivity-To determine if in situ PLA can provide enhanced sensitivity in WB, we compared PLA WB and traditional WB in studies of transferrin, ␤-tubulin, PDGFR␤, and phosphorylated PDGFR␤, using lysates from PDGF-BB stimulated human fibroblast BJ hTert cells and readout via ECL. A 2-fold dilution series of transferrin from 2.5 ng to 0.08 pg was analyzed using the CCD camera and the integrated signal intensities were quantified using the ImageQuant TL image analysis software (Fig. 2). After the sequential exposures from 10 s to 2 min, detection limits of 10 pg and 5 pg transferrin, respectively, were reached for traditional WB (Fig. 2A). To avoid signal saturation, only a 10 s exposure was used for PLA WB to detect the full dilution series. With this shorter exposure time, a detection limit of as little as 0.08 pg transferrin was reached, corresponding to around 60-fold increase in sensitivity over traditional WB (Fig. 2B). The dynamic range was similar for both PLA WB and traditional WB and was close to 2.4 orders of magnitude (Fig. 2C).",
                        "A fourfold dilution series of cell lysate was analyzed for ␤-tubulin using PLA WB with a single primary antibody, and ECL signals were captured by film exposure. Compared with traditional WB detection an ϳ8 -21-fold increase in signal intensity was achieved that enabled PLA WB to detect two further serially diluted target bands, corresponding to a 16fold increase in sensitivity (Fig. 3A). The signal intensity for PLA WB resulted in saturation for the highest protein concentration with 1 min film exposure. This suggested that the true signal amplification can be much larger. Similar results were obtained for PDGFR␤ (Fig. 3B). The PLA WB signal was 25-fold stronger when an amount of lysate corresponding to 10 5 cells was applied and three further serial dilutions were detectable, representing a 64-fold increase in sensitivity compared with traditional WB. For detection of PDGFR␤ phosphorylated on tyrosine751, the PLA WB provided an ϳ70-fold signal increase (Fig. 3C). Only a weak signal was visible for samples containing 10 5 cells by traditional WB, PLA WB enabled detection of the phosphorylated receptor from as little as 6000 cells using PLA WB with a pair of primary antibodies.",
                        "We investigated fluorescence PLA WB using a CyDye labeled detection probe for visualizing RCA products, followed by detection with a fluorescence Imager as an alternative to ECL readout. A 2-fold dilution series from 3.8 g to 0.12 g total cellular protein was prepared from a lysate of PDGF-BB induced sc-2264 cells. We compared detection of ␤-tubulin using either traditional fluorescence WB with a Cy5-labeled antimouse secondary antibody and single recognition PLA WB using a Cy5-labeled oligonucleotide for detection of RCA products. Fig. 4 shows the dramatic increases of signals using PLA WB, ranging from 25-to 50-fold, for all sample concentrations compared with stan-dard WB detection. The relative sensitivity was greater for the lower sample concentrations.",
                        "Detection Specificity-In order to determine if also the specificity of detection can be improved by using PLA WB assays where two primary antibodies rather than one must bind the target molecules, human fibroblast BJ hTert cell lysates were subjected to SDS-PAGE and WB. ␤-tubulin was targeted using three different probing approaches, all visualized via ECL detection (Fig. 5). Traditional WB using rabbit antitubulin primary antibodies and HRP-conjugated secondary antibodies resulted in detection of several unspecific protein bands, in addition to the expected band at a molecular weight close to 55 kDa (Fig. 5A, top). Another, less unspecific mouse anti-␤-tubulin primary antibody resulted in a single weak unspecific extra band corresponding to a molecular weight lower than 55 kDa, in addition to the specific ␤-tubulin band (Fig. 5A,middle). In this approach two secondary antimouse IgG PLA probes were used to reveal the binding by mouse anti-␤-tubulin antibodies via PLA WB for single primary antibodies. By contrast, in a dual recognition PLA WB experiment, simultaneous binding by both primary antibodies was required for detection via secondary antirabbit IgG and antimouse IgG antibodies with attached DNA strands as PLA probes. Under these conditions only the specific ␤-tubulin band was detected and no non-overlapping cross reactive bands appeared (Fig. 5A,bottom). The experiment in Fig. 5B produced similar results using unspecific chicken and rabbit antitubulin in traditional WB (Fig. 5B, top and middle), compared with the dual recognition PLA WB where both primary antibodies must recognize the target (Fig. 5B, bottom). The dual recognition PLA WB produced one specific ␤-tubulin signal, and thus avoided detection of the unspecific bands that appeared when each of the primary antibodies was used individually. These results illustrate the improved detection specificity resulting from dual recognition PLA using two relatively unspecific primary antibodies, as the PLA WB requires that both primary antibodies bind to the same or closely proximal target molecules in order to produce a signal.",
                        "Detection of Post-translational Modifications-The requirement for dual recognition by PLA can also be of value to investigate more complex targets, e.g. interacting proteins or post-translational modifications. In order to investigate this point, lysates from human fibroblast control cells or cells stimulated with PDGF-BB were subjected to WB. A pair of antibodies directed against PDGFR␤ and against the specific phosphorylation of tyrosine751 of the receptor were applied separately in traditional WB (Fig. 6A, top). In order to determine if the two antibodies bind to targets of the same approximate molecular weight, two parallel blots of the same sample need to be probed for ECL readout. Alternatively, the same blot can be investigated sequentially. Phosphorylation on ty-rosine751 of PDGFR␤ in the lysate from stimulated cells was detected as a weak signal by traditional WB after 1 min film exposure. Using dual recognition PLA WB, simultaneous probing with both primary antibodies from different species produced one single band, indicating the presence of the tyrosine751-phosphorylated receptor (Fig. 6A,bottom). With only 10 s film exposure, the resulting PLA signals were already considerably stronger than the corresponding signals produced by traditional WB. In the absence of stimulation no PDGFR␤ phosphorylation was observed and accordingly no clear signal was detected for control cells (Fig. 6A, bottom). PLA WB thus allows confident detection of a post-translationally modified protein in a single assay, whereas two separate or sequential probings are commonly undertaken in traditional WB. Also, PLA WB reveals molecular proximity between the binding sites for the two primary antibodies, rather than the more poorly resolved comigration of proteins on gels. Another example of detection of PDGF receptor modification is shown in Fig. 6B using lysates from PDGF-induced CCD-1064sk cells. This time another pair of primary antibodies was used for dual recognition PLA WB to specifically detect tyrosine phosphorylation of PDGFR␤. A mouse anti-PDGFR␤ (2B3) targeted PDGFR␤ and a rabbit antiphospho-PDGFR ␣/␤ (C43E9) was specific for Tyr849 phosphorylation on PDGFR␣ and for Tyr857 phosphorylation on PDGFR␤. Using traditional WB with 10 min exposure to film, separate probings with these antibodies gave rise to several unspecific bands in addition to the expected bands (Fig. 6B, top and middle). In dual recognition PLA WB assay, only a specific band with the approximate molecular weight of 190 kDa was detected after 1 min film exposure indicating the phosphorylation on PDGFR␤ (Fig. 6B, bottom)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "DISCUSSION",
            "paragraphs": [
                "The requirement for dual antibody recognition of proximal epitopes on the same or interacting proteins in order to elicit a locally amplified detection signal are characteristics of in situ PLA that provide enhanced detection specificity and sensitivity. Here we demonstrate that this assay can be applied to WB in order to visualize proteins that have been separated by gel electrophoresis and transferred to a membrane. Com- were interrogated by both traditional WB and PLA WB with ECL readout. A, The signal patterns were captured by film and compared by applying traditional WB detection using rabbit antitubulin primary antibody and secondary antirabbit HRP with 1 min exposure (top image), PLA WB with a single primary antibody mouse anti-␤-tubulin and secondary antimouse IgG PLA probes with 10 s exposure (middle image), and dual recognition PLA WB combining both the rabbit and mouse antitubulin primary antibodies, recognized by the corresponding secondary antirabbit and antimouse PLA probes after 10 s exposure (bottom image). B, ␤-tubulin was also investigated in blots from the same lysate by traditional WB using chicken antitubulin antibody (top image), rabbit antitubulin antibody (middle image)), or both primary antibodies and the corresponding species-specific secondary PLA probes for PLA WB (bottom image). The ECL signals were captured by film with 1 min exposure for traditional WB and 10 s for PLA WB. pared with reaction conditions for in situ PLA detection for microscopy, reagent concentrations in general must be lowered, and robust reaction mixing must be applied for detection of proteins on the highly adsorptive membranes in order to achieve optimal signal-to-noise ratios.",
                "We show herein that PLA WB provides improved detection sensitivity compared with traditional WB, because of the specific recognition and the potent signal amplification via RCA. This offers a valuable opportunity to investigate molecules present in very few copies per cell, or in only a minority of cells within a heterogeneous population, and the improved sensitivity can also permit analysis of small amounts of sample, reducing consumption of precious samples.",
                "It is well known that so-called sandwich immunoreactions, where antigens are detected via binding by two antibodies, generally provide greater specificity of detection compared with single binder assays. This dependence on dual binding serves to discriminate against cross reactive recognition that is not shared between two antibodies. In traditional WB, detection depends on recognition by single antibodies, whereas the molecular weight of the targeted protein provides an additional criterion for identification. Frequently, nonspecific bands are observed in WB. In such cases PLA WB can facilitate identification of the correct protein. For the pairs of antibodies tested herein PLA WB eliminated the nonspecific bands and the assay may thus also enable the use of antibodies that would give rise to cross reactivity in traditional WB. This feature of PLA WB can help reduce dependence on high-quality antibodies and molecular weight confirmation in WB analysis. However, any irrelevant protein detected by both antibodies will still appear in PLA WB. FIG. 6. Detection of phosphorylated PDGFR␤ using traditional WB and PLA WB. Phosphorylated PDGFR␤ in the control and PDGF-BBstimulated lysates from 5 ϫ 10 5 human fibroblast BJ hTert cells was targeted by traditional WB or dual recognition PLA WB with ECL readout. A, For traditional WB detection the receptor and the phosphorylated tyrosine751 were separately targeted using primary rabbit anti-PDGFR␤ or mouse antiphospho-PDGFR␤ (Tyr751) antibodies, respectively, and the corresponding antispecies IgG secondary HRP-conjugated antibodies (top image). PLA WB was performed using a combination of the same two primary antibodies, followed by secondary antirabbit and antimouse PLA probes to detect the phosphorylated receptor (bottom image). The traditional and PLA WB signals were captured by film exposure of 1 min and 10 s, respectively. B, PDGFR␤ phosphorylation was also investigated using another pair of primary antibodies in lysate (1.9 g) from PDGF-BB stimulated CCD 1064sk cells using traditional WB, probing with two antibodies in separate reactions (top and middle image) and by dual recognition PLA WB using the two antibodies in a single reaction (bottom image). Readout was via ECL. Rabbit antiphosphor-PDGFR␣ (Tyr849)/PDGFR␤ (Tyr857) primary antibody was followed by a secondary antirabbit HRP (top image). Mouse anti-PDGFR␤ primary antibody was revealed by a secondary antimouse HRP (middle image). A combination of these two primary antibodies were applied with secondary antirabbit and antimouse PLA probes (bottom image). The traditional and PLA WB signals were captured by the film exposure for 10 and 1 min, respectively. So far, in situ PLA has mainly been used to interrogate more complex targets such as protein interactions and post-translational modification of proteins, but we illustrate here that the technique brings a valuable increase of detection specificity to localized protein detection via the requirement for dual recognition. The assay could also be used to distinguish closely similar proteins, such as splice variants that share some but not all epitopes. We demonstrate herein that PLA WB facilitates detection of post-translationally modified proteins, exemplified by the detection of phosphorylated PDGFR␤. The assay could also be used to demonstrate protein interactions such as receptor dimerization and aggregation products using native gel electrophoresis.",
                "Compared with traditional WB, PLA WB requires more reaction steps and about 2 more hours. Work is in progress to simplify the process.",
                "In conclusion, the PLA WB method presented herein provides several distinct advantages compared with traditional WB in terms of sensitivity, specificity, and the ability to distinguish closely similar protein variants. By visualizing detected proteins in blots as locally amplified DNA sequences it will also be possible to use the coding potential of DNA to detect multiple different targets on the same blot in one assay by simultaneous or sequential hybridization with detection probes specific for distinct RCA products."
            ],
            "subsections": []
        }
    ]
}