{
    "id": "https://semopenalex.org/work/W4205616060",
    "authors": [
        "Yuanxun Ethan Wang",
        "Foad Fereidoony",
        "Lap K. Yeung",
        "Zhi Yao",
        "Wei Gu",
        "Kevin Luong"
    ],
    "title": "Radio Frequency Precession Modulation Based Magnetic Field Sensors",
    "date": "2022-01-01",
    "abstract": "High sensitivity is often the foremost characteristic for magnetic field sensors; however, the most sensitive systems tend to be attributed with being any combination of large in size, high in power consumption, complex in design, or exorbitant in cost. This fact not only limits accessibility to the technology afforded by high sensitivity sensing, but it also restricts the extent to which potential applications of magnetic field sensing may be realized. Herein we propose a concept for sensor operation that can achieve sensitivities competitive with those of modern magnetic field sensors while simultaneously maintaining small size, low power consumption, simplicity in design, and low cost. This is accomplished through employment of the nonlinear precession dynamics of electron spins to attain parametric amplification of a magnetic field. A preliminary experimental implementation of the proposed concept establishes its feasibility and is already able to demonstrate benefits over existing approaches to sensing. The implementation exhibits a sensitivity of 23.2 pT/Hz1/2 with a volume of 0.0564 mm3 and a power consumption of −40.96 dBm.",
    "sections": [
        {
            "title": "I. INTRODUCTION",
            "paragraphs": [
                "Magnetic field sensors have been one of the cornerstone technologies in advancing the progress of research and development in many areas. From geophysics to biomedicine to communications [1], the collective domain over which magnetic field sensing and detection spans is incredibly broad and the specific applications for its use are extremely diverse. There consequently has developed an almost equally diverse range of approaches to magnetic field sensor design in terms of foundational principles of operation. For example, super quantum interference device (SQUID) sensors operate based on the quantization of magnetic flux, optically pumped sensors operate based on atomic magneto-optic effects, induction sensors operate based on Faraday's law of induction, and magnetic tunnel junction sensors operate based on polarization dependent electron tunneling [1].",
                "One defining characteristic of a magnetic field sensor is sensitivity-the lowest field value that can be detected above the noise floor in a unit of output bandwidth [2]. A higher",
                "The associate editor coordinating the review of this manuscript and approving it for publication was Hiram Ponce . sensitivity, or the ability to detect weaker fields, is crucial in modern applications where working with weak fields is the overwhelming norm. Sensitivity is strongly dependent on the principle of operation of a sensor; however, the fact that there are still so many sensor types used today clearly indicates that there are other important characteristics that must also be considered. Specifically, it tends to be the case that principles yielding higher sensitivity have tradeoffs with regards to sensor size or power consumption that limit practicality of implementation.",
                "The tradeoff between sensitivity and practicality is better illustrated by examining various principles of operation. SQUID magnetic field sensors are widely recognized to be the most sensitive devices, able to achieve sensitivities better than 1 fT/Hz 1/2 ; however, they require cryogenic cooling which leads to a system that is large and costly in terms of construction and power consumption [3]. Optically pumped sensors can be competitive with SQUIDs in sensitivity, but are afflicted by the requirement of optically pumped, heated atomic vapor cells which contribute again to a large and costly system that is complex to design and manufacture [1], [4]. In [5], an optically pumped sensor achieves sub-pT/Hz 1/2  sensitivities in the kHz to MHz frequency range but requires a sensor volume of 57 mm 3 and power consumption on the order of tens of watts. Inductive sensors boast zero power consumption while also being able to attain sensitivities better than 1 fT/Hz 1/2 ; however, reaching these sensitivities generally requires the device to be prohibitively large or heavy [6]. In [7], an inductive sensor achieves sub-fT/Hz 1/2 sensitivity in the hundreds of Hz to hundreds of kHz frequency range but requires a sensor area of more than 24 m 2 . Magnetic tunnel junctions can be made extremely small; however, they consume moderate amounts of power and achieve moderate sensitivities. In [8], the MgO based magnetic tunnel junction sensor was constructed with a sensor area of just 676 um 2 , but there is only 97 pT/Hz 1/2 sensitivity at 10Hz as well as a power consumption of around -7dBm.",
                "In this work, we introduce an approach that exploits nonlinear dynamics in magnetic materials to realize sensitive magnetic field sensors that also maintain a high degree of practicality. Differing from fluxgate sensors, which rely on magnetization curve nonlinearity and the periodic transition of a material between saturated and unsaturated states [9], our sensors rely on nonlinear dynamics exhibited by electron spin precessions in material maintained in a state of constant saturation. Consequently, our sensors are not subject to the Barkhausen noise that limits fluxgate sensor sensitivity [9]. The sensors of [10] and [11] likewise rely on the nonlinear dynamics of saturated magnetic materials; however, whereas the sensor in [10] is based on magnetostatic wave bandgaps and the sensor in [11] is based on resonance induced phase shifts, our sensor is based on parametric amplification at radio frequencies (RF) through a method we call RF precession modulation (RPM). A prototype design exhibits a sensitivity of 23 pT/Hz 1/2 that remains relatively flat throughout the low frequency (LF) and very low frequency (VLF) bands with a sensor volume of only 0.053 mm 3 and a power consumption of just -41 dBm. Our sensor is suitable for applications that include underground and underwater communications [12], space plasma research [13], or low-cost magnetic resonance imaging [14]. The following sections will first cover the basic principles of RPM and derive analytical expressions describing RPM sensors. The advantages of our sensor over existing sensors are then discussed along with an approach for practical implementation. Finally, the setup and results are presented for both simulations and the experimental prototype."
            ],
            "subsections": []
        },
        {
            "title": "II. OPERATING PRINCIPLE",
            "paragraphs": [
                "RPM sensors are similar to optically pumped sensors in that both depend on electron spin precession for operation. RPM sensors, however, rectify many of the characteristics that make optically pumped sensors a poor choice for use in many applications. Most significantly, optically pumped sensors use spins from atomic vapors [1], [15] and require heated glass containers that ultimately limit how much size and power consumption of the sensor can be reduced [4]. In contrast, RPM sensors use spins from insulating ferrimag- netic materials, or ferrites [16], [17]. The insulating nature, low magnetic loss at high frequencies, and decent saturation magnetization values [18] of ferrites make them ideal for maintaining high sensitivity with a small size and power consumption. Ferrites have been used extensively in high frequency electronics [16], [17] with now well-established processing methods [18] that allow the material to be produced relatively inexpensively. While some of these same attributes have motivated the use of ferrites for inductive sensors [19]- [23], these sensors do not rely on nonlinear spin precession dynamics like RPM sensors do.",
                "The spin dynamics of ferrites can be analyzed using micromagnetic theory [24], which describes the macroscopic spin dynamics using a continuum approximation [25], [26]. The theory is formulated in terms of spatially and temporally dependent material magnetization M and so the remainder of this work will be framed primarily in terms of magnetization as opposed to spin for the purposes of consistency. It is noted that either may be immediately determined based on knowledge of the other [24]. Applying micromagnetic theory, magnetization dynamics of ferrites are described by the Landau-Lifshitz-Gilbert (LLG) equation [27] ",
                "where µ 0 is the permeability of free space, γ is the gyromagnetic ratio, M s = |M| is the saturation magnetization, α is the Gilbert damping coefficient representing magnetic loss, and H e is the effective magnetic field encompassing the effects of magnetic fields as well as various other physics on the magnetization.",
                "A ferrite is biased by applying a constant, uniform magnetic field H 0 sufficiently large such that M is uniform and aligned with the field. In this case, the effective field will be dominated by the bias field H e ≈ H 0 . The LLG equation (1) then indicates that a perturbation of M from its aligned state will cause it to precess about H 0 , as visualized in Fig. 1a and b, at the angular resonance frequency",
                "where H 0 = |H 0 |, eventually spiraling back to alignment by virtue of magnetic loss. Equation ( 2) is the core of optically pumped sensor operation where it is evident that, in determining ω 0 in some way, an unknown H 0 can be directly computed [15]. This equation also suggests that a bias field with a time varying magnitude H 0 + h s (t) will yield a time varying angular precession frequency",
                "This nonlinear behavior, visualized in Fig. 1c, is the core of RPM sensor operation. A magnetic field of interest h s (t) polarized along the bias field of a ferrite will manifest as a magnetization precession frequency modulation. RPM sensors detect the magnetization inductively, from which h s (t) can be characterized."
            ],
            "subsections": []
        },
        {
            "title": "III. DEVELOPMENT OF THEORY",
            "paragraphs": [
                "A more detailed theoretical analysis reveals how h s (t) is infused in the magnetization dynamics of a ferrite and allows the performance of RPM sensors to be quantified. We first continue under the same assumption made previously that the bias field dominates the effective field. We then consider the case in which other physics, specifically the demagnetization field, contribute significantly to the effective field."
            ],
            "subsections": [
                {
                    "title": "A. DOMINANT BIAS FIELD",
                    "paragraphs": [
                        "A biased ferrite is visualized in Fig. 2a. To maintain precession amidst the effects of magnetic loss, a time harmonic pumping magnetic field H p at the angular resonance frequency ω 0 is needed. A component of magnetization transverse to the bias field M t can then be written based on (3) as",
                        "where θ is the angle of precession, τ is the precession time constant [28] defined by τ = 1 αω 0 = 2Q ω 0 , and Q is the quality factor of the resonance defined by Q = 1 2α. For a time-harmonic magnetic field of interest h s (t) = H s cos (ω s t + φ), (4) can be evaluated to yield",
                        "under the conditions of γ µ 0 H s τ 1 and ω s τ 1. Equation (5) indicates that the effect of h s (t) is to generate terms in the precession at the converted frequencies ω 0 ± ω s , also known as the sidebands. It further indicates that information about h s (t) can theoretically be extracted from either of these terms.",
                        "RPM sensors detect the magnetization term at a sideband frequency inductively and so they are readily compared with inductive sensors. For a simple inductive detector with N turns and area A equal to the cross-sectional area of the ferrite, the open circuit rms voltage V RPM for detection of one of the sidebands is found using Faraday's law [29] to be",
                        "assuming ω 0 ω s . The same detector used as an inductive sensor, visualized in Fig. 2b, would have an open circuit rms voltage V ind of",
                        "Taking the ratio of ( 6) to (7), the amplification achieved by RPM sensors over inductive sensors is quantified as",
                        "where H = 2αω 0 µ 0 γ = H 0 Q is the linewidth of the ferrite at the resonance frequency [28]. The angle θ in ( 8) is determined by the pumping power and magnetic loss of the ferrite. It is possible however to derive a metric independent of pumping power that allows RPM operation to be verified in both simulation and experiment. This metric is the amplitude ratio of the magnetization term at a sideband M RPM t to that at the resonance frequency M 0 t and is be found from ( 5) to be",
                        "using Q = ω 0 τ 2 as well as (2). Applying Faraday's law, this amplitude ratio can also be found from the open circuit rms voltages as",
                        "where V 0 corresponds to the magnetization term at the resonance frequency. The sensitivity of RPM sensors is no longer limited by Johnson's noise of the detecting coil assuming a sufficient FIGURE 3. Amplitude ratio comparison. The transverse magnetization amplitude ratio computed from micromagnetic simulation results is plotted with the red squares. The same ratio computed theoretically using ( 9) is plotted with the blue dashed line. level of amplification is achieved through (8). The sensitivity can thus be quantified recognizing that noise is dominated by ferrite damping noise. This noise can be modeled with a thermal resistor R and does not depend on the pumping power injected to maintain precession. A full circuit model for an RPM sensor is provided in Supplementary Figure 1. Sensitivity then corresponds to the rms field of interest H s √ 2 , where H s is such that",
                        "Here, k is the Boltzmann constant and T is temperature. Applying (10) to (11), an explicit expression for sensitivity can be derived as,",
                        "By convention, sensitivity is typically expressed in terms of the rms magnetic flux densities and so it will be denoted as δB s , given as",
                        "where P p = V 2 0 R is the pumping power consumed by the ferrite. It should be noted that the two sideband frequencies of (5) can be coherently combined with demodulation circuitry, resulting in an additional factor of 1 √ 2 in the sensitivity of (13)."
                    ],
                    "subsections": []
                },
                {
                    "title": "B. DEMAGNETIZATION EFFECTS",
                    "paragraphs": [
                        "Previously, the effective field H e was described as encompassing the effects of magnetic fields as well as various other physics on the magnetization. These other physics are represented with additive components to H e and many can be neglected for a biased ferrite. One component that may be significant however, is the demagnetization field. The demagnetization field accounts for the dipole-dipole interaction between spins and is dependent on the ferrite shape, size, and biasing [24]. Of particular interest in this work are ferrites with a thin film geometry, which lend themselves well to miniaturization and can be produced with high quality through mature processing methods [18]. For an RPM sensor employing a thin film ferrite biased in-plane, the demagnetization field is indeed significant, necessitating modifications to the above equations. Magnetization precession in this case approximately resembles a pendulum oscillation [32], as visualized in Fig. 1d, with a resonance frequency",
                        "With the addition of the same time-harmonic h s (t), |h s (t)| H 0 polarized along the bias field, a Taylor expansion can be used to express the time varying precession frequency as",
                        "The precession time constant τ and the quality factor Q are also modified by the demagnetization field, with τ = 2Q ω 0 and [28], [32],",
                        "Equation ( 15) can then be re-written as,",
                        "Starting with (17) instead of (3), the exact same procedure taken to derive (5)-( 13) can be applied to derive the analogous equations corresponding to an RPM sensor with a thin film ferrite. The open circuit rms voltage for detection of one of the sidebands is",
                        "The amplification, amplitude ratio, and single sideband sensitivity are found to be",
                        "where the linewidth is still defined as H = 2αω 0 µ 0 γ . Comparing ( 18)-( 20) to ( 6), ( 8) and ( 9), we can conclude that, for a given ferrite material, RPM sensor performance is independent of whether or not the demagnetization field is significant, even though the resonance frequency and quality factor are modified by the demagnetization. "
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "IV. ADVANTAGES OVER INDUCTIVE SENSORS",
            "paragraphs": [
                "As mentioned previously, the operation of RPM sensors naturally facilitates a comparison to inductive sensors. Against inductive sensors, including ferrite inductive sensors, RPM sensors have inherent advantages with regards to amplification, size, and sensitivity."
            ],
            "subsections": [
                {
                    "title": "A. AMPLIFICATION",
                    "paragraphs": [
                        "The amplification achieved by RPM sensors over inductive sensors is described by (8) and comes from two distinct phenomena. The first, corresponding to the product term M s sin (θ) H , is the magnetization coupling to the inductive detector. Greater amplification is achieved with a higher pumping power, a ferrite with a larger saturation magnetization, or a ferrite with a smaller linewidth. The second, corresponding to the product term ω 0 ω s , is the generation of magnetization terms at the sideband frequencies. Greater amplification is achieved with a larger resonance frequency or a smaller frequency for the field of interest. It is clear from Faraday's law why these two sources contribute to amplification. From another perspective, RPM can be viewed as a method of parametric amplification. The ferrite magnetization is the output of a resonant system with resonance frequency dependent on the biasing field H 0 . The pumping field H p harmonically drives the system and the field of interest h s (t) effectively varies the biasing field, causing the parametric amplification. It is noted that this amplification is made possible by the intrinsic nonlinear nature of ferrite magnetization dynamics and is not contingent upon any external circuitry.",
                        "To quantify attainable amplification values, a yttrium iron garnet (YIG) ferrite [23], [30] is considered. YIG is ubiquitous in high frequency electronics, and it is the ferrite material of choice in this work. The YIG is biased to have a resonance frequency of 1 GHz, at which the linewidth can be as narrow as 0.2 Oe [31], and the field of interest is taken to have a frequency in the VLF band of 10 kHz. The upper limit of amplification for the case of strong pumping with an angle θ of 90 • can then be computed from ( 8) to be upwards of 8e8. In practice, the amount of amplification is limited by the saturation effect of YIG due to the launching of spin waves [33]."
                    ],
                    "subsections": []
                },
                {
                    "title": "B. SIZE",
                    "paragraphs": [
                        "The size of the RPM sensor can be compared to that of an inductive sensor using (8) along with (6). It is seen that the size, quantified by A, can be smaller than that of the inductive sensor by up to the value of (8) while still maintaining amplification. For the ideal scenario used to quantify amplification with strong pumping and YIG biased to have a resonance frequency of 1 GHz, the RPM sensor can be eight orders of magnitude smaller than the inductive detector while still maintaining amplification."
                    ],
                    "subsections": []
                },
                {
                    "title": "C. SENSITIVITY",
                    "paragraphs": [
                        "For a sensitivity comparison, it is reiterated that amplification of RPM sensors is a consequence of the intrinsic nonlinear nature of ferrite magnetization dynamics and does not depend on external circuitry. The two sources of amplification occur in the ferrite prior to the inductive detection of magnetization and so the signal of interest is amplified whereas Johnson thermal noise and ferrite damping noise generated by the inductive detector are not. In contrast, an inductive sensor can achieve amplification only with the addition of an external amplifier that follows inductive detection, in which case both the signal of interest and noise generated by the inductive detector are amplified. This difference in where amplification occurs suggests that RPM sensors will have higher sensitivities as compared to inductive sensors. A theoretical analysis of the comparison is provided in Supplementary Note 1.",
                        "The sensitivity can be quantified again assuming a YIG ferrite with a resonance frequency of 1 GHz and linewidth of 0.2 Oe at 290 K. Equation (21) indicates that a pumping power of just -24 dBm will allow for sub-pT/Hz 1/2 sensitivity independent of the size of the sensor."
                    ],
                    "subsections": []
                },
                {
                    "title": "D. FERRITE INDUCTIVE SENSORS",
                    "paragraphs": [
                        "RPM sensors maintain their advantages when compared against ferrite inductive sensors [19], [20]. While the construction of ferrite inductive sensors, shown in Fig. 2c, is very similar that of RPM sensors, the operating principles are not. Ferrite inductive sensors do not use biased ferrites, rely on material nonlinearities, or pursue parametric amplification like RPM sensors do. Rather, they use the linear permeability of unbiased ferrites to magnify the magnetic flux coupling to the inductive detector. This allows for amplification prior to inductive detection; however, the amplification is typically quite low around a factor of 50 [19]. Further, due to their use of unbiased ferrites, ferrite inductive sensors are associated with magnetic losses that do not affect the RPM sensors. These losses include hysteresis loss [34], loss due to domain wall resonance [35], and loss due to thermally activated domain wall movements [36], all of which serve to increase noise and reduce sensitivity."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "V. SIMULATION",
            "paragraphs": [
                "The RPM concept was validated with micromagnetic simulations. The simulations were performed using the Object Oriented Micromagnetic Framework (OOMMF) [37], a micromagnetic simulator widely used and well recognized as the standard for accurate solutions [26]. A thin film YIG ferrite was modeled with dimensions 1 mm × 1 mm × 1 um and a Gilbert damping coefficient of 1e-3. The ferrite was biased in plane with a 70 Oe field H 0 , resulting in a resonance frequency of approximately 1 GHz. A time harmonic pumping field was applied at the resonance frequency with an amplitude of 0.035 Oe. This amplitude was an arbitrary small value chosen to ensure that the conditions under which (5) was derived were met. A time harmonic field of interest in the LF band was applied at 50kHz with various amplitudes H s . Again, the amplitudes are arbitrary small values chosen to ensure that the conditions under which (5) was derived were met.",
                "Time domain simulations up to 0.2 ms were performed for each H s considered. The transverse magnetization amplitudes M RPM t and M 0 t were extracted from the simulation results and their ratio was computed. This ratio was also computed theoretically using (20). A comparison of the ratio computed from the simulation results and that computed theoretically is provided in Fig. 3. Based on the agreement, it is clear that the micromagnetic simulations support the validity of RPM.  "
            ],
            "subsections": []
        },
        {
            "title": "VI. EXPERIMENT",
            "paragraphs": [
                "An RPM sensor was prototyped using available hardware and its characteristics were assessed in two experimental setups. The first setup measured the amplitude ratio M RPM t M 0 t and the second setup measured the sensitivity δB s . The measured results were found to agree well with theoretical predictions."
            ],
            "subsections": [
                {
                    "title": "A. HARDWARE",
                    "paragraphs": [
                        "The sensor employed an epitaxially grown YIG thin film ferrite, shown in Fig. 4a, of dimensions 3.76 mm × 5 mm × 3 um corresponding to a sensor volume of 0.0564 mm 3 . The YIG linewidth was around 0.5 Oe at 1 GHz, much inferior to its expected single-crystal value. The inductive detector for the sensor, also shown in Fig. 4a, was a single turn loop of dimensions 6 mm × 6 mm × 1 mm. This loop was constructed from a strip of copper soldered to traces fabricated on a 0.813mm thick Rogers 4003C board clad with 35 um thick copper. The traces, shown in Fig. 4b, tapered to a pair of feeding lines, where the width of each line was 0.1 mm and the gap between the lines was 0.4 mm. The feeding lines connected to a coaxial cable through an SMA interface. The biasing field for the sensor was produced with two neodymium permanent magnet  plates of dimensions 3 in × 3 in × 0.25 in that the sensor was placed in between. The field of interest was produced with a coil of area 3375 mm 2 constructed from 125 turns of 26 AWG copper wire. This coil and the permanent magnets can be seen in Fig. 4d. The pumping field for the sensor was produced with a single turn loop, shown in Fig. 4a, of area 95 mm 2 fabricated on a 0.813mm thick Rogers 4003C board clad with 35 um thick copper. The trace width for this loop as well as its feeding lines was 1 mm, and the lines connected to a coaxial cable through an SMA interface."
                    ],
                    "subsections": []
                },
                {
                    "title": "B. SETUP",
                    "paragraphs": [
                        "Aa schematic of the first experimental setup, used to measure the amplitude ratio M RPM t M 0 t , is provided in Fig. 4c and a photo of the setup is provided in Fig. 4d. This first setup involved a biasing field of 70 Oe, corresponding to a resonance frequency of approximately 1 GHz. The pumping loop was positioned adjacent and oriented coaxial to the inductive detector. It was driven at the resonance frequency to inject the sensor with a power of -49.96 dBm. The coil producing the field of interest was positioned 9.9 cm from the sensor and oriented with its axis perpendicular to the axis of the inductive detector. It was driven to produce fields with various amplitudes at various frequencies in the LF and VLF bands. It is noted that these fields are not perfectly uniform, contributing to a lower system quality factor and larger linewidth than if the fields were uniform. The sensor was connected directly to a signal analyzer.",
                        "The second experimental setup, used to measure the sensitivity δB s , is depicted schematically in Fig. 5. This setup resembles the first in the configuration of the sensor, biasing magnets, pumping loop, and coil producing the field of interest, with the exception that the coil is positioned 7.7 cm from the sensor. The direct connection of the sensor to a signal analyzer in the first setup however was not suitable for an assessment of sensitivity since noise would be dominated by the phase noise of the pumping field. Instead, this second setup coherently demodulates the sideband frequencies down to baseband using an Analog Devices ADL5380 evaluation board. The sensor was connected to the radio frequency port of the board via a 33 dB low noise amplifier (LNA). The pumping loop was driven by a function generator via a 2-way power splitter, with the other output of the splitter connecting to the local oscillator port of the evaluation board. The in-phase output of the board is connected to a signal analyzer via a 40 dB LNA, and the quadrature-phase output of the board is terminated with 50 Ohms. The biasing field remains at 70 Oe, corresponding to a resonance frequency of approximately 1 GHz. The pumping loop was driven at the resonance frequency to inject the sensor with a power of -40.96 dBm. The coil producing the field of interest was driven at various frequencies in the LF and VLF bands with a voltage of 0.45 mV across its terminals."
                    ],
                    "subsections": []
                },
                {
                    "title": "C. AMPLITUDE RATIO RESULTS",
                    "paragraphs": [
                        "The spectrum of power coupled to the sensor in the first setup is plotted in Fig. 6 for the cases of the coil producing the field of interest driven with voltages of 91 mV and 45 mV across its terminals at a frequency of 30 kHz. The amplitude ratio corresponding to Fig. 6 as well as that measured for other frequencies of the field of interest are presented in Table 1. Also presented in Table 1 are the theoretical amplitude ratios computed using (20). Appendix A details how this computation was performed.",
                        "From Fig. 6, the detection of sideband frequencies as well as the resonance frequency of precession is clear, demonstrating that RPM is achieved. It is also seen from this figure that doubling the driving voltage, and consequently doubling the amplitude of the field of interest [19], [20], doubles the amplitude ratio of (20) as expected. Table 1 confirms this behavior for several different frequencies and further shows agreement between the measured and theoretical amplitude ratio values."
                    ],
                    "subsections": []
                },
                {
                    "title": "D. SENSITIVITY RESULTS",
                    "paragraphs": [
                        "The baseband voltage spectrum of the demodulated sidebands in the second setup is plotted in Fig. 7 for the case of the coil producing the field of interest driven at a frequency of 30kHz. The signal-to-noise ratio SNR corresponding to Fig. 7 as well as that measured for other frequencies of the field of interest were used to compute sensitivity according to",
                        "where H s is found by applying the Biot-Savart law to the coil and D is a factor to de-embed noise due to the electronic components of the setup. De-embedding noise due to the electronic components yields the intrinsic sensor sensitivity and allows for a comparison with the theoretical value (21). With the setup of Fig. 5, noise due to the electronic components is dominated by that of the 33 dB LNA, so the de-embedding factor is given by",
                        "where again k is the Boltzmann constant, T is temperature, R is the thermal resistance representing ferrite damping noise, and V n,LNA is the rms input noise voltage of the 33 dB LNA. Further details are provided in Supplementary Note 2 and Supplementary Table 3. The right-most column of Table 2 presents the computed sensitivities. Table 2 additionally presents the theoretical sensitivity for the same 6 mm × 6 mm × 1 mm inductive detector used as an inductive sensor, the theoretical sensitivity for the 3.76 mm × 5 mm × 3 um RPM sensor, and a factor quantifying the theoretical sensitivity improvement. These values were computed using supplementary equation (S7), equation ( 21), and supplementary equation (S8) respectively. Appendix B details further the computation involving equation (21). It is seen that the measured sensitivities for the prototype sensor are relatively constant when varying the frequency of the field of interest, as expected based on (21). The slightly lower measured sensitivities at lower frequencies are from growing system losses due to out-of-band operation of the ADL5380 evaluation board. The discrepancy between the measured and theoretical sensitivity of the RPM sensor can be attributed to ohmic resistance, inductive pickup, radiation loss of the inductive detector, and imperfect phase noise cancellation of the pump, all of which were ignored in the derivation of (21). It is further seen from Table 2 that the RPM sensor exhibits improvement over the inductive sensor for all frequencies considered. With that being said, these values are not a fair measure of the extent of improvement given that the cross-sectional area for the RPM sensor, corresponding to the area occupied by the ferrite, is less than 0.2% that of the inductive sensor. Comparing sensors with the same area, a better improvement factor is expected. The achievable sensitivity of the prototype is limited by a maximum allowed pump power. Beyond this maximum, sensitivity is degraded by spin wave generation in the ferrite [28], [32]. Further engineering to suppress the spin wave modes will aid in achieving a better sensitivity.",
                        "Comparing to ferrite inductive sensors in literature which operate at similar frequencies, the inductive sensor of [9] achieves a sensitivity three orders of magnitude better than our sensor but requires a volume five orders of magnitude greater. Additionally, the inductive sensor is narrowband and achieves its sensitivity under matched conditions whereas the proposed RPM sensor demonstrates operation to at least 30 kHz, with the upper limit extending far beyond that, with an almost flat sensitivity. The inductive sensor of [38] achieves a sensitivity two orders of magnitude better than our sensor but does so within a much smaller bandwidth and while requiring a volume five orders of magnitude greater than that of our sensor."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "VII. CONCLUSION",
            "paragraphs": [
                "RPM magnetic field sensors were proposed in this work to achieve high levels of sensitivity while maintaining a small size and low power consumption. The theory of RPM is developed and equations describing various characteristics of RPM sensors were derived analytically. A micromagnetic simulation was performed and shown to agree with the theory. A prototype RPM sensor was constructed and shown to have performance consistent with that predicted by theory. The prototype exhibited a sensitivity of 23.2 pT/Hz 1/2 with a volume of 0.0564 mm 3 and a power consumption of -40.96 dBm. Table 3 compares these characteristics with those of other types of compact magnetic field sensors. Future work will focus on improvements in performance through choice of ferrite material, frequency of operation, and spin wave suppression. Future work will also explore more practical means of biasing and pumping the sensor."
            ],
            "subsections": []
        },
        {
            "title": "APPENDIX A THEORETICAL AMPLITUDE RATIO",
            "paragraphs": [
                "The amplitude ratios of Table 1 were computed theoretically using (20). The value of H 0 was found with a DC Gaussmeter. The values of H s were found through measurement of the current through the coil producing the field of interest followed VOLUME 10, 2022 by application of the Biot-Savart law. The value of Q was computed as the inverse of the 3dB bandwidth of the loaded RPM sensor. This bandwidth was measured using a vector network analyzer under a 70 Oe biasing field. All values are provided in Supplementary Table 2."
            ],
            "subsections": []
        },
        {
            "title": "APPENDIX B THEORETICAL SENSITIVITY",
            "paragraphs": [
                "The theoretical sensitivity was computed using (21). The value of H was found using the definition H = 2αω 0 µ 0 γ with the value of α found using (16), and the value of Q found as that of the unloaded RPM sensor. The sensor is matched to 50 Ohms, so this unloaded Q has a value twice that of the loaded Q. The value of P p was found based on measurements using a vector network analyzer under a 70 Oe biasing field. All values are provided in Supplementary Table 4."
            ],
            "subsections": []
        }
    ]
}