{
    "id": "US20190112697",
    "authors": [
        "Tatsuhiko Hiratani",
        "Yoshihiko Oda",
        "Yoshiaki Zaizen"
    ],
    "title": "ELECTRICAL STEEL SHEET AND METHOD OF PRODUCING THE SAME",
    "date": "2017-03-29 00:00:00",
    "abstract": "An electrical steel sheet includes a surface part in which a Si concentration in the steel sheet changes continuously from a high Si concentration to a low Si concentration in a thickness direction of the steel sheet from a surface of the steel sheet, as defined by a symmetry plane located at the center of the steel sheet in the thickness direction, a boundary part in which the Si concentration changes discontinuously, and an inner part in which the Si concentration does not change substantially in the thickness direction of the steel sheet, the inner part including the center of the steel sheet in the thickness direction, wherein the electrical steel sheet has a stress distribution such that an in-plane tensile stress is generated in the surface part and an in-plane compressive stress is generated in the inner part.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "This disclosure relates to an electrical steel sheet used to produce iron cores included in high-frequency transformers, reactors, motors and the like for power electronics and a method of producing the electrical steel sheet."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to electrical steel sheet"
                    ],
                    "num_characters": 226,
                    "outline_medium": [
                        "introduce electrical steel sheet for high-frequency transformers"
                    ],
                    "outline_short": [
                        "introduce electrical steel sheet for high-frequency transformers"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "The iron loss of an electrical steel sheet consists of the hysteresis loss of the electrical steel sheet, which is strongly dependent on a precipitate included in the steel, the size of crystal grains of the steel, the texture of the steel and the like, and the eddy-current loss of the electrical steel sheet, which is strongly dependent on the thickness, specific resistance, magnetic domain structure and the like of the steel sheet.",
                        "In common electrical steel sheets, the content of impurities in the steel is reduced to a minimum level to facilitate the growth of crystal grains and thereby reduce hysteresis loss.",
                        "At the commercial frequency (50/60 Hz), the hysteresis loss of an electrical steel sheet accounts for a large part of the iron loss of the electrical steel sheet. At high frequencies of a few kilohertz or higher, on the other hand, the eddy-current loss of the electrical steel sheet becomes dominant, since eddy-current loss increases in proportion to the square of frequency while hysteresis loss increases in proportion to frequency.",
                        "In addition, with increases in the operating frequencies of switching devices used in the field of power electronics, there has been a strong demand for a reduction in the high-frequency iron loss of an electrical steel sheet used for producing iron cores included in transformers, reactors, motors and the like.",
                        "To meet the above demand, there has been an attempt to reduce the eddy-current loss of a steel sheet by reducing the thickness of the steel sheet to 0.2 mm or less, which is smaller than the thicknesses of common electrical steel sheets (0.3 to 0.5 mm), or by increasing the content of element that increases the specific resistance of steel such as Si or Al in the steel sheet.",
                        "Switching devices having an operating frequency of a few kilohertz to 50 kilohertz have been used in a power source having a relatively large capacity not only in the fields of automobiles and air conditioners, but also in the field of new energy sources such as photovoltaic power generation. Accordingly, an iron core material having a further low iron-loss at high frequencies has been anticipated.",
                        "In the field of power sources described above, ultrathin electrical steel sheets having a thickness of 0.1 mm or less, high-Si electrical steel sheets, dust cores formed of a compact of iron powder and the like have been used. In the field of small capacity, for example, Mn—Zn ferrite, which has a specific resistance several orders of magnitude higher than the specific resistances of soft magnetic metal materials, has been used.",
                        "However, in view of a possible further increase in operating frequency in the future, even an ultrathin electrical steel sheet having a thickness of 0.1 mm does not always have a sufficiently low eddy-current loss. It is not easy to produce a high-Si electrical steel sheet having a Si concentration of more than 4% by mass because such a steel sheet is hard and brittle. Since a dust core has a significantly higher hysteresis loss than an electrical steel sheet, the iron loss of a dust core considerably increases at frequencies of a few kilohertz. While Mn—Zn ferrite has a markedly low eddy-current loss, the saturation magnetic flux density of Mn—Zn ferrite is 0.5 T at most, which is significantly lower than the saturation magnetic flux density (2.0 T) of common electrical steel sheets. Therefore, when a power source having a large capacity is prepared using Mn—Zn ferrite, the size of the core needs to be increased disadvantageously.",
                        "In response, Japanese Examined Patent Application Publication No. 6-45881 discloses a method of reducing the iron loss of an electrical steel sheet at high frequencies. In this method, a 6.5-mass % Si steel sheet is produced by a siliconizing process. In that technique, a 3-mass % Si steel sheet having a thickness of 0.05 to 0.3 mm is caused to react with a silicon tetrachloride gas at a high temperature to increase the Si concentration in the steel. This is because a 6.5-mass % Si steel sheet has a specific resistance about double the specific resistance of a 3-mass % Si steel sheet, which enables an effective reduction in eddy current loss, and is advantageously used in a high-frequency application. In addition, since the magnetostriction of the 6.5-mass % Si steel sheet is substantially zero, the level of noise generated by an iron core may be markedly reduced.",
                        "Japanese Examined Patent Application Publication No. 5-49744 discloses a steel sheet in which the Si concentration changes in the thickness direction, that is, a “Si-gradient steel sheet”, that can be produced by, in a siliconizing process, pausing uniform diffusion of Si upon the Si concentration in the surface layer reaching 6.5% by mass. The Si-gradient steel sheet has a lower iron loss at high frequencies than a steel sheet having a uniform Si concentration.",
                        "In Japanese Unexamined Patent Application Publication No. 2005-240185, a difference (maximum−minimum) in Si concentration in the thickness direction of the steel sheet, the Si concentration in the surface layer, and a difference in Si concentration between the front and rear surfaces of the steel sheet are specified to reduce the iron loss of a Si-gradient steel sheet at high frequencies. It is described that, in particular, iron loss can be minimized when the Si concentration in the surface layer is 6.5% by mass.",
                        "In general, an electrical steel sheet containing 3% by mass or more Si does not transform into the austenite phase (γ phase) even when heated to a high temperature and remains in the ferrite phase (σ phase) until a liquid phase is formed. Therefore, the above-described siliconizing process is entirely performed in the α phase.",
                        "Japanese Unexamined Patent Application Publication No. 2000-328226 discloses an electrical steel sheet for motors having high workability and excellent high-frequency properties and in which the average Si concentration over the entire thickness of the steel sheet is 0.5% to 4% by mass, which is at a low level. The electrical steel sheet is produced by siliconizing only the surface layer of a steel sheet containing less than 3% by mass Si at 900° C. to 1000° C.",
                        "Japanese Patent No. 5533801 and Japanese Patent No. 5648335 disclose a technique in which excellent magnetic properties are achieved by diffusing a ferrite-formation element from the surface of a steel sheet toward the inner austenite phase to transform the austenite phase into the ferrite phase and form a microstructure strongly accumulated in a particular crystal plane.",
                        "Japanese Unexamined Patent Application Publication No. 2015-61941 discloses a technique in which excellent magnetic properties are achieved by creating a portion of a steel sheet having a composition capable of causing α-γ transformation and at which an element other than Fe is concentrated, the portion extending partially in the thickness direction, and thereby reducing the residual stress generated in the surface of the steel sheet.",
                        "Japanese Patent No. 5655295 discloses that it is possible to markedly reduce eddy-current loss by siliconizing a low-carbon steel sheet in the temperature range of 1050° C. to 1250° C., which is the austenite phase region, and cooling the siliconized steel sheet while only the Si concentration in the surface layer is maintained to be high to produce a Si-gradient steel sheet.",
                        "Japanese Patent No. 5644680 discloses a technique in which a steel sheet containing 0.003% to 0.02% by mass C which can be transformed into the austenite phase when heated to a high temperature is siliconized to produce a clad electrical steel sheet having excellent magnetic properties.",
                        "As described above, iron loss is the sum of hysteresis loss and eddy-current loss. It is known that, the higher the excitation frequency, the higher the proportion of eddy-current loss in the total iron loss. The higher the specific resistance of a material, the higher the resistance to eddy current passing through the material. Therefore, a material having a high specific resistance is used to produce a core used at high frequencies.",
                        "Known examples of elements that increase the specific resistance of a steel sheet include Si, Al, Cr, and Mn. In general, Si is primarily added to an electrical steel sheet to increase the specific resistance of the electrical steel sheet. However, if the Si concentration in the material exceeds 4% by mass, the material becomes significantly brittle, which makes it difficult to cold-roll the material. Accordingly, the maximum amount of Si added to a steel sheet is normally set to about 4% by mass. To further increase the specific resistance of a steel sheet, 1% to 4% by mass of Al and Cr are further added to the steel sheet.",
                        "However, adding large amounts of alloying elements to a steel sheet increases the costs and reduces the saturation magnetic flux density of the material. For example, while a 3-mass % Si steel has a saturation magnetic flux density of 2.03 T, adding 1% by mass Al and 3% by mass Cr to the 3-mass % Si steel reduces the saturation magnetic flux density of the steel to about 1.80 T.",
                        "A material for cores used at high frequencies is commonly designed in consideration of a certain amount of direct-current component of the excitation current and magnetic saturation of the material caused by a high current that may instantaneously pass through the material. It is necessary to increase the size of the core to compensate for the reduction in the saturation magnetic flux density of the material.",
                        "In Japanese Examined Patent Application Publication No. 6-45881, after a 3-mass % Si steel sheet has been rolled to a final thickness, silicon tetrachloride is sprayed to the steel sheet at a high temperature in the final annealing treatment. That siliconizing process enables production of a 6.5-mass % Si steel sheet, which has been difficult to produce by rolling. The 6.5-mass % Si steel sheet, which has a specific resistance about double that of a 3-mass % Si steel sheet, is suitably used to produce an iron core used at high frequencies.",
                        "However, when the 6.5-mass % Si steel sheet is used to produce iron cores in practice, the material, that is, the 6.5-mass % Si steel sheet, needs to be subjected to slitting, pressing, bending or the like and, in these steps, cracking and chipping are likely to occur. Therefore, high-yield production of cores requires a sophisticated processing technique. In addition, since the Si content in the 6.5-mass % Si steel sheet is high, the saturation magnetic flux density of the steel sheet is about 1.80 T, which is at a low level.",
                        "In Japanese Examined Patent Application Publication No. 5-49744 and Japanese Unexamined Patent Application Publication No. 2005-240185, a steel sheet in which the Si concentration changes in the thickness direction, that is, a Si-gradient steel sheet, is described. The Si-gradient steel sheet has more excellent high-frequency properties than a 6.5-mass % Si steel sheet. While the Si concentration in the surface layer of the Si-gradient steel sheet is about 6.5%, which is at a high level, the Si concentration in the sheet-thickness center layer about 3% to 4% by mass, which is at a low level, and the average Si concentration over the entire steel sheet is low. Therefore, the Si-gradient steel sheet has higher workability than a 6.5-mass % Si steel sheet and has a high saturation magnetic flux density of 1.85 to 1.90 T.",
                        "In that technique, since the siliconizing process is performed in the ferrite single-phase in which diffusion rate is basically high, while Si contained in the gas phase permeates the surface layer of the steel sheet, Si quickly diffuses to the inside of the steel sheet. When the Si-gradient steel sheet is an ultrathin steel sheet, Si atoms may reach the center of the steel sheet in the thickness direction during the siliconizing process and, consequently, the Si concentration over the entire steel sheet may be increased.",
                        "In Japanese Unexamined Patent Application Publication No. 2000-328226, a material containing less than 3% Si is used to produce a steel sheet in which the Si concentration changes in the thickness direction to reduce the average Si concentration over the entire steel sheet and produce a high-frequency low iron-loss material having good workability.",
                        "A material containing Si at a low concentration can be transformed into the austenite (γ) phase at high temperatures. In the technique disclosed in Japanese Unexamined Patent Application Publication No. 2000-328226, when the material is siliconized at a high temperature exceeding 1000° C., that is, in the γ phase, cracking may occur at the γ/α transformation interface in the surface layer. Accordingly, the siliconizing process is performed in the temperature range of 900° C. to 1000° C., in which the austenite phase is hardly formed.",
                        "However, the above siliconizing process is an extension of the known siliconizing process performed in the α phase, and a reduction effect in eddy-current loss which can be achieved by the above siliconizing process will also be within an expected range.",
                        "In Japanese Patent No. 5533801 and Japanese Patent No. 5648335, the soft magnetic properties of a steel sheet are enhanced by diffusing a ferrite-formation element from the surface of the steel sheet toward the inner austenite phase and forming a particular texture through the use of the γ→α transformation. However, while the change in texture markedly affects hysteresis loss, which accounts for a part of iron loss, it does not markedly affect eddy-current loss. Therefore, it appears that changing the texture of a steel sheet is not an effective way to reduce eddy-current loss which accounts for a large part of iron loss at high frequencies. On the contrary, developing a texture effective to reduce hysteresis loss may increase the width of magnetic domain and, consequently, increase abnormal eddy-current loss.",
                        "In Japanese Unexamined Patent Application Publication No. 2015-61941, the soft magnetic properties of a steel sheet are enhanced by changing the concentration of an element other than Fe in the thickness direction of the steel sheet and limiting the residual stress generated in the surface of the steel sheet to a low level. However, the method in which residual stress is reduced to limit an increase in the hysteresis loss of a soft magnetic material has been practiced for a long time. Moreover, the relationship between a reduction in residual stress and a reduction in eddy-current loss is not clear.",
                        "In Japanese Patent No. 5655295, a remarkable reduction in eddy-current loss is achieved by siliconizing a low-carbon steel containing more than 0.02% by mass C in a high-temperature range higher than 1050° C. and creating a specific stress distribution in the resulting Si-gradient steel sheet such that an in-plane tensile stress is generated in the surface layer and an in-plane compressive stress is generated in the inner layer. However, a complex transformation structure extends around the center of the steel sheet in the thickness direction and, consequently, the direct-current magnetic properties of the steel sheet are considerably poor when the steel sheet is used as an electrical steel sheet.",
                        "For example, the magnetic flux density B8 that corresponds to a magnetizing force of 800 A/m in a magnetization curve is about 0.75 T at most. The dimensions of a core material used in practice are determined in accordance with the magnetic flux density at which the differential permeability starts rapidly decreasing in the magnetization curve, that is, the height of the shoulder of the B-H curve. The B8 value is likely to be used as an index of such a magnetic flux density. Therefore, a material having poor direct-current magnetic properties and a low B8 value is substantially not suitable to reduce the size of a core even if the saturation magnetic flux density of the material is high.",
                        "In Japanese Patent No. 5644680, when an impact force similar to the force generated in shearing process is applied to the steel sheet, crystal grains included in the surface part were cracked along the grain boundaries in the thickness direction. In addition, cracking occurred at the boundary between the surface part and the inner part. This resulted in variations in soft magnetic properties. In fact, although samples were prepared under the same conditions, the degree of variations in the soft magnetic properties of the samples was large in some cases. The degree of variations in soft magnetic properties was likely to increase particularly when the C content was 0.005% by weight or less. With a recent increase in the use of switching devices having a high operating frequency of 10 k to 50 kHz in the production of power sources having a relatively large capacity which are included in hybrid vehicles, electric vehicles, photovoltaic power generation systems and the like, there has been a demand for a practical material having a high saturation magnetic flux density, a low iron-loss at high frequencies, and consistent properties. In this regard, the variations in magnetic properties are unfavorable.",
                        "Accordingly, it could be helpful to provide an electrical steel sheet having a high saturation magnetic flux density and a low iron-loss at high frequencies and a method of producing the electrical steel sheet."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce iron loss",
                        "explain hysteresis loss",
                        "explain eddy-current loss",
                        "describe common electrical steel sheets",
                        "describe high-frequency applications",
                        "motivate reduction of iron loss",
                        "describe limitations of common electrical steel sheets",
                        "describe ultrathin electrical steel sheets",
                        "describe high-Si electrical steel sheets",
                        "describe dust cores",
                        "describe Mn—Zn ferrite",
                        "describe Japanese Examined Patent Application Publication No. 6-45881",
                        "describe Japanese Examined Patent Application Publication No. 5-49744",
                        "describe Japanese Unexamined Patent Application Publication No. 2005-240185",
                        "describe Japanese Patent No. 5533801",
                        "describe Japanese Patent No. 5648335",
                        "describe Japanese Unexamined Patent Application Publication No. 2015-61941",
                        "describe Japanese Patent No. 5655295",
                        "describe Japanese Patent No. 5644680",
                        "describe limitations of known techniques",
                        "describe importance of specific resistance",
                        "describe elements that increase specific resistance",
                        "describe limitations of adding alloying elements",
                        "describe design considerations for high-frequency cores",
                        "describe Japanese Examined Patent Application Publication No. 6-45881",
                        "describe limitations of 6.5-mass % Si steel sheet",
                        "describe Japanese Examined Patent Application Publication No. 5-49744",
                        "describe Japanese Unexamined Patent Application Publication No. 2005-240185",
                        "describe Japanese Unexamined Patent Application Publication No. 2000-328226",
                        "describe limitations of known siliconizing processes",
                        "describe Japanese Patent No. 5533801",
                        "describe Japanese Patent No. 5648335",
                        "describe Japanese Unexamined Patent Application Publication No. 2015-61941",
                        "describe Japanese Patent No. 5655295"
                    ],
                    "num_characters": 17413,
                    "outline_medium": [
                        "describe iron loss of electrical steel sheet",
                        "explain hysteresis loss and eddy-current loss",
                        "discuss reduction of hysteresis loss",
                        "describe eddy-current loss at high frequencies",
                        "motivate demand for low iron-loss electrical steel sheet",
                        "discuss limitations of common electrical steel sheets",
                        "introduce Si-gradient steel sheet",
                        "describe Japanese Examined Patent Application Publication No. 6-45881",
                        "discuss Japanese Unexamined Patent Application Publication No. 2005-240185",
                        "introduce Japanese Patent No. 5533801 and Japanese Patent No. 5648335",
                        "discuss Japanese Unexamined Patent Application Publication No. 2015-61941",
                        "describe Japanese Patent No. 5655295",
                        "discuss Japanese Patent No. 5644680",
                        "motivate need for high saturation magnetic flux density and low iron-loss",
                        "discuss limitations of prior art",
                        "describe problems with prior art",
                        "motivate invention"
                    ],
                    "outline_short": [
                        "explain iron loss of electrical steel sheet",
                        "describe hysteresis loss and eddy-current loss",
                        "discuss limitations of common electrical steel sheets",
                        "motivate need for low iron-loss electrical steel sheet",
                        "summarize prior art on siliconizing process",
                        "discuss limitations of prior art",
                        "describe need for high-yield production of cores",
                        "summarize prior art on Si-gradient steel sheets"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "We thus provide:",
                        "[1] An electrical steel sheet including, with a symmetry plane being the center of the steel sheet in the thickness direction, a surface part in which the Si concentration in the steel sheet changes continuously from a high Si concentration to a low Si concentration in the thickness direction of the steel sheet from the surface of the steel sheet, a boundary part in which the Si concentration changes discontinuously, and an inner part in which the Si concentration does not change substantially in the thickness direction of the steel sheet, the inner part including the center of the steel sheet in the thickness direction, the electrical steel sheet having a stress distribution such that an in-plane tensile stress is generated in the surface part and an in-plane compressive stress is generated in the inner part, the average aspect ratio of crystal grains included in the surface part, that is, the ratio of the dimension of the crystal grains in a direction parallel to the surface of the steel sheet to the dimension of the crystal grains in a direction (depth direction) perpendicular to the surface of the steel sheet, being 0.7 or more and 4.0 or less,",
                        "wherein the average aspect ratio is the average of aspect ratios of 50 or more crystal grains and, when a crystal grain included in the surface part extends to the inner part beyond the boundary part, the dimension of the crystal grain in the direction (depth direction) perpendicular to the surface of the steel sheet is determined taking a portion of the crystal grain which is included in the inner part into account.",
                        "[2] The electrical steel sheet described in [1], wherein the thickness of the surface part is 10% to 40% of the thickness of the steel sheet.\n\n[3] The electrical steel sheet described in [1] or [2], wherein the average Si concentration in the surface part is 2.5% to 6.5% by mass and the average Si concentration in the inner part is 2.0% or less by mass.\n\n[4] The electrical steel sheet described in any one of [1] to [3], wherein a tensile stress of 50 to 200 MPa is generated in the surface part in the direction parallel to the surface of the steel sheet, and wherein a compressive stress of 50 to 200 MPa is generated in the inner part in the direction parallel to the surface of the steel sheet.\n\n[5] The electrical steel sheet described in any one of [1] to [4], the electrical steel sheet having a thickness of 0.03 to 0.5 mm.\n\n[6] A method of producing an electrical steel sheet, the method including: heating a steel sheet to 1100° C. to 1250° C. in a non-oxidizing atmosphere to transform the steel sheet into the austenite phase, the steel sheet having a composition containing, by mass, C: 0.020% or less, Si: 0.15% to 2.0%, Mn: 0.05% to 2.00%, P: 0.1% or less, S: 0.01% or less, Al: 0.1% or less, and N: 0.01% or less, with the balance being Fe and inevitable impurities; subsequently causing Si to penetrate the surface of the steel sheet at 1100° C. to 1250° C. in a non-oxidizing atmosphere containing 10 mol % or more and less than 45 mol % silicon tetrachloride to transform a surface layer of the steel sheet into the ferrite phase; subsequently holding the steel sheet for a predetermined amount of time at 1100° C. to 1250° C. in a non-oxidizing atmosphere that does not contain Si until the thickness of the surface part that is in the ferrite phase reaches 10% to 40% of the thickness of the steel sheet, while maintaining the austenite phase in the inner part; and",
                        "subsequently cooling the steel sheet to 400° C. at an average cooling rate of 5 to 30° C./s.",
                        "Hereinafter, when referring to the composition of steel, “%” denotes “% by mass” unless otherwise specified.",
                        "An electrical steel sheet having a high saturation magnetic flux density and a low iron-loss at high frequencies may be produced. It is possible to produce an electrical steel sheet having a high saturation magnetic flux density, a low iron-loss at high frequencies, and consistent properties. Consequently, an iron core material that enables a reduction in the size of high-frequency transformers and the like may be provided.",
                        "Our steel sheets can be suitably used to produce an iron core included in a high-frequency transformer, a reactor, a motor or the like for power electronics."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce electrical steel sheet",
                        "describe surface part",
                        "describe boundary part",
                        "describe inner part",
                        "describe stress distribution",
                        "describe average aspect ratio of crystal grains",
                        "describe method of producing electrical steel sheet",
                        "describe applications of electrical steel sheet"
                    ],
                    "num_characters": 4289,
                    "outline_medium": [
                        "introduce electrical steel sheet with Si concentration gradient",
                        "describe boundary part and inner part of steel sheet",
                        "introduce stress distribution in steel sheet",
                        "describe method of producing electrical steel sheet"
                    ],
                    "outline_short": [
                        "introduce electrical steel sheet with Si concentration gradient",
                        "describe method of producing electrical steel sheet"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "Our steel sheets and methods are described in detail below.",
                        "We conducted extensive studies of a method of producing an electrical steel sheet having a high saturation magnetic flux density and a low iron-loss at high frequencies. First, attention was focused on the Si-gradient steel sheet illustrated in FIG. 1, which can be used as an electrical steel sheet. The Si-gradient steel sheet illustrated in FIG. 1 is an electrical steel sheet that includes, with a symmetry plane being the center of the steel sheet in the thickness direction, a surface part in which the Si concentration in the steel sheet changes continuously from a high Si concentration to a low Si concentration in the thickness direction from the surface, a boundary part in which the Si concentration changes discontinuously, and an inner part in which the Si concentration does not change substantially in the thickness direction, the inner part including the center of the steel sheet in the thickness direction. The Si-gradient steel sheet has a specific stress distribution such that an in-plane tensile stress is generated in the surface part and an in-plane compressive stress is generated in the inner part, which reduces iron loss at high frequencies.",
                        "To reduce the iron loss of the Si-gradient steel sheet, samples each of which included a surface part constituted of a different form of crystal grains were prepared and the properties of the samples were determined. Specifically, a cold-rolled steel sheet having a thickness of 0.2 mm which contained, by mass, C: 0.0024%, Si: 0.6%, Mn: 0.12%, P: 0.008%, S: 0.003% or less, Al: 0.003%, N: 0.003%, and the balance being Fe and inevitable impurities was prepared. Specimens having a width of 50 mm and a length of 200 mm were taken from the cold-rolled steel sheet. The specimens were siliconized and subjected to a diffusion treatment. The conditions under which the siliconizing process and the diffusion treatment were performed were adjusted such that the amount of silicon used, that is, the amount of silicon added to the steel sheet in the siliconizing process, was 2.4%±0.2% or less and the ratio of the thickness, ds, of the surface part, that is, the Si-concentrated layer, to the thickness, d0, of the steel sheet was 30%±3% or less. Subsequent to the siliconizing process and diffusion treatment of the samples, the width of the samples was reduced to 30 mm by shearing both ends of the samples. The samples were subsequently subjected to a magnetic measurement in accordance with a method (Epstein test method) conforming to JIS C2550 with a small single-sheet testing frame. After the magnetic measurement had been terminated, the samples were further sheared. Subsequently, the microstructure of a cross section of each of the samples was determined with an optical microscope, and the Si distribution in the sample in the thickness direction was determined by EPMA.",
                        "The form of crystal grains included in the surface part can be adjusted by changing the conditions under which the siliconizing process is performed. For example, the higher the temperature at which the siliconizing process is performed within the austenite temperature range of the material (steel sheet) or the lower the concentration of the silicon tetrachloride gas, the higher the likelihood of the size of crystal grains included in the surface layer increasing in the direction parallel to the surface of the steel sheet. In contrast, the lower the temperature at which the siliconizing process is performed within the austenite temperature range of (steel sheet) or the higher the concentration of the silicon tetrachloride gas, the higher the likelihood of the size of crystal grains included in the surface part increasing in the thickness direction of the steel sheet.",
                        "As illustrated in FIG. 3, the dimension of a crystal grain included in the surface part which is measured in the direction parallel to the surface (hereinafter, this direction may be referred to as “parallel-to-surface direction”) is denoted by b, and the dimension of the crystal grain which is measured in the thickness direction of the steel sheet (hereinafter, this direction may be referred to as “perpendicular-to-surface direction” or “depth direction”) is denoted by a. The above dimensions of each of 50 or more crystal grains included in the surface layer were measured, and the aspect ratio, b/a, of each of the crystal grains was calculated. The average thereof was considered to be the representative value (average aspect ratio, b/a, of crystal grains included in the surface part) of the sample. FIG. 3 is a cross-sectional view of the steel sheet which is taken in the L-direction (rolling direction), schematically illustrating the aspect ratio, b/a, of a crystal grain included in the surface part. In FIG. 3, a and b denote the maximum dimension of each of the crystal grains measured in the thickness direction and the maximum dimension of the crystal grain measured in the direction parallel to the surface, respectively. Although the aspect ratio of a crystal grain does not change whether the measurement is done in the L-direction (the rolling direction) or the C-direction (the width direction), evaluations are made using aspect ratios measured in the L-direction.",
                        "FIG. 2 illustrates the relationship between the average aspect ratio, b/a, of crystal grains included in the surface part (in FIG. 2, this ratio is abbreviated as “average aspect ratio in surface part b/a”) and iron loss. The samples prepared in the test had a ratio, b/a, of 0.5 to 4.5. However, in the test where the composition of the material, thickness of the steel sheet, the amount of silicon added, and the thickness of the surface part were set to be identical, the iron losses of the samples were generally above a certain level regardless of the average aspect ratio of crystal grains included in the surface part, and reduction effect in iron loss were not confirmed. On the other hand, we found that whether the degree of variations in iron loss is large or small is clearly distinguished in accordance with the average aspect ratio of crystal grains included in the surface part. That is, we confirmed that the degree of variations in iron loss is large when the average aspect ratio of crystal grains included in the surface part is significantly small or large, while the degree of variations in iron loss is small when the average aspect ratio of crystal grains included in the surface part falls within a particular range.",
                        "We also confirmed that a test similar to the above test was conducted using samples having different steel compositions and different thicknesses. On the other hand, when the composition of the material used, the thickness of samples, and the distribution of Si concentration in the samples were changed, the average iron loss of samples and the degree of variations in iron loss were changed. Accordingly, a plurality of samples each of which included a surface layer composed of crystal grains having a different average aspect ratio were prepared while the composition of the material, thickness of the steel sheet, the amount of silicon added, and the thickness of the surface layer were set to be identical, the average iron loss, m, of the samples and the standard deviation, σ, of iron loss were determined, and the degree of variations in iron loss was considered small when the coefficient of variation, σ/m, was less than 10%. As a result, we found that the degree of variations in iron loss can be reduced when the average aspect ratio of crystal grains included in the surface part is 0.7 or more and 4.0 or less.",
                        "Although the direct relationship between iron loss and the average aspect ratio of crystal grains included in the surface part is not clear, the results of observation of cross sections of the samples with a loupe confirm that cracking and chipping occurred in crystal grains included in the surface parts of samples having a high iron loss, while cracking and chipping hardly occurred in samples having an average iron loss. Since the likelihood of cracking and chipping varies with the average aspect ratio of crystal grains included in the surface part, we believe that the average aspect ratio of crystal grains included in the surface part may affect the degree of variations in iron loss. The results of observation of the microstructures included in the cross sections of the samples also confirm that cracking occurred at the boundary part between the surface part and the inner part in some of the samples. The occurrence of such defects was significant in samples in which the average aspect ratio of crystal grains included in the surface part was significantly low or high. In contrast, such defects were not likely to occur when samples in which the average aspect ratio of crystal grains included in the surface part fell within a specific range were sheared. This presumably reduced the degree of variation in iron loss. The results of further detail observation of microstructure confirmed that cracking is likely to occur at the grain boundaries present in the surface part and grain size when the average aspect ratio of crystal grains included in the surface part is small, that is, when the crystal grains included in the surface part have a slender shape elongated in the thickness direction of the steel sheet and that cracking is likely to occur at the boundary part interposed between the surface part and the inner part when the average aspect ratio of crystal grains included in the surface part is large, that is, when the crystal grains included in the surface part have a slender shape elongated in the direction parallel to the surface. The samples in which the occurrence of the above defects was significant had a high iron loss.",
                        "The reasons for the limitation of the basic structure of the steel sheet are described.",
                        "The electrical steel sheet is a Si-gradient steel sheet produced by heating a steel sheet containing Si at a low concentration to the high-temperature austenite phase, increasing the Si concentration in the surface layer by siliconizing process and diffusion treatment, transforming the surface layer into the ferrite phase, and cooling the steel sheet such that the austenite phase having a low Si concentration remains in the inner layer. The electrical steel sheet includes, with a symmetry plane being the center of the steel sheet in the thickness direction, a surface part in which the Si concentration in the steel sheet changes continuously from a high Si concentration to a low Si concentration in the thickness direction from the surface, a boundary part in which the Si concentration changes discontinuously, and an inner part in which the Si concentration does not change substantially in the thickness direction, the inner part including the center of the steel sheet in the thickness direction. This enables the electrical steel sheet to achieve both high saturation magnetic flux density and low iron-loss at high frequencies. The inner part in which the Si concentration does not change substantially in the thickness direction and that includes the center of the steel sheet in the thickness direction is a part of the steel sheet extending from the boundary part to the center of the steel sheet in the thickness direction and in which the difference between the maximum and minimum Si concentrations in the region between two boundary parts is less than ±0.1%. The boundary part in which the Si concentration changes discontinuously is a part of the steel sheet in which the Si concentration changes by 0.2% or more in a region having a thickness of ±1 μm or less and the minimum Si concentration in the surface part and the maximum Si concentration in the inner part occur discontinuously. The electrical steel sheet has a stress distribution such that an in-plane tensile stress is generated in the surface part and an in-plane compressive stress is generated in the inner part. It is possible to reduce eddy-current loss and iron loss at high frequencies through the use of the above stress distribution.",
                        "As described above, the electrical steel sheet has a Si concentration distribution with a symmetry plane being the center of the steel sheet in the thickness direction. If the distribution of Si concentration in the steel sheet extending from the front surface to the rear surface is asymmetrical, the steel sheet may become significantly warped and the shape of the steel sheet may become degraded. Furthermore, the stress distribution such that an in-plane tensile stress is generated in the surface part and an in-plane compressive stress is generated in the inner part, which is unique to the Si-gradient steel sheet, may become asymmetrical with respect to the center plane of the steel sheet in the thickness direction and, consequently, the reduction effect in eddy-current loss may be limited. In consideration of the shape of the steel sheet and the reduction in iron loss at high frequencies, the difference between the Si concentrations at the front and rear surfaces of the steel sheet is desirably minimized and is preferably 0.2% or less.",
                        "As described above, the electrical steel sheet, that is, the Si-gradient steel sheet produced by performing siliconizing process in the austenite phase, includes a discontinuous Si-concentration distribution region formed as a result of γ/α transformation, that is, the boundary part (Si concentration gap) in which the Si concentration changes discontinuously. The boundary part is a part of the steel sheet in which the Si concentration changes 0.1% or more per 1 micrometer in the thickness direction of the steel sheet (concentration gradient of 0.1%/μm or more), that is, in which the Si concentration changes by 0.2% or more in a region within ±1 μm or less in the thickness direction.",
                        "The Si concentration gap, which exists in the boundary part interposed between the surface part and the inner part, enables magnetic flux to concentrate at the surface part and thereby suitably reduces eddy-current loss. However, since the stress distribution rapidly changes in the boundary part, cracking is likely to occur at the interfaces upon an impact force similar to the force generated in shearing process being applied to the steel sheet. Although such cracks do not lead to the fracture of the material because they do not propagate over the entire steel sheet and remain in a narrow region, the cracks cause variations in magnetic properties and, in particular, variations in iron loss. With consideration of the application of the material to the practical use, it is considered necessary to minimize variations in the properties of the Si-gradient steel sheet having a Si-concentration distribution that is discontinuous at the interface between the surface part and the inner part and having a steep stress distribution.",
                        "To address the above issues, the average aspect ratio of crystal grains included in the surface part, that is, the ratio of the dimension of crystal grains measured in the parallel-to-surface direction to the dimension of the crystal grains measured in the perpendicular-to-surface direction (depth direction), is specified. The average aspect ratio of crystal grains included in the surface part is limited to 0.7 or more and 4.0 or less. This reduces the degree of variations in iron loss and enables the specific stabilization to be achieved."
                    ],
                    "subsections": [
                        {
                            "title": "Average Aspect Ratio of Crystal Grains Included in Surface Part: Ratio of Dimension of Crystal Grains in Parallel-to-Surface Direction to Dimension of Crystal Grains in Perpendicular-to-Surface Direction (Depth Direction) is 0.7 or More and 4.0 or Less",
                            "paragraphs": [
                                "As described above, as a result of our extensive studies, we found that the average aspect ratio, b/a, of crystal grains included in the surface part is the factor significantly important to the Si-gradient steel sheet. If the ratio, b/a, is less than 0.7, cracking and chipping may occur at the boundaries of crystal grains included in the surface part upon the steel sheet being sheared and, consequently, the degree of variations in iron loss may be increased to a significant level. If the ratio, b/a, is more than 4.0, cracking is likely to occur at the boundary part interposed between the surface part and the inner part upon the steel sheet being sheared and, consequently, the degree of variations in iron loss may be increased to a significant level. When the ratio, b/a, is 0.7 or more and 4.0 or less, such cracking hardly occurs and it is possible to reduce the degree of variations in iron loss to a markedly low level.",
                                "The average aspect ratio is the average of the aspect ratios of 50 or more crystal grains. When a crystal grain included in the surface part extends to the inner part beyond the boundary part, the dimension of the crystal grain in the perpendicular-to-surface direction (depth direction) is determined taking a portion of the crystal grain which is included in the inner part into account.",
                                "The texture of the surface part and the texture of the inner part are not limited and may be a microstructure constituted of crystal grains randomly oriented or highly accumulated in a particular plane or orientation. When the electrical steel sheet, in which the Si concentration distributions in the surface part and the inner part are clearly different from each other, is constituted of randomly oriented crystal grains, cracking is less likely to occur at the crystal grains included in the surface layer having a high Si concentration and at the boundary part in which the Si concentration changes discontinuously upon the steel sheet being, for example, sheared, because the dislocation movements of the crystal grains are averaged. Accordingly, the crystal grains are preferably randomly oriented."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe importance of average aspect ratio",
                                "explain effect of aspect ratio on iron loss",
                                "specify average aspect ratio range",
                                "describe texture of surface part and inner part"
                            ],
                            "num_characters": 2131,
                            "outline_medium": [
                                "describe importance of average aspect ratio",
                                "specify limitations of average aspect ratio"
                            ],
                            "outline_short": [
                                "specify average aspect ratio of crystal grains"
                            ]
                        },
                        {
                            "title": "Thickness of Surface Part: 10% to 40% of Thickness of Steel Sheet (Preferable Condition)",
                            "paragraphs": [
                                "If the thickness of the surface part is less than 10% of the thickness of the steel sheet, the surface part may become almost magnetically saturated, which results in a reduction in magnetic permeability, when the excitation magnetic flux density is low. As a result, the inner part also starts becoming magnetized, which limits the reduction effect in eddy-current loss. On the other hand, if the thickness of the surface part is more than 40% of the thickness of the steel sheet, a large part of the steel sheet extending from the surface to a region around the center of the steel sheet in the thickness direction becomes magnetized and, consequently, a magnetic flux distribution similar to that formed in a Si-uniform material is formed, which limits the reduction effect in eddy current. To effectively reduce eddy-current loss in the Si-gradient steel sheet, it is important to accumulate a magnetic flux at a specific region of the surface layer. For the above reasons, the thickness of the surface part is preferably 10% or more and 40% or less and is more preferably 20% or more and 35% or less of the thickness of the steel sheet."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "specify thickness of surface part",
                                "explain effect of thickness of surface part on eddy-current loss"
                            ],
                            "num_characters": 1141,
                            "outline_medium": [
                                "specify thickness of surface part"
                            ],
                            "outline_short": [
                                "specify thickness of surface part"
                            ]
                        },
                        {
                            "title": "Average Si Concentration in Surface Part: 2.5% to 6.5% (Preferable Condition)",
                            "paragraphs": [
                                "If the average Si concentration in the surface part is less than 2.5%, the reduction effect in eddy current may fail to be achieved at a sufficient level. If the average Si concentration in the surface part exceeds 6.5%, the likelihood of cracking in the surface layer may rapidly increase. Accordingly, the average Si concentration in the surface part is preferably 2.5% to 6.5%."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "specify average Si concentration in surface part"
                            ],
                            "num_characters": 380,
                            "outline_medium": [
                                "specify average Si concentration in surface part"
                            ],
                            "outline_short": [
                                "specify average Si concentration in surface part"
                            ]
                        },
                        {
                            "title": "Average Si Concentration in Inner Part: 2.0% or Less (Preferable Condition)",
                            "paragraphs": [
                                "If the average Si concentration in the inner part exceeds 2.0%, the likelihood of a discontinuous Si concentration distribution (boundary part) being formed at the boundary between the surface part and the inner part is small and, consequently, the reduction effect in eddy-current loss may fail to be achieved at a sufficient level. Accordingly, the average Si concentration in the inner part is preferably 2.0% or less. On the other hand, if the average Si concentration in the inner part is less than 0.15%, crystal grains included in the surface part are likely to grow in a slender shape elongated in the thickness direction of the steel sheet, the average aspect ratio, b/a, of crystal grains included in the surface part is likely to be less than 0.7 even when the conditions under which the siliconizing process and the conditions under which the diffusion treatment are performed are adjusted and, consequently, cracking is likely to occur in the surface layer. Accordingly, the average Si concentration in the inner part is preferably 0.15% or more."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "specify average Si concentration in inner part",
                                "explain effect of average Si concentration in inner part on eddy-current loss"
                            ],
                            "num_characters": 1059,
                            "outline_medium": [
                                "specify average Si concentration in inner part"
                            ],
                            "outline_short": [
                                "specify average Si concentration in inner part"
                            ]
                        },
                        {
                            "title": "Si Concentration Gap in Boundary Part: 0.4% or More (Preferable Condition)",
                            "paragraphs": [
                                "When the Si concentration gap in a region of the boundary part, which separates the surface part and the inner part from each other, the region extending ±1 μm or less in the thickness direction of the steel sheet, is 0.4% or more, the reduction effect in eddy-current loss increases by 10% or more compared to when the Si concentration distribution is made completely uniform. If the Si concentration gap in the boundary part is less than 0.4%, the accumulation of magnetic flux at the surface part may fail to be achieved at a sufficient level because also the inner part is likely to be magnetized and, consequently, the reduction effect in eddy-current loss may fail to be achieved at a sufficient level. Accordingly, the Si concentration gap in the boundary part is preferably 0.4% or more. The minimum Si concentration in the boundary part corresponds to the Si concentration in the inner part. The maximum Si concentration in the boundary part corresponds to a possible minimum Si concentration in the surface part (a phase) which may occur in the temperature range in which the siliconizing process and the diffusion treatment are performed."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "specify Si concentration gap in boundary part",
                                "explain effect of Si concentration gap on eddy-current loss"
                            ],
                            "num_characters": 1149,
                            "outline_medium": [
                                "specify Si concentration gap in boundary part"
                            ],
                            "outline_short": [
                                "specify Si concentration gap in boundary part"
                            ]
                        },
                        {
                            "title": "Surface Part: Tensile Stress of 50 to 200 MPa in Direction Parallel to Surface, Inner Part: Compressive Stress of 50 to 200 MPa in Direction Parallel to Surface (Preferable Condition)",
                            "paragraphs": [
                                "A stress distribution such that a tensile stress is generated in the surface part and a compressive stress is generated in the inner part is created to reduce eddy-current loss. It is preferable to set the tensile stress generated in the surface part to be 50 MPa or more and the compressive stress generated in the inner part to be 50 MPa or more to reduce eddy-current loss at a significant level (by 10% or more) compared to a Si-uniform steel sheet having the same thickness and the same average Si concentration. If the tensile stress generated in the surface part exceeds 200 MPa and the compressive stress generated in the inner part exceeds 200 MPa, severe cracking may occur during shearing process, which increases the degree of variations in iron loss, even when the aspect ratio of crystal grains included in the surface part falls within the desired range. Accordingly, the tensile stress generated in the surface part is preferably 50 to 200 MPa, and the compressive stress generated in the inner part is preferably 50 to 200 MPa. The above internal stresses are determined using the radius of curvature of warpage observed when a Si-gradient steel sheet that is not warped substantially is chemically polished such that a portion of the steel sheet extending from one of the surfaces to the central portion in the sheet thickness direction is removed."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "specify tensile stress in surface part and compressive stress in inner part",
                                "explain effect of stress distribution on eddy-current loss"
                            ],
                            "num_characters": 1366,
                            "outline_medium": [
                                "specify stress distribution in surface and inner parts"
                            ],
                            "outline_short": [
                                "specify stress distribution in surface and inner parts"
                            ]
                        },
                        {
                            "title": "Thickness of Steel Sheet: 0.03 to 0.5 mm (Preferable Condition)",
                            "paragraphs": [
                                "The smaller the thickness of the steel sheet, the larger the reduction in eddy-current loss. However, reducing the thickness of the steel sheet to be less than 0.03 mm increases the production costs for rolling and the loads placed on the working of the core material and the assembly of cores. On the other hand, if the thickness of the steel sheet exceeds 0.5 mm, large amounts of time may be required to siliconize the surface of the steel sheet and perform the diffusion treatment to achieve adequate Si distribution. If the thickness of the steel sheet exceeds 0.5 mm, in the production of cores, cracking is likely to occur in a shear plane of the steel sheet and, consequently, the degree of variations in the properties of the steel sheet may be increased. Accordingly, the thickness of the steel sheet is preferably 0.03 to 0.5 mm.",
                                "The above-described electrical steel sheet can be produced by heating a steel sheet to 1100° C. to 1250° C. in a non-oxidizing atmosphere to transform the steel sheet into the austenite phase, the steel sheet having a composition containing, by mass, C: 0.020% or less, Si: 0.15% to 2.0%, Mn: 0.05% to 2.00%, P: 0.1% or less, S: 0.01% or less, Al: 0.1% or less, and N: 0.01% or less, with the balance being Fe and inevitable impurities; subsequently causing Si to penetrate the surface of the steel sheet at 1100° C. to 1250° C. in a non-oxidizing atmosphere containing 10 mol % or more and less than 45 mol % silicon tetrachloride to transform a surface layer of the steel sheet into the ferrite phase; subsequently holding the steel sheet for a predetermined amount of time at 1100° C. to 1250° C. in a non-oxidizing atmosphere that does not contain Si until the thickness of the surface part that is in the ferrite phase reaches 10% to 40% of the thickness of the steel sheet, while maintaining the austenite phase in the inner part; and subsequently cooling the steel sheet to 400° C. at an average cooling rate of 5 to 30° C./s.",
                                "The reasons for the limitation of the composition of the material that is to be siliconized are described below."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "specify thickness of steel sheet",
                                "explain effect of thickness of steel sheet on eddy-current loss",
                                "describe production costs for rolling",
                                "describe cracking in shear plane of steel sheet"
                            ],
                            "num_characters": 2089,
                            "outline_medium": [
                                "describe effects of thickness on eddy-current loss",
                                "specify thickness of steel sheet"
                            ],
                            "outline_short": [
                                "specify thickness of steel sheet"
                            ]
                        },
                        {
                            "title": "C: 0.020% or Less",
                            "paragraphs": [
                                "It is preferable to minimize the C concentration in the material to enhance soft magnetic properties. If the C concentration exceeds 0.020%, the pearlite structure, the bainite structure, and the martensite structure, which increase the coercive force and hysteresis loss of the steel sheet, are likely to be formed in the inner part having a low Si concentration while cooling is performed subsequent to the siliconizing process and the diffusion treatment. Accordingly, the C concentration in the material is limited to 0.020% or less. While the lower limit for the C concentration is not specified, a steel having an excessively low solute C concentration is likely to undergo intergranular fracture similarly to ultralow-carbon steel. Accordingly, the C concentration is preferably 0.0005% to 0.020%."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "specify C concentration in material"
                            ],
                            "num_characters": 804,
                            "outline_medium": [
                                "specify C concentration in material"
                            ],
                            "outline_short": [
                                "specify C concentration in material"
                            ]
                        },
                        {
                            "title": "Si: 0.15% to 2.0%",
                            "paragraphs": [
                                "If the Si concentration in the material is less than 0.15%, slender crystal grains that are elongated in the thickness direction of the steel sheet and have an aspect ratio of less than 0.7 are likely to be formed in the surface layer during the siliconizing process and the diffusion treatment. This increases the likelihood of cracking occurring during shearing process and the degree of variations in iron loss. On the other hand, if the Si concentration in the material exceeds 2.0%, the likelihood of the discontinuous Si concentration distribution (boundary part) being created at the boundary between the surface part and the inner part is small and, consequently, the reduction effect in eddy-current loss may fail to be achieved at a sufficient level.",
                                "Accordingly, the Si concentration in the material is limited to 0.15% to 2.0%.",
                                "**Mn: 0.05% to 2.00%**",
                                "Mn is an element effective to improve the toughness of steel. In steel, Mn bonds to S and precipitates in the form of MnS. If the Mn concentration in the material is less than 0.05%, the intergranular segregation of S may occur, which increases the likelihood of intergranular fracture occurring in the crystal grains included in the surface part having a high Si concentration. Mn is also an element that stabilizes the austenite phase. If the Mn concentration in the material exceeds 2.00%, a large transformation strain is likely to remain in the inner part when the inner part is transformed from the austenite phase to the ferrite phase during the cooling process performed subsequent to the siliconizing process and the diffusion treatment. This transformation strain disturbs the stress distribution created in the Si-gradient steel sheet and thereby limits the reduction effect in eddy current. Accordingly, the Mn concentration in the material is limited to 0.05% to 2.00%.",
                                "**P: 0.1% or Less**",
                                "P is an element effective to strengthen steel, but also an element that causes embrittlement. Moreover, Mn may segregate at the phase-transformation interfaces. When the P concentration is 0.1% or less, the occurrence of intergranular cracking in the surface part and the occurrence of cracking in the boundary part can be reduced substantially to an insignificant level. Accordingly, the P concentration in the material is limited to 0.1% or less.",
                                "**S: 0.01% or Less**",
                                "Since S is an element that is likely to segregate at grain boundaries, it is preferable to minimize the S concentration to prevent embrittlement. When the S concentration is 0.01% or less, the occurrence of cracking is reduced to a substantially insignificant level. Accordingly, the Si concentration in the material is limited to 0.01% or less.",
                                "**Al: 0.1% or Less**",
                                "Similarly to Si, Al is an element that increases the specific resistance of steel. There are not a few cases where Al is added to an electrical steel sheet in combination with Si. While Si is an element that reduces the lattice spacing of Fe crystals, Al is an element that increases the lattice spacing of Fe crystals. Conversely, adding Al to the Si-gradient steel sheet disadvantageously mitigates the stress distribution suitable for reducing eddy current, which is formed by the addition of Si. However, the adverse effect is not produced when the Al concentration is 0.1% or less. Accordingly, the Al concentration in the material is limited to 0.1% or less. While the lower limit for the Al concentration is not specified, limiting the Al concentration to be less than 0.002% increases formation of a microstructure including crystal grains having various sizes, which increases iron loss. While the upper limit for the Al concentration is also not limited, it is advantageous to limit the Al concentration to 0.01% or less in consideration of workability. Accordingly, the Al concentration is preferably 0.002% to 0.01%.",
                                "**N: 0.01% or Less**",
                                "Adding N at a concentration of more than 0.01% increases iron loss. Accordingly, the N concentration is limited to 0.01% or less.",
                                "The balance includes Fe and inevitable impurities.",
                                "A preferable production method is described below.",
                                "A slab having the above-described composition is heated, hot-rolled, and repeatedly cold-rolled to form a steel sheet having a predetermined thickness. Intermediate annealing may be performed once or twice or more between the cold-rolling steps. Finish annealing may optionally be performed. The steel sheet is heated to 1100° C. to 1250° C. in a non-oxidizing atmosphere to be transformed into the austenite phase. Subsequently, Si is caused to penetrate the surface of the steel sheet at 1100° C. to 1250° C. in a non-oxidizing atmosphere containing 10 mol % or more and less than 45 mol % silicon tetrachloride to transform the surface layer (to the depth 5% to 40% of the thickness of the steel sheet) of the steel sheet into the ferrite phase. Then, the steel sheet is held for a predetermined amount of time at 1100° C. to 1250° C. in a non-oxidizing atmosphere that does not contain Si until the thickness of the surface layer that is in the ferrite phase reaches 10% to 40% of the thickness of the steel sheet, while the austenite phase is maintained in the inner part. Subsequently, the steel sheet is cooled to 400° C. at an average cooling rate of 5 to 30° C./s.",
                                "As described above, the high-temperature steel sheet that is in the austenite phase is subjected to the siliconizing process and the diffusion treatment to transform only the surface part into a high-Si ferrite phase while maintaining the inner part to be in the austenite phase and, subsequently, the steel sheet is cooled to room temperature to transform the inner part into the ferrite phase. Through the above-described process, an electrical steel sheet including, with a symmetry plane being the center of the steel sheet in the thickness direction, a surface part in which the Si concentration in the steel sheet changes continuously from a high Si concentration to a low Si concentration in the thickness direction of the steel sheet from the surface of the steel sheet, a boundary part in which the Si concentration changes discontinuously, and an inner part in which the Si concentration does not change substantially in the thickness direction of the steel sheet, the inner part including the center of the steel sheet in the thickness direction can be produced.",
                                "The conditions under which the siliconizing process is performed are one of the elements important to produce the electrical steel sheet. Examples of a method of causing Si to penetrate the steel sheet (for siliconizing the steel sheet) include publicly known methods such as a gas-phase siliconizing process, a liquid-phase siliconizing process, and a solid-phase siliconizing process. A Si-containing gas used in the process is not limited and is preferably, for example, one or two or more gases selected from silicon tetrachloride, trichlorosilane, dichlorosilane, monosilane, and disilane. Hereinafter, a gas-phase siliconizing process in which the steel sheet is heated in a non-oxidizing atmosphere and a silicon tetrachloride gas is used is described.",
                                "In the gas-phase siliconizing process, it is possible to control the amount of Si added to the steel sheet and the Si concentration distribution in the steel sheet by adjusting the concentration of the silicon tetrachloride gas in the non-oxidizing atmosphere such as, nitrogen or argon, the temperature at which the reaction is performed in the non-oxidizing atmosphere, the amount of time for which the reaction is performed in the non-oxidizing atmosphere, the temperature at which the subsequent diffusion treatment is performed in a non-oxidizing atmosphere that does not contain a silicon tetrachloride gas, and the amount of time for which the diffusion treatment is performed. To add a predetermined amount of Si to the steel sheet in a short time, it is preferable to produce the steel sheet using a silicon tetrachloride gas at a high temperature and a high concentration. To adjust the amount of Si added to the steel sheet and the Si concentration distribution in the steel sheet with high accuracy, it is preferable to produce the steel sheet using a silicon tetrachloride gas at a low temperature and a low Si concentration.",
                                "Where the siliconizing process is performed in the high-temperature austenite phase, it is possible to change the form of the crystal grains included in the surface part by adjusting the conditions under which the siliconizing process is performed and the conditions under which the diffusion treatment is performed. For example, the concentration of silicon tetrachloride in the non-oxidizing atmosphere has been set to about 50 to 75 mol % in consideration of the efficiency of the siliconizing process. However, when the silicon tetrachloride concentration is increased to the above level, the siliconizing rate is increased and the crystal grains included in the surface layer which has been transformed into the ferrite phase are likely to grow in the thickness direction of the steel sheet and have a small aspect ratio b/a. When the siliconizing process is performed using silicon tetrachloride at a concentration of more than 45 mol %, surface layer grains having an average aspect ratio, b/a, of crystal grains included in the surface part of less than 0.7 are likely to be formed. Conversely, when the silicon tetrachloride concentration is low, the surface-layer grains are likely to grow in the direction parallel to the surface of the steel sheet and have a large aspect ratio. When the siliconizing process is performed using silicon tetrachloride at a concentration of less than 10 mol %, surface layer grains having an average aspect ratio, b/a, of crystal grains included in the surface part of more than 4.0 are likely to be formed. Accordingly, the silicon tetrachloride concentration is limited to 10 mol % or more and less than 45 mol % to adjust the aspect ratio b/a of crystal grains included in the surface layer of the Si-gradient steel sheet to be 0.7 or more and 4.0 or less and to thereby reduce the occurrence of defects in shearing process and the degree of variations in iron loss.",
                                "If the siliconizing process is performed at less than 1100° C., the sufficient tensile strength may fail to be generated in the surface part and, consequently, the reduction effect in eddy current may be limited. On the other hand, if the siliconizing process is performed at more than 1250° C., a liquid phase may disadvantageously be formed in a portion of the surface part which has the highest Si concentration. This may lead to the rupture, wrinkling, and warpage of the steel sheet. Accordingly, the temperature at which the siliconizing process is performed is limited to 1100° C. to 1250° C.",
                                "Subsequent to the siliconizing process, a diffusion treatment in which the steel sheet is maintained for a predetermined amount of time at 1100° C. to 1250° C. in a non-oxidizing atmosphere that does not contain Si until the thickness of the surface part that is in the ferrite phase reaches a predetermined thickness is performed. Specifically, the diffusion treatment is performed until the thickness of the surface part that is in the ferrite phase reaches 10% to 40% of the thickness of the steel sheet.",
                                "Subsequent to the siliconizing process and the diffusion treatment, the steel sheet is cooled to 400° C. at an average cooling rate of 5 to 30° C./s. If the average cooling rate is less than 5° C./s, relaxation of the internal stress may occur and, consequently, the reduction effect in eddy-current loss may fail to be achieved at a sufficient level. On the other hand, if rapid cooling is performed at a cooling rate of more than 30° C./s, the microstructure of the inner part of the steel sheet may become distorted in various directions. This significantly degrades soft magnetic properties. Accordingly, to achieve good direct-current magnetic properties, it is necessary to perform cooling at an average cooling rate of 5 to 30° C./s until the temperature reaches at least 400° C."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "specify Si concentration range",
                                "explain effect of low Si concentration",
                                "explain effect of high Si concentration",
                                "justify Si concentration range",
                                "introduce Mn",
                                "explain effect of low Mn concentration",
                                "explain effect of high Mn concentration",
                                "justify Mn concentration range",
                                "introduce P",
                                "explain effect of high P concentration",
                                "justify P concentration limit",
                                "introduce S",
                                "explain effect of high S concentration",
                                "justify S concentration limit",
                                "introduce Al",
                                "explain effect of Al on specific resistance",
                                "explain effect of high Al concentration",
                                "justify Al concentration range",
                                "introduce N",
                                "explain effect of high N concentration",
                                "justify N concentration limit",
                                "describe production method",
                                "describe siliconizing process",
                                "describe diffusion treatment"
                            ],
                            "num_characters": 12060,
                            "outline_medium": [
                                "specify Si concentration range",
                                "explain effect of low Si concentration",
                                "explain effect of high Si concentration",
                                "specify Mn concentration range",
                                "explain effect of low Mn concentration",
                                "explain effect of high Mn concentration",
                                "specify P concentration limit",
                                "explain effect of high P concentration",
                                "specify S concentration limit",
                                "explain effect of high S concentration",
                                "specify Al concentration range",
                                "explain effect of high Al concentration"
                            ],
                            "outline_short": [
                                "specify Si concentration range",
                                "explain effect of low Si concentration",
                                "explain effect of high Si concentration",
                                "specify Mn concentration range",
                                "explain effect of Mn concentration",
                                "specify other element concentrations"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce steel sheets and methods",
                        "describe Si-gradient steel sheet structure",
                        "explain stress distribution in Si-gradient steel sheet",
                        "prepare samples with different crystal grain forms",
                        "measure properties of samples",
                        "determine aspect ratio of crystal grains",
                        "illustrate relationship between aspect ratio and iron loss",
                        "describe limitations of basic structure of steel sheet",
                        "explain importance of Si concentration distribution",
                        "describe boundary part in Si-gradient steel sheet",
                        "explain cracking and chipping in crystal grains",
                        "describe effect of aspect ratio on iron loss",
                        "specify average aspect ratio of crystal grains",
                        "describe texture of surface part and inner part",
                        "specify thickness of surface part",
                        "explain effect of thickness of surface part on eddy-current loss",
                        "specify average Si concentration in surface part",
                        "specify average Si concentration in inner part",
                        "explain effect of Si concentration gap on eddy-current loss",
                        "specify Si concentration gap in boundary part",
                        "describe stress distribution in surface part and inner part",
                        "specify tensile stress in surface part and compressive stress in inner part",
                        "explain effect of thickness of steel sheet on eddy-current loss",
                        "specify thickness of steel sheet",
                        "describe production method of electrical steel sheet",
                        "explain limitation of composition of material to be siliconized",
                        "specify C concentration in material",
                        "explain effect of C concentration on soft magnetic properties",
                        "describe preferred C concentration range",
                        "conclude description of electrical steel sheet"
                    ],
                    "num_characters": 15467,
                    "outline_medium": [
                        "introduce steel sheets and methods",
                        "describe Si-gradient steel sheet structure",
                        "explain stress distribution in steel sheet",
                        "prepare samples with different crystal grain forms",
                        "measure aspect ratio of crystal grains",
                        "illustrate relationship between aspect ratio and iron loss",
                        "describe limitations of basic structure of steel sheet",
                        "explain importance of Si concentration distribution",
                        "describe boundary part and its effects",
                        "specify average aspect ratio of crystal grains",
                        "describe importance of aspect ratio in reducing iron loss",
                        "specify thickness of surface part",
                        "specify average Si concentration in surface part",
                        "specify average Si concentration in inner part",
                        "specify Si concentration gap in boundary part"
                    ],
                    "outline_short": [
                        "introduce Si-gradient steel sheet",
                        "describe method of producing electrical steel sheet",
                        "explain stress distribution in steel sheet",
                        "discuss limitations of basic structure of steel sheet",
                        "describe importance of average aspect ratio of crystal grains",
                        "specify conditions for reducing iron loss",
                        "describe production method of electrical steel sheet"
                    ]
                },
                {
                    "title": "Example 1",
                    "paragraphs": [
                        "Our steel sheets and methods are described more in detail with reference to Examples below.",
                        "Ingots having the compositions described in Table 1 with the balance being Fe and inevitable impurities were heated to 1100° C., hot-rolled to a thickness of 2.3 mm, and then cold-rolled to a thickness of 0.2 mm. Specimens that were to be siliconized and had a width of 50 mm and a length of 150 mm were taken from each of the resulting cold-rolled steel sheets. The specimens were heated in an argon atmosphere from room temperature to the temperature range of 1100° C. to 1225° C., in which the austenite phase is formed, while the specimens were transported. Subsequently, an argon gas containing silicon tetrachloride at a concentration of 8% to 66% by volume was charged into the furnace, and a siliconizing process was performed at the same temperature as above for 1 to 6 minutes. Then, the atmosphere in the furnace was replaced with a non-oxidizing atmosphere that was an argon gas that did not contain silicon tetrachloride, and a diffusion treatment was performed at 1100° C. to 1250° C. for 2 to 30 minutes. The amount of silicon used, that is, the amount of Si added to each of the steel sheets, was adjusted by changing the concentration of silicon tetrachloride in the atmosphere and the amount of time during which the treatment was performed. The thickness of the surface part, which is to be transformed from the austenite phase into the ferrite phase by diffusing Si from the surface, was adjusted by changing the amount of time during which the siliconizing process was performed and the amount of time during which the diffusion treatment was performed. In the subsequent step, the Si concentration distribution in a cross section of each of the steel sheets was determined by EPMA (electron beam microanalyzer). For each of Test Nos., 12 samples having the same shape were prepared under the same treatment conditions.",
                        "The samples that had been subjected to the siliconizing process and the diffusion treatment were then transported in a nitrogen atmosphere to the room temperature region to be cooled to 400° C. or less at an average cooling rate of 15° C./s. The samples were removed when the temperature reached 100° C. or less. We confirmed that samples prepared under the same conditions contained the same amount of silicon by determining the change in the mass of each of the samples which occurred during the treatments.",
                        "One of the 12 samples taken from each of Test Nos. was again heated in an argon atmosphere and subjected to an additional heating treatment in the ferrite phase region of 900° C. until the Si distribution in the sample became uniform in the thickness direction of the steel sheet.",
                        "One of the surfaces of another one of the 12 samples was covered with an adhesive label, and a portion of the sample that extended from the other surface to the center of the sample in the thickness direction was removed by chemical polishing with hydrofluoric acid. The results of observation of warpage of the sample confirmed that the sample had a stress distribution such that a tensile stress was generated in the surface part and a compressive stress was generated in the inner part.",
                        "Each of the other 10 samples was subjected to a precision shearing machine for thin sheets to cut both ends of the sample at positions 10 mm from the respective ends in the width direction with an appropriate blade clearance. Hereby, single-sheet samples for magnetic property evaluation which had a width of 30 mm were prepared. In the magnetic measurement, a single-sheet testing frame with which a sample having a width of 30 mm and a length of 100 mm can be excited and the magnetic properties of the sample can be evaluated was used and the iron loss (W1/10 k) of each of the samples was measured in accordance with a method (Epstein test method) conforming to JIS C2550.",
                        "Subsequent to the above measurement, the samples were cut with a high-speed rotary cutter for microstructure testing. The microstructure of each of the samples was determined with an optical microscope. Furthermore, the Si concentration distribution in each of the samples in the thickness direction was determined by EPMA.",
                        "In the above-described manner, the average Si concentration in the inner part, the Si concentration at the surface of the steel sheet, the average Si concentration in the surface part, the ratio of the thickness of the surface part to the thickness of the steel sheet, the average aspect ratio of crystal grains included in the surface part, the Si concentration gap in the boundary part, saturation magnetic flux density Bs, the average m of iron losses at high frequencies W1/10 k of samples excited at a magnetic flux density of 0.1 T and 10 kHz, the standard deviation σ thereof, and the coefficient of variation σ/m were measured. In addition, the iron loss W1/10 k of the sample (Si-uniform material) having a uniform Si concentration was measured, and the ratio of the average iron loss of the Si-gradient material determined above to the iron loss of the Si-uniform material was calculated for each of Test Nos. Table 2 summarizes the results.",
                        "The results described in Table 2 confirm that, in our Examples, where the average aspect ratio of crystal grains included in the surface part was 0.7 or more and 4.0 or less, iron loss at high frequencies was low, the coefficient of variations in iron loss was 2.4% to 5.5%, which is small. That is, the degree of variations in iron loss was small.",
                        "In contrast, in the Comparative examples, where the average aspect ratio of crystal grains included in the surface part was less than 0.7 or more than 4.0, the coefficient of variation was more than 10%. That is, the degree of variations in iron loss was large.",
                        "Furthermore, the ratio of, to the iron loss of the sample having a uniform Si concentration, the average iron loss of the other samples was 0.9 or less. This confirms that the samples prepared in our Examples, in which the specific Si concentration distribution was set to create a stress distribution such that a tensile stress is generated in the surface part and a compressive stress is generated in the inner part, had a lower iron loss than the samples having a uniform Si concentration."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe steel sheet preparation",
                        "perform siliconizing process",
                        "perform diffusion treatment",
                        "adjust Si concentration distribution",
                        "prepare samples for magnetic property evaluation",
                        "measure iron loss",
                        "determine microstructure",
                        "determine Si concentration distribution",
                        "measure iron loss of Si-uniform material",
                        "calculate ratio of iron losses",
                        "summarize results",
                        "conclude iron loss reduction"
                    ],
                    "num_characters": 6280,
                    "outline_medium": [
                        "describe steel sheet preparation",
                        "perform siliconizing process",
                        "perform diffusion treatment",
                        "measure Si concentration distribution",
                        "evaluate magnetic properties",
                        "summarize results"
                    ],
                    "outline_short": [
                        "describe steel sheet preparation",
                        "perform siliconizing and diffusion treatments",
                        "measure magnetic properties and microstructure"
                    ]
                },
                {
                    "title": "Example 2",
                    "paragraphs": [
                        "Ingots having the compositions described in Table 3 with the balance being Fe and inevitable impurities were heated to 1100° C., hot-rolled to a thickness of 2.3 mm, and then cold-rolled to a thickness of 0.5 to 0.08 mm. Specimens that were to be siliconized and had a width of 50 mm and a length of 150 mm were taken from each of the resulting cold-rolled steel sheets. The specimens were heated in an argon atmosphere from room temperature to the temperature range of 1200° C., in which the austenite phase is formed, while the specimens were transported. Subsequently, an argon gas containing silicon tetrachloride at a concentration of 8% to 57% by volume was charged into the furnace, and a siliconizing process was performed at the same temperature as above for 1 to 10 minutes. Then, the atmosphere in the furnace was replaced with a non-oxidizing atmosphere that was an argon gas that did not contain silicon tetrachloride, and a diffusion treatment was performed at 1200° C. for 2 to 40 minutes. The amount of silicon used, that is, the amount of Si added to each of the steel sheets, was adjusted by changing the concentration of silicon tetrachloride in the atmosphere and the amount of time during which the treatment was performed. The thickness of the surface part, which is to be transformed from the austenite phase into the ferrite phase by diffusing Si from the surface, was adjusted by changing the amount of time during which the siliconizing process was performed and the amount of time during which the diffusion treatment was performed. In the subsequent step, the Si concentration distribution in a cross section of each of the steel sheets was determined by EPMA (electron beam microanalyzer). For each of Test Nos., 11 samples having the same shape were prepared.",
                        "The samples that had been subjected to the above treatments were transported in a nitrogen atmosphere to the room temperature region to be cooled to 400° C. or less at a cooling rate of 15° C./s. The samples were removed when the temperature was reduced to 100° C. or less. We confirmed that samples prepared under the respective conditions contained the same amount of silicon by determining the change in the weight of each of the samples which occurred during the treatments.",
                        "One of the 11 samples taken from each of Test Nos. was covered with an adhesive label, and a portion of the sample that extended from the other surface to the center of the sample in the thickness direction was removed by chemical polishing with hydrofluoric acid. The results of observation of warpage of the sample confirmed that the sample had a stress distribution such that a tensile stress was generated in the surface part and a compressive stress was generated in the inner part.",
                        "Each of the other 10 samples was subjected to a precision shearing machine for thin sheets to cut both ends of the sample at positions 10 mm from the respective ends in the width direction with an appropriate blade clearance. Hereby, single-sheet samples for magnetic property evaluation which had a width of 30 mm were prepared. In the magnetic measurement, a single-sheet testing frame with which a sample having a width of 30 mm and a length of 100 mm can be excited and the magnetic properties of the sample can be evaluated was used and the iron loss (W1/10 k) of each of the samples was measured in accordance with a method (Epstein test method) conforming to JIS C2550.",
                        "Subsequent to the above measurement, the samples were cut with a high-speed rotary cutter for microstructure testing. The microstructure of each of the samples was determined with an optical microscope. Furthermore, the Si concentration distribution in each of the samples in the thickness direction was determined by EPMA.",
                        "In the above-described manner, the Si concentration at the surface of the steel sheet, the average Si concentration in the surface part, the ratio of the thickness of the surface part to the thickness of the steel sheet, the average aspect ratio of crystal grains included in the surface part, the Si concentration gap in the boundary part, the average m of iron losses at high frequencies W1/10 k of samples excited at a magnetic flux density of 0.1 T and 10 kHz, the standard deviation σ thereof, and the coefficient of variation σ/m were measured. Table 4 summarizes the results.",
                        "The results described in Table 4 confirm that, in our Examples, where the aspect ratio of crystal grains included in the surface part was 0.7 or more and 4.0 or less, iron loss at high frequencies was low, the coefficient of variations in iron loss was about 5%, which is small. That is, the degree of variations in iron loss was small. In contrast, in the Comparative examples, where the aspect ratio of crystal grains included in the surface layer was less than 0.7 or more than 4.0, the coefficient of variation was more than 10%. That is, the degree of variations in iron loss was large."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe steel sheet preparation",
                        "perform siliconizing process",
                        "perform diffusion treatment",
                        "adjust Si concentration distribution",
                        "prepare samples for magnetic property evaluation",
                        "measure iron loss",
                        "determine microstructure",
                        "determine Si concentration distribution",
                        "summarize results"
                    ],
                    "num_characters": 4938,
                    "outline_medium": [
                        "describe steel sheet preparation",
                        "perform siliconizing process",
                        "evaluate magnetic properties",
                        "summarize results"
                    ],
                    "outline_short": [
                        "describe steel sheet preparation and treatments",
                        "measure magnetic properties and microstructure"
                    ]
                },
                {
                    "title": "Example 3",
                    "paragraphs": [
                        "Ingots having the compositions described in Table 5 with the balance being Fe and inevitable impurities were heated to 1100° C., hot-rolled to a thickness of 2.3 mm, and then cold-rolled to a thickness of 0.2 mm. Specimens that were to be siliconized and had a width of 50 mm and a length of 150 mm were taken from each of the resulting cold-rolled steel sheets. The specimens were heated in an argon atmosphere from room temperature to the temperature range of 1100° C. to 1250° C., in which the austenite phase is formed, while the specimens were transported. Subsequently, an argon gas containing silicon tetrachloride at a concentration of 10% to 30% by volume was charged into the furnace, and a siliconizing process was performed at the same temperature as above for 1 to 6 minutes. Then, the atmosphere in the furnace was replaced with a non-oxidizing atmosphere that was an argon gas that did not contain silicon tetrachloride, and a diffusion treatment was performed at 1100° C. to 1250° C. for 2 to 30 minutes. The amount of silicon used, that is, the amount of Si added to each of the steel sheets, was adjusted by changing the concentration of silicon tetrachloride in the atmosphere and the amount of time during which the treatment was performed. The thickness of the surface part, which is to be transformed from the austenite phase into the ferrite phase by diffusing Si from the surface, was adjusted by changing the amount of time during which the siliconizing process was performed and the amount of time during which the diffusion treatment was performed. In the subsequent step, the Si concentration distribution in a cross section of each of the steel sheets was determined by EPMA (electron beam microanalyzer). For each of Test Nos., 12 samples having the same shape were prepared.",
                        "The samples that had been subjected to the above treatments were transported in a nitrogen atmosphere to the room temperature region to be cooled to 400° C. or less at a cooling rate of 15° C./s. The samples were removed when the temperature was reduced to 100° C. or less. We confirmed that samples prepared under the respective conditions contained the same amount of silicon by determining the change in the weight of each of the samples which occurred during the treatments.",
                        "One of the 12 samples taken from each of Test Nos. was again heated in an argon atmosphere and subjected to an additional heating treatment in the ferrite phase region of 900° C. until the Si distribution in the sample became uniform in the thickness direction of the steel sheet.",
                        "One of the surfaces of another one of the 12 samples was covered with an adhesive label, and a portion of the sample that extended from the other surface to the center of the sample in the thickness direction was removed by chemical polishing with hydrofluoric acid. The results of observation of warpage of the sample confirmed that the sample had a stress distribution such that a tensile stress was generated in the surface part and a compressive stress was generated in the inner part.",
                        "Each of the other 10 samples was subjected to a precision shearing machine for thin sheets to cut both ends of the sample at positions 10 mm from the respective ends in the width direction with an appropriate blade clearance. Hereby, single-sheet samples for magnetic property evaluation which had a width of 30 mm were prepared. In the magnetic measurement, a single-sheet testing frame with which a sample having a width of 30 mm and a length of 100 mm can be excited and the magnetic properties of the sample can be evaluated was used and the iron loss (W1/10 k) of each of the samples was measured in accordance with a method (Epstein test method) conforming to JIS C2550.",
                        "Subsequent to the above measurement, the samples were cut with a high-speed rotary cutter for microstructure testing. The microstructure of each of the samples was determined with an optical microscope. Furthermore, the Si concentration distribution in each of the samples in the thickness direction was determined by EPMA.",
                        "Subsequent to the above measurement, the samples were cut with a high-speed rotary cutter for microstructure testing. The microstructure of each of the samples was determined with an optical microscope. Furthermore, the Si concentration distribution in each of the samples in the thickness direction was determined by EPMA.",
                        "In the above-described manner, the average Si concentration in the inner part, the Si concentration at the surface of the steel sheet, the average Si concentration in the surface part, the ratio of the thickness of the surface part to the thickness of the steel sheet, the average aspect ratio of crystal grains included in the surface part, the Si concentration gap in the boundary part, saturation magnetic flux density Bs, the average m of iron losses at high frequencies W1/10 k of samples excited at a magnetic flux density of 0.1 T and 10 kHz, the standard deviation σ thereof, and the coefficient of variation σ/m were measured. In addition, the iron loss W1/10 k of the sample (Si-uniform material) having a uniform Si concentration was measured, and the ratio of the average iron loss of the Si-gradient material determined above to the iron loss of the Si-uniform material was calculated for each of Test Nos. Table 6 summarizes the results.",
                        "The samples in which the ratio ds/d0 of the thickness of the surface part to the thickness of the steel sheet, which is a preferable condition, was less than 10% or more than 40% had a low iron-loss. However, the reductions in iron loss were smaller than reductions in the iron loss of the samples having a ratio ds/d0 of 10% to 40%. On the other hand, the ratio of the iron loss of the sample in which the Si concentration gap in the boundary part was 0.1% to the iron loss of the sample having a uniform Si concentration was close to 1. That is, the iron loss of the sample was not reduced substantially by the formation of the Si concentration distribution.",
                        "In our Examples, where the ds/d0 ratio was 10% or more and 40% or less, the Si concentration gap in the boundary part was 0.2% or more, and the average aspect ratio of crystal grains included in the surface part was 0.7 or more and 4.0 or less, iron loss was reduced by 10% or more compared to when the Si concentration was made uniform. In addition, the coefficient of variation was less than 10%. That is, the degree of variations in iron loss was reduced to a sufficiently low level."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe steel sheet preparation",
                        "perform siliconizing process",
                        "perform diffusion treatment",
                        "adjust Si concentration distribution",
                        "prepare samples for magnetic property evaluation",
                        "measure iron loss",
                        "determine microstructure",
                        "determine Si concentration distribution",
                        "measure iron loss of Si-uniform material",
                        "calculate ratio of iron losses",
                        "summarize results",
                        "conclude iron loss reduction"
                    ],
                    "num_characters": 6489,
                    "outline_medium": [
                        "describe steel sheet preparation",
                        "perform siliconizing process",
                        "perform diffusion treatment",
                        "measure Si concentration distribution",
                        "evaluate magnetic properties",
                        "summarize results"
                    ],
                    "outline_short": [
                        "describe steel sheet preparation and treatments",
                        "measure magnetic properties and microstructure",
                        "analyze results and compare to uniform Si concentration"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1.-6. (canceled)",
        "7. An electrical steel sheet comprising:\na surface part in which a Si concentration in the steel sheet changes continuously from a high Si concentration to a low Si concentration in a thickness direction of the steel sheet from a surface of the steel sheet, as defined by a symmetry plane located at the center of the steel sheet in the thickness direction,\na boundary part in which the Si concentration changes discontinuously, and\nan inner part in which the Si concentration does not change substantially in the thickness direction of the steel sheet, the inner part including the center of the steel sheet in the thickness direction, wherein\nthe electrical steel sheet has a stress distribution such that an in-plane tensile stress is generated in the surface part and an in-plane compressive stress is generated in the inner part,\nan average aspect ratio of crystal grains included in the surface part defined as a ratio of a dimension of the crystal grains in a direction parallel to the surface of the steel sheet to a dimension of the crystal grains in a direction (depth direction) perpendicular to the surface of the steel sheet, being 0.7 or more and 4.0 or less,\nthe average aspect ratio is the average of aspect ratios of 50 or more crystal grains and, when a crystal grain included in the surface part extends to the inner part beyond the boundary part, the dimension of the crystal grain in the direction (depth direction) perpendicular to the surface of the steel sheet includes a portion of the crystal grain which is included in the inner part.",
        "8. The electrical steel sheet according to claim 7, wherein the thickness of the surface part is 10% to 40% of the thickness of the steel sheet.",
        "9. The electrical steel sheet according to claim 7, wherein the average Si concentration in the surface part is 2.5% to 6.5% by mass and the average Si concentration in the inner part is 2.0% or less by mass.",
        "10. The electrical steel sheet according to claim 8, wherein the average Si concentration in the surface part is 2.5% to 6.5% by mass and the average Si concentration in the inner part is 2.0% or less by mass.",
        "11. The electrical steel sheet according to claim 7, wherein a tensile stress of 50 to 200 MPa is generated in the surface part in the direction parallel to the surface of the steel sheet, and a compressive stress of 50 to 200 MPa is generated in the inner part in the direction parallel to the surface of the steel sheet.",
        "12. The electrical steel sheet according to claim 8, wherein a tensile stress of 50 to 200 MPa is generated in the surface part in the direction parallel to the surface of the steel sheet, and a compressive stress of 50 to 200 MPa is generated in the inner part in the direction parallel to the surface of the steel sheet.",
        "13. The electrical steel sheet according to claim 9, wherein a tensile stress of 50 to 200 MPa is generated in the surface part in the direction parallel to the surface of the steel sheet, and a compressive stress of 50 to 200 MPa is generated in the inner part in the direction parallel to the surface of the steel sheet.",
        "14. The electrical steel sheet according to claim 10, wherein a tensile stress of 50 to 200 MPa is generated in the surface part in the direction parallel to the surface of the steel sheet, and a compressive stress of 50 to 200 MPa is generated in the inner part in the direction parallel to the surface of the steel sheet.",
        "15. The electrical steel sheet according to claim 7, the electrical steel sheet having a thickness of 0.03 to 0.5 mm.",
        "16. The electrical steel sheet according to claim 8, the electrical steel sheet having a thickness of 0.03 to 0.5 mm.",
        "17. The electrical steel sheet according to claim 9, the electrical steel sheet having a thickness of 0.03 to 0.5 mm.",
        "18. The electrical steel sheet according to claim 10, the electrical steel sheet having a thickness of 0.03 to 0.5 mm.",
        "19. The electrical steel sheet according to claim 11, the electrical steel sheet having a thickness of 0.03 to 0.5 mm.",
        "20. The electrical steel sheet according to claim 12, the electrical steel sheet having a thickness of 0.03 to 0.5 mm.",
        "21. The electrical steel sheet according to claim 13, the electrical steel sheet having a thickness of 0.03 to 0.5 mm.",
        "22. The electrical steel sheet according to claim 14, the electrical steel sheet having a thickness of 0.03 to 0.5 mm.",
        "23. A method of producing an electrical steel sheet comprising:\nheating a steel sheet to 1100° C. to 1250° C. in a non-oxidizing atmosphere to transform the steel sheet into the austenite phase,\nthe steel sheet having a composition containing, by mass, C: 0.020% or less, Si: 0.15% to 2.0%, Mn: 0.05% to 2.00%, P: 0.1% or less, S: 0.01% or less, Al: 0.1% or less, and N: 0.01% or less, with the balance being Fe and inevitable impurities;\nsubsequently causing Si to penetrate a surface of the steel sheet at 1100° C. to 1250° C. in a non-oxidizing atmosphere containing 10 mol % or more and less than 45 mol % silicon tetrachloride to transform a surface layer of the steel sheet into the ferrite phase;\nsubsequently holding the steel sheet for a predetermined amount of time at 1100° C. to 1250° C. in a non-oxidizing atmosphere that does not contain Si until a thickness of a surface part that is in the ferrite phase reaches 10% to 40% of the thickness of the steel sheet, while maintaining the austenite phase in an inner part; and\nsubsequently cooling the steel sheet to 400° C. at an average cooling rate of 5 to 30° C./s."
    ]
}