{
    "id": "https://semopenalex.org/work/W2003044934",
    "authors": [
        "Shinong Long",
        "Michel Vellard",
        "Elaine Phan"
    ],
    "title": "The Expression of Soluble and Active Recombinant<i>Haemophilus influenzae</i>IgA1 Protease in<i>E. coli</i>",
    "date": "2010-01-01",
    "abstract": "Immunoglobulin A1 (IgA1) proteases from Haemophilus influenzae are extracellular proteases that specifically cleave the hinge region of human IgA1, the predominant class of immunoglobulin present on mucosal membranes. The IgA1 proteases may have the potential to cleave IgA1 complexes in the kidney and be a therapeutic agent for IgA1 nephropathy (IgAN), a disease characterized by deposition of the IgA1 antibody in the glomerulus. We have screened for the expression of recombinant H. influenzae IgA1 protease by combining various expression plasmids, IgA1 protease constructs, and E. coli strains under multiple conditions. Using the method we have developed, approximately 20-40 mg/L of soluble and active H. influenzae IgA1 protease can be produced from E. coli strain C41(DE3), a significant increase in yield compared to the yield upon expression in H. influenzae or other related bacteria.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Immunoglobulin A1 (IgA1) proteases from bacteria, such as Neisseria meningitidis, Neisseria gonorrhoeae, Haemophilus influenzae, Streptococcus pneumoniae, Streptococcus sanguis, Streptococcus oralis, Streptococcus mitis, Clostridium ramosum, Prevotella melaninogenica, and other bacterial strains are a group of proteases that specifically cleave the IgA1 hinge region of human IgA1 and some great apes. IgA1 proteases neither cleave human IgA2, IgG, and IgM nor do they cleave IgA from mice, rat, or even monkey [1][2][3]. The C. ramosum IgA protease, in addition, cleaves human IgA2m(1) allotype [4]. In addition to the IgA1 hinge length and composition [5][6][7], structures in the Fc region [8] and different sites in the CH3 domain [9] of IgA1 are required for cleavage.",
                "IgA1 proteases are comprised of at least three families having different structural forms including serine-, metallo-, and cysteine-type proteases. The serine type IgA1 proteases are expressed as a precursor protein comprising a signal peptide, an IgA1 protease domain, and a C-terminal α protein and β-core domain. The C-terminal β-core domain targets the protein to the cell membrane and facilitates secretion of a α protein-protease domain polypeptide. The β domain and α protein are cleaved from the precursor polypeptide leaving the protease domain as the mature protease. The metallo-type IgA1 proteases comprise a signal sequence and propeptide which aids in anchoring the peptide to the cell membrane and contains several sites for metal ion (e.g., zinc) binding in the protease domain. The structure for the cysteine-type IgA1 protease has yet to be determined. The IgA1 proteases of H. influenzae and Neisseria species are of the serine type. For serine type IgA1 proteases, cleavage between proline and serine is designated as type 1 whereas cleavage between proline and threonine is designated as type 2. Those IgA1 proteases produced by streptococcal species are of the metallo type; the C. ramosum IgA protease has a unique sequence and is a different type of metalloproteinase. The cysteine types of IgA1 proteases are produced by Prevotella species [4,[10][11][12][13][14][15].",
                "IgA nephropathy (IgAN), a disease characterized by deposition of the IgA1 antibody in the glomerulus, can lead to kidney dysfunction and, in certain cases, kidney failure [16]. Exogenous proteolytic enzymes have been tested as therapy to treat IgA1 deposition in animal models in an attempt to remove IgA1 deposits in the kidneys. The administered proteases, chymopapain and subtilisin, act by proteolytic cleavage of IgA1 deposits in the kidney but are not specific for IgA1 molecules and digest a variety of other proteins [17,18]. The IgA1-specific IgA1 protease from H. influenzae has been used to treat IgAN in animal models. The H. influenzae IgA1 protease reduced the deposition of glomerular IgA1 immune complexes in a passive mouse model [19]. IgA1 protease may have potential as a therapeutic agent for IgAN. Production of IgA1 protease in amounts sufficient for therapeutic use has not been achieved due to the low natural production of the protein in naturally producing cells such as H. influenzae, N. gonorrhoeae, and N. meningitidis. Moreover, H. influenzae, N. gonorrhoeae, and N. meningitidis are pathogenic bacterial species, and H. influenzae requires hemin for growth which makes it impractical for production of IgA1 proteases at a large scale. The soluble and active IgA1 proteases from S. pneumoniae, S. suis, and C. ramosum have been expressed in E. coli at a low yield [4,20,21]. We report here a method of expressing only the protease domain (without α protein and β-core domain) of H. influenzae IgA1 protease in E. coli, wherein the yield and total recovery of soluble and active recombinant IgA1 protease are significantly increased compared to previous methods."
            ],
            "subsections": []
        },
        {
            "title": "Materials and Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Cloning of IgA1",
                    "paragraphs": [
                        "Protease into Expression Vectors. IgA1 protease-encoding DNA fragments were amplified from pFG26 plasmid (from Jiazhou Qiu and Andrew G. Plaut of Tufts Medical Center, containing full-length wild-type H. influenzae IgA protease gene, GenBank: X59800) by PCR using different pair of primers (Figure 1 and Table 1). Amplified PCR fragments were digested with Nde I and BamHI and cloned into pET21a (Novagen) and pColdIV (Takara) vectors (Table 1)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Expression of IgA1",
                    "paragraphs": [
                        "Protease in E. coli. Bacterial strains [BL21(DE3), BL21(DE3)pLysS, ArcticExpress(DE3) (Stratagene); BL21(DE3)pGro7 (Takara); C41(DE3), C43(DE3), C41(DE3)pLysS, C43(DE3)pLysS (Lucigen); Origami B(DE3), Origami B(DE3)pLysS, Tuner(DE3) (Novagen); KRX (Promega)] containing plasmids (pET-IGAN, pET-S-IGAN, pCold-IGAN, or pCold-S-IGAN) were cultured in 4 ml LB medium containing 100 μg/ml of carbenicillin at 37 • C with shaking. When OD 600 of bacterial culture reached 0.6, IPTG was added to a final concentration of 0.2-1 mM and incubated at 12 • C-30 • C for 3-24 hours with shaking. Bacterial cell pellets were collected by centrifugation at 5000 rpm and 4 • C for 10 minutes and lysed with 1 ml B-PER II Bacterial Extraction Reagent (Thermo) with Benzonase Nuclease (Novagen). The total cell lysates were centrifuged at 14000 rpm and 4 • C for 15 minutes. The supernatants were assayed for protein concentration with BCA protein Assay Reagent (Thermo) and adjusted to have the same total protein concentration with B-PER II."
                    ],
                    "subsections": []
                },
                {
                    "title": "Immunodetection of IgA1",
                    "paragraphs": [
                        "Protease Expression. Total cell lysates or soluble supernatants were separated by SDS-PAGE (reduced gel) and electrotransferred to a nitrocellulose membrane with iBlot (Invitrogen). The membrane was blocked with 5% non-fat milk powder in TBS-T buffer (TBS containing 0.05% Tween 20) and incubated with rabbit antihis polyclonal Ab (Abcam, 0.4 μg/ml) at RT for 2 hours. The membrane was washed three times with TBS-T buffer and incubated with AP-conjugated antirabbit IgG (Promega, 0.2 μg/ml) at RT for 1 hour. The membrane was washed three times with TBS buffer, and the expressed proteins were visualized by adding 10 ml Western Blue Stabilized Substrate (Promega)."
                    ],
                    "subsections": []
                },
                {
                    "title": "IgA1 Protease Activity Assay. The activity of IgA1",
                    "paragraphs": [
                        "proteases from cell lysates and supernatants was determined by Western blotting. The positive control (purified IgA1 protease from H. influenzae, supplied by Jiazhou Qiu and Andrew G. Plaut of Tufts Medical Center) and negative controls as well as 10 μl of cell lysates or soluble supernatants were added to 10 μl of human IgA1 (1 mg/ml, supplied by CalBiochem and Paul Fitzpatrick of BioMarin), mixed well and incubated at 37 • C overnight. The samples were separated by SDS-PAGE (reduced gel) and electrotransferred to a nitrocellulose membrane with iBlot (Invitrogen). The membrane was blocked with 5% non-fat milk powder in TBS-T buffer (TBS containing 0.05% Tween 20) and incubated with mouse anti-IgA-Fab mAb (CalBiochem, 0.4 μg/ml) at RT with shaking for 2 hours. The membrane was washed three times with TBS-T buffer and incubated with AP-conjugated antimouse IgG (Promega, 0.2 μg/ml) at RT with shaking for 1 hour. The membrane was washed three times with TBS buffer, and the expressed proteins were visualized by adding 10 ml Western Blue Stabilized Substrate (Promega).",
                        "The activity of purified IgA1 protease was analyzed with an Experion automated electrophoresis system (Bio-Rad). Eight μL of purified IgA1 (1600 ng/μL) was added to a PCR tube containing 1 μL of IgA1 protease sample, and the resulting mixture was incubated in a heat block at 37 • C for 1 min. The reaction was stopped by the addition of 5 μL of sample buffer to the reaction tube followed by vortexing. Standard samples were prepared by the addition of 5 μL of sample buffer to tubes containing 9 μL of standard IgA1 (1600, 400, 100, 25, and 0 ng/μL). The samples were heated at 95-100 • C for 3-5 min and centrifuged briefly. Two hundred and ten μl of deionized water (0.2 micron-filtered, not autoclaved) was added to the samples and mixed well by vortexing. The proteolytic activity of the IgA1 protease was measured as the decrease in IgA1 concentration per minute (ng/μL/min/ng of IgA1 protease)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Screening Soluble IgA1",
                    "paragraphs": [
                        "Protease Expression Levels with ELISA. One hundred μl of cell lysate supernatant, as well as IgA1 protease control, was added to the wells of an ELISA plate (Nunc Maxisorp) and incubated overnight at 4 • C. The plate was washed 3 times with PBST (PBS + 0.05% Tween-20) and blocked with Blocking Buffer (PBST + 3% BSA) at RT for 1-2 hr. Following the incubation, the plate was washed 3 times again with PBST and incubated with 100 μl of rabbit anti-His polyclonal Ab (Abcam, 0.4 μg/ml) at RT with shaking for 2 hours. The plate was then washed 3 times with PBST buffer and incubated with 100 μl of HRP-conjugated antirabbit IgG H&L (Abcam, 0.1 μg/ml) at RT with shaking for 1 hour. Finally, the plate was washed 4 times with PTBST buffer. The 1-Step Turbo TMB-ELISA solution (Pierce) was added to the wells and incubated in the dark for 5 to 30 minutes. Stop solution (1-2 M sulfuric acid) was added to the wells to stop the reaction, and the OD 450 was measured with a plate reader."
                    ],
                    "subsections": []
                },
                {
                    "title": "Purification of IgA1 Protease from E. coli C41 (DE3).",
                    "paragraphs": [
                        "The cell pellet was suspended in TBS buffer and homogenized by a high-pressure homogenizer. The homogenized samples were centrifuged at 12,000 rpm for 30 minutes at 4 • C, and the supernatant was filtered through a Sartorius filter. The filtered crude IgA1 protease was loaded onto the nickel column (IMAC Chelating Sepharose, GE Healthcare, charged with nickel sulfate). The bound protein was eluted by an imidazole gradient. The eluate fractions from the nickel column were diluted 10-fold with 25 mM tris, pH 8.0, and loaded onto the Q sepharose column (Q sepharose FF, GE Healthcare). The unbound flow through fraction was concentrated by tangential flow filtration (Vivaflow200, 30 kDa PES, Sartorius) and loaded onto a S300 SEC column (S300 Sephacryl HR-GE Healthcare).  "
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Expression of IgA1",
                    "paragraphs": [
                        "Proteases in E. coli. The serine-type IgA1 protease is initially translated as a precursor composed of four functional domains: (i) an amino terminal signal peptide to target it through the inner membrane to the periplasm; (ii) the mature protease domain; (iii) the αprotein domain, and (iv) the β-core domain for transport across the outer membrane. The β-core domain integrates into the outer membrane and forms a pore structure that the mature protease domain and the α-protein domain are translocated through the β-core domain channel into the extracellular space. The mature IgA1 protease is released by self-cleavage at three cleavage sites: a, b, and c (Figure 1) [10,22,23]. In here, only the mature protease domain with or without signal peptide was cloned and expressed in E. coli. The C-terminal His-tagged IgA1 protease domain with the signal peptide (S) was amplified by PCR and cloned into pET21a expression vector (using T7 promoter) and pCold IV expression vector (using cold shock promoter, expression occurs at low temperature) (pET-S-IGAN and pCold-S-IGAN) for periplasmic expression. The C-terminal His-tagged IgA1 protease domain only was also amplified by PCR and cloned into pET21a and pCold IV vectors (pET-IGAN and pCold-IGAN) for cytoplasmic expression (Figure 1 and Table 1). pET-S-IGAN and pET-IGAN were first expressed in BL21(DE3) cells induced with 1 mM IPTG at 30 • C for 3 hours. The majority of IgA1 proteases were detected in total cell lysates which are shown as a band with molecular weight around 100 kDa (Figure 2, Lanes 3, 5, 7, and 9) rather than the cell supernatants (Figure 2 "
                    ],
                    "subsections": []
                },
                {
                    "title": "Screening Soluble IgA1 Protease Expression Levels with",
                    "paragraphs": [
                        "ELISA. ELISA was used to quantify expression levels of IgA1 protease expressed by all four IgA protease constructs described above (pET-S-IGAN, pET-IGAN, pCold-S-IGAN, and pCold-IGAN), whose expression was induced at low temperature (12 • C) and low concentration of IPTG (0.4 mM) in various cell strains. The pET-IGAN construct resulted in the production of higher levels of soluble IgA1 protease in several cell strains (Table 2, in bold italic font).",
                        "We then tested the expression of pET-IGAN induced at various temperatures and concentrations of IPTG and in various cell strains. Overall, greater amounts of soluble IgA1 protease were produced at 20 • C with 0.4 mM IPTG in most cell strains. The C41 (DE3) strain produced the highest titer of protease under the same conditions compared with other E. coli strains used for recombinant expression (Table 2, in bold font). Finally, the best condition for producing soluble IgA1 protease in C41 (DE3) was screened by ELISA again. The C41 (DE3) E. coli strain containing pET-IGAN plasmid produced the highest level of soluble IgA1 protease when induced with 0.4 mM IPTG at 20 • C for 24 hours (Table 2, in italic font). And the expressed soluble IgA1 protease in C41 (DE3) was confirmed to have correct molecular weight (∼100 kDa) (Figure 5) and proteolytic activity (data not shown)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Characterization of IgA1",
                    "paragraphs": [
                        "Proteases. The soluble IgA1 protease was produced from E. coli strain C41 (DE3) containing pET-IGAN plasmid with 0.4 mM IPTG induction at 20 • C. The soluble IgA1 protease was purified by a nickel column and further purified by an anion-exchange column and a size-exclusion column to more than 95% pure (Figure 6, Lane 2: C41 IgA1 protease). The final yield of purified IgA1 protease was 20-40 mg/L from approximately 100 mg/L of total soluble expressed IgA1 protease. We have developed a novel IgA1 protease activity assay using an Experion automated electrophoresis system. The proteolytic activity of the IgA1 protease was measured as the decrease in IgA1 concentration per minute (ng/μL/min/ng of IgA1 protease).",
                        "Using the method we developed, the average activities of purified IgA1 protease from E. coli C41 (DE3) and IgA1 protease from H. influenzae (from Jiazhou Qiu and Andrew G. Plaut of Tufts Medical Center) were approximately 46 and 27 ng/μL/min per ng of IgA1 protease, respectively. The IgA1 protease produced from H. influenzae showed lower activity in this experiment probably due to impurity or degradation of the H. influenzae IgA1 protease sample (Figure 6, the extra low molecular weight band in the first line: HI IgA1 protease)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "The serine-type IgA1 protease precursor is composed of four domains: signal peptide, protease domain, α-protein domain, and β-core domain. The previous attempts to    produce natural IgA1 proteases from H. influenzae, N. gonorrhoeae, and N. meningitides resulted in a very low titer of total IgA1 proteases. Moreover, the yield of purified IgA1 proteases directly from the cell culture media was low (0.03 and <0.007 mg/L) [23,24]. It has been reported that IgA1 proteases are capable of being expressed in E. coli as inclusion bodies or being secreted to the media with reduced activity, or no activity, or in low yield of recovered recombinant IgA1 proteases [25][26][27]. Unlike previous attempts to express recombinant, full-length IgA1 protease precursor in E. coli, our approach was to screen four IgA1 protease constructs (pET-S-IGAN, pET-IGAN, pCold-S-IGAN, and pCold-IGAN) encoding polypeptides comprising the protease domain only (and lacking the α protein and βcore domains) in various E. coli strains. Various conditions for the expression of soluble and active IgA1 proteases were used. Our results demonstrated that all four IgA1 protease constructs were able to produce soluble and active IgA1 proteases in several E. coli strains when induced at low temperature and low concentration of IPTG. ELISA as well as activity assay showed that soluble, active IgA1 proteases were expressed in several E. coli strains over a range of culture temperatures and IPTG culture concentration. C41 (DE3) cells transformed with the pET-IGAN construct had the highest titer (approximately 100 mg/L) when induced with 0.4 mM IPTG at 20 • C. The titer is much higher than the previous report in which it has up to around 2 mg/L [23]. It is possible that the present methods can produce significant amounts of soluble and active IgA1 proteases because the host cells (e.g., E. coli) express only the protease domain and not the full-length precursor protein. Thus, the expressed polypeptide does not need to be cleaved into the mature protease, unlike previous recombinant expressions in H. influenzae and other bacteria. Because the IgA1 protease was expressed as a C-terminal his-tagged form, it was easily purified with much higher yield (20-40 mg/L), which is more than 1000-folds than the highest yield from previous report (0.03 mg/L) [23].",
                "We report, for the first time, the expression of only the IgA1 protease proteolytic domain without the α protein domain or the β-core domain, for recombinant production of soluble and active IgA1 proteases. The protease domain alone was confirmed to have full protease activity. Under optimized conditions, it was also expressed as soluble and active form in E. coli. This method uses E. coli instead of pathogenic bacteria such as H. influenzae, N gonorrhoeae, and N. meningitides. In addition, the significantly increased yield of the IgA1 proteases using the current method allows for production of the IgA1 proteases in amounts useful for administration to treat IgA nephropathy and other IgA1 deposition diseases."
            ],
            "subsections": []
        },
        {
            "title": "Acknowledgments",
            "paragraphs": [
                "The authors thank Jiazhou Qiu and Andrew G. Plaut of Tufts Medical Center for supplying plasmid pFG26 containing H. influenzae IgA1 protease gene and purified IgA1 protease from H. influenzae. The authors are grateful to BioMarin colleagues Paul Fitzpatrick for technical help, Melita Dvorak-Ewell for helpfully reviewing the manuscript, and Tim Taylor for conducting the fermentation."
            ],
            "subsections": []
        }
    ]
}