{
    "id": "https://semopenalex.org/work/W2048361834",
    "authors": [
        "Juan Pablo Maianti",
        "Maureen J. Charron",
        "Alan Saghatelian",
        "David Ruchien Liu",
        "Ralph E. Kleiner",
        "Malcolm A. Leissring",
        "Wei-Jen Tang",
        "Markus A. Seeliger",
        "Xiaoqing Du",
        "Zachariah H. Foda",
        "Amanda McFedries"
    ],
    "title": "Anti-diabetic activity of insulin-degrading enzyme inhibitors mediated by multiple hormones",
    "date": "2014-05-21",
    "abstract": "Despite decades of speculation that inhibiting endogenous insulin degradation might treat type-2 diabetes, and the identification of IDE (insulin-degrading enzyme) as a diabetes susceptibility gene, the relationship between the activity of the zinc metalloprotein IDE and glucose homeostasis remains unclear. Although Ide(-/-) mice have elevated insulin levels, they exhibit impaired, rather than improved, glucose tolerance that may arise from compensatory insulin signalling dysfunction. IDE inhibitors that are active in vivo are therefore needed to elucidate IDE's physiological roles and to determine its potential to serve as a target for the treatment of diabetes. Here we report the discovery of a physiologically active IDE inhibitor identified from a DNA-templated macrocycle library. An X-ray structure of the macrocycle bound to IDE reveals that it engages a binding pocket away from the catalytic site, which explains its remarkable selectivity. Treatment of lean and obese mice with this inhibitor shows that IDE regulates the abundance and signalling of glucagon and amylin, in addition to that of insulin. Under physiological conditions that augment insulin and amylin levels, such as oral glucose administration, acute IDE inhibition leads to substantially improved glucose tolerance and slower gastric emptying. These findings demonstrate the feasibility of modulating IDE activity as a new therapeutic strategy to treat type-2 diabetes and expand our understanding of the roles of IDE in glucose and hormone regulation.",
    "sections": [
        {
            "title": "METHODS SUMMARY",
            "paragraphs": [
                "The in vitro selection of the DNA-templated library 8 used 20 µg His 6 -tagged mouse IDE immobilized on cobalt magnetic beads (Invitrogen). IDE inhibition was assayed using the fluorogenic peptide Mca-RPPGFSAFK(Dnp)-OH (R&D), confirmed using an anti-insulin antibody time-resolved FRET assay (Cysbio), and a LCMS assay for CGRP cleavage fragments in plasma 9 . Macrocyclic inhibitors were synthesized by Fmoc-based solid-phase synthesis and purified by HPLC. LCMS quantitation of 6bK in biological samples was performed using 6bK synthesized with 13 C 6 , 15 N 2 lysine (Sigma-Aldrich).",
                "Wild-type lean and DIO C57BL/6J age-matched male mice (Jackson Laboratories) were used at 14-16, and 24-26 weeks respectively (> 20 weeks of high-fat diet). Gcgr -/-and Ide -/-mice were fully backcrossed to the C57BL/6J line, bred from heterozygous mice, and used between 11 and 21 weeks. Animals were fasted overnight 14 h for all experiments, except for the insulin tolerance test, which required 5 h of fasting during the morning. Blood glucose was measured from tail nicks using AccuCheck (Aviva) meters. Trunk blood was obtained for plasma hormone measurements using the Multiplexed Mouse Metabolic Hormone panel (Milliplex, EMD Millipore) on a Luminex FlexMap 3D instrument."
            ],
            "subsections": [
                {
                    "title": "Extended Data",
                    "paragraphs": [
                        "Extended Data Figure 1. a, Enrichment plots from two independent in vitro selections against N-His 6 -mIDE using a 13,824-membered DNA-templated macrocycle library 7,8 . The numbers highlight compounds enriched at least twofold in both selections. b, Structures of IDE-binding macrocycles 1-6 decoded from DNA library barcodes corresponding to building blocks A, B, C and D (Fig. 1). The cis and trans isomers are indicated by suffices a and b respectively (for example, 1a and 1b). The two isomers were synthesized as previously reported 18,19 and separated by HPLC. c, IDE inhibition potency of trans hits 1b to 6b compared to 30 structurally related 6b analogues in which the linker, scaffold and the three building blocks were systematically varied. IDE inhibition activity was assayed by following cleavage of the fluorogenic peptide substrate Mca-RPPGFSAFK(Dnp)-OH."
                    ],
                    "subsections": [
                        {
                            "title": "Extended Data Figure 2. Inhibition of human and mouse IDE activity in multiple assays",
                            "paragraphs": [
                                "a, b, Human IDE shares 95% sequence homology with mouse IDE 13 , and cleavage of the fluorogenic substrate peptide Mca-RPPGFSAFK(Dnp)-OH by human and mouse IDE is inhibited with similar potency by 6b (a) and 6bK (b). c, Homogeneous time-resolved fluorescence (HTRF) assay measuring degradation of insulin by IDE in the presence of 6b, 6bK and analogue 28 (Extended Data Fig. 1). d, LC-MS assay for ex vivo degradation of CGRP (10 µM) by endogenous IDE in mouse plasma in the presence of 6b. e, f, Biochemical assays suggesting that 6b binds a site in IDE distinct from the conventional peptide substrate binding site known to bind substrate mimetic Ii1. Yonetani-Theorell double inhibitor plots of IDE activity in the presence of 6b and Ii1 (panel e), or 6b and bacitracin (panel f). Crossing lines indicate synergistic and independent binding of inhibitors, while parallel lines indicate competition for binding to the enzyme. Cysteinefree catalytically inactive IDE was titrated against 0.9 nM macrocycle 31 alone (filled green circles) or together with 2.15 µM insulin (red filled circles), producing a shift in apparent dissociation constant for macrocycle 31 according to equation (1) (Supplementary Information). f, Residue-decomposed energy of the crystal (green) and docked (blue) poses of 6b (see Supplementary Information for docking calculations).",
                                "Extended Data Figure 4. Small-molecule/enzyme mutant complementation study to confirm the macrocycle binding site and placement of the benzophenone and cyclohexyl building-block groups a, IDE mutant A479L is inhibited by 6b > 600-fold less potently compared to wild-type IDE. b, Analogue 9, in which the p-benzoyl ring is substituted for a smaller t-butyl group, inhibits A479L IDE and WT IDE comparably. c, Similarly, IDE mutant G362Q is inhibited 77-fold less potently by 6b compared with WTIDE. d, Analogue 13, in which the Lcyclohexyl alanine side chain was substituted with a smaller L-leucine side chain, inhibits G362Q IDE and WT IDE comparably. The full list of IDE mutants investigated is shown in 80 mg kg -1 ) versus vehicle alone (black). The mice were active, and displayed normal posture, normal grooming and normal response to stimulation. d, Concentration of 6bK in mice tissues and plasma collected over 4 h determined by isotope dilution mass spectrometry (IDMS) with heavy-labelled analogue (n = 2 for all data except the last two time-points, for which n = 1). e, Average biodistribution of 6bK in five lean mice at 150 min post-injection of 6bK 80 mg kg -1 i.p. at the endpoint of an IPGTT experiment. We did not detect 6bK in the brain even using tenfold concentrated samples for LC-MS injection compared to other tissues. f, Treatment of C57BL/6J lean mice with 6bK (green, 80 mg kg -1 , n = 6) does not change brain levels of Aβ(40) or Aβ(42) peptides in the brain 2 h post injection compared to treatment with vehicle alone (black, n = 5) or inactive diastereomer bisepi-6bK (brown, 80 mg kg -1 , n = 6). g, Mice treated with a single injection of 6bK (green, 80 mg kg -1 i.p.) display increased hypoglycaemic response to insulin injection (Humulin-R, 1.0 U kg -1 i.p., see also Fig. 3b). Data shown in c-e and g are representative of two or more independent studies.",
                                "Extended Data Figure 6. Dependence of insulin and glucagon secretion on the route of glucose administration (oral or i.p.) due to both the 'incretin effect' and the hyperinsulinaemic phenotype of DIO versus lean mice a, The early insulin response to glucose in lean and DIO mice is higher during OGTT than IPGTT. b, Suppression of glucagon secretion post-glucose administration is less effective after IPGTT and in DIO mice. c, Administration of 6bK (green, 80 mg kg -1 , n = 7) to lean mice not followed by injection of a nutrient such as glucose or pyruvate (see Figs 23) did not significantly alter basal blood glucose or basal hormone levels compared to bisepi-6bK (brown, n = 7) or vehicle controls (black, n = 7) 30 min post-injection. All data points and error bars represent mean ± s.e.m. Statistics were performed using a two-tail Student's t-test, and significance levels shown in the figures are *P < 0.05 or **P < 0.01 between the labelled groups. Data shown are representative of two or more independent studies. , n = 7) responded to IPGTT in either of two ways: improved glucose tolerance throughout the experiment (n = 3) or a hyperglycaemic 'rebound' as described in the main text (n = 4), suggesting this dose is too low to achieve a consistent 'rebound' phenotype (note the large error bars). e, DIO mice treated with high doses of 6bK (3.5 mg per animal, 90 mg kg -1 , n = 5) respond similarly to Fig. 2e (2 mg per animal, 60 mg kg -1 ), but the weak activity observed for bisepi-6bK (IC 50 > 200 µM) using a matching dose (90 mg kg -1 , n = 5) compared to vehicle alone (n = 5) suggests that 60 mg kg     2e) and RT-PCR analysis of DIO liver samples collected at 135 min after IPGTT. RT-PCR reveals 50% higher glucose-6-phosphatease (G6Pase) and 30% lower phosphoenolpyruvate carboxykinase (PEPCK) transcript levels for the 6bK-treated cohort (6bK; n = 7) versus vehicle-only controls (V; n = 7). b-d, Blood glucose responses and injected hormone abundances in lean mice 30 min after treatment with 6bK or vehicle alone. b, Insulin (0.25 U kg -1 , subcutaneous) after 5-h fast. c, Amylin (250 µg kg -1 , subcutaneous) after overnight fast. d, Glucagon (100 µg kg -1 , subcutaneous) after overnight fast. Trunk blood was collected at the last time-points for plasma hormone measurements (insets; IU, international units). e, Acute IDE inhibition slows gastric emptying through amylin signalling. Fasted WT mice were given oral glucose supplemented with 0.1 mg ml -1 phenol red 30 min after treatment with 6bK alone (n = 6), 6bK co-administered with the amylin receptor antagonist 25 AC187 (3 mg kg -1 i.p., n = 6), vehicle alone (V; n = 6) or inactive bisepi-6bK (n = 4). f, g, G-protein-coupled glucagon receptor knockout mice (Gcgr -/-) treated with IDE inhibitor 6bK display altered glucose tolerance relative to vehicle-treated mice if challenged with oral glucose (3.0 g kg -1 ; f) but not i.p. injected glucose (1.5 g kg -1 ; g). Data: mean ± s.e.m.; *P < 0.05, **P < 0.01 in two-tail Student's t-test. Data shown in a-e are representative of two or more independent studies. Studies using Gcgr -/-knockout mice were performed once."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "Acknowledgments",
                    "paragraphs": [
                        "This research was supported by NIH/NIGMS (R01 GM065865 (D.R.L.), R00 GM080097 (M.A.S.), R01 GM81539 (W.-J.T.), T32 GM008444 (Z.H.F.), F30 CA174152 (Z.H.F.), DP2 OD002374 (A.S.)), Howard Hughes Medical Institute (D.R.L.), Diabetes and Cancer Centers of Albert Einstein College of Medicine (M.J.C.), American Diabetes Association no. 7-11-CD-06 (M.A.L.), Burroughs Wellcome Fund CABS (A.S.), and the Searle Scholars Program(A.S.). The Fonds de Recherche en Santé du Québec (FRSQ) and the Alfred Bader Fund supported J.P.M. We thank C. Russ and H. Spurling (Broad Institute) and C. Daly (FAS Center for Systems Biology) for DNA sequencing assistance. We are grateful to S. Johnston and C. Mosher (Broad Institute) for 6bK stability measurements. W. Nolte provided mouse IDE, L. McCord purified CF-IDE and Y.-G. Kim performed CGRP cleavage assays. We are grateful to A. Badran, E. Homan, A. M. Lone and M. Leidl (Harvard University) for experimental assistance. We thank B. Kahn and N. Gray for discussions."
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}