{
    "id": "https://semopenalex.org/work/W3049175092",
    "authors": [
        "Stefan Blügel",
        "Miguel Ángel González Barrio",
        "A. Mascaraque",
        "E. G. Michel",
        "Roberto Lo Conte",
        "Markus Hoffmann",
        "Bernd Zimmermann",
        "Andreas K. Schmid",
        "R. Wiesendanger",
        "Haifeng Ding",
        "Kai Liu",
        "Gong Chen",
        "Hongying Jia",
        "MM Robertson"
    ],
    "title": "Large Dzyaloshinskii-Moriya interaction induced by chemisorbed oxygen on a ferromagnet surface",
    "date": "2020-08-14",
    "abstract": "Observation of large Dzyaloshinskii-Moriya interaction and switching of skyrmion’s winding number induced by chemisorbed oxygen.",
    "sections": [
        {
            "title": "INTRODUCTION",
            "paragraphs": [
                "The Dzyaloshinskii-Moriya interaction (DMI) is a spin-spin interaction that has finite values only in systems lacking inversion symmetry. Dzyaloshinskii proposed that the combination of low symmetry and spin-orbit coupling gives rise to an antisymmetric exchange interaction (1), and Moriya introduced how to calculate the antisymmetric exchange interaction for localized magnetic systems in a microscopic model (2). This picture was later used to successfully explain helical spin order and skyrmion lattices in the B20-type transition metal silicides and germanides lacking inversion symmetry (3,4). In addition, Fert and Levy (5) proposed a DMI mechanism that involves magnetic and nonmagnetic sites in spin glasses, which was extended to thin film surfaces and interfaces where inversion symmetry breaks along the surface normal direction (6).",
                "This DMI mechanism is now invoked to explain the stability of preferred chirality in a large variety of systems featuring noncollinear spin textures, such as spin spirals (7), skyrmions (8)(9)(10), or chiral domain walls (DWs) (11)(12)(13). Its energy term, -D ij • (S i × S j ), indicates that the sign of the DMI vector D ij determines the chirality of spin textures, i.e., being right-or left-handed, and the interplay between the magnitude of DMI and other magnetic interactions influences the lateral size of spin textures (10). Intense experimental and theoretical efforts have been made to explore the material dependence of the interfacial DMI and to exploit the flexibility of interface choices and stacking orders to enhance the effective DMI, with the goal of optimizing thin film and multilayer systems for the design of spinorbitronic devices (8)(9)(10)14) based on chiral spin textures.",
                "Experimentally, most studies on interfacial DMI systems have focused on magnetic layers adjacent to heavy metals in the framework of the Fert-Levy model, such as hafnium (15), tantalum (15)(16)(17), tungsten (7,15,17,18), iridium (19)(20)(21), platinum (17,(19)(20)(21), palladium (22), or ruthenium (23), where large differences of the DMI magnitude among those elements were attributed to the distinct degree of hybridization between 5d and 3d orbitals near the Fermi level (17,24). Sizable DMI has also been found at certain metal/ oxide interfaces, such as Co 90 Fe 10 /oxide (25), CoFeB/TaO x (26), Co/ AlO x , or Co/GdO x (27). These results point out the correlation between the DMI and the orbital angular momentum (25) and suggest the origin of the voltage-tunable DMI to be the Rashba field at metal/ oxide interfaces (26), which was recently predicted (28). In addition, it is fundamentally interesting to explore the effects of elements with a low atomic number on the DMI. For instance, hydrogenationinduced skyrmion formation in Fe/Ir(111) at low temperatures has been reported (29). Furthermore, a large DMI was observed at the Co/graphene interface, which was attributed to the Rashba effect (23,30). DMI induced by oxygen chemisorption on Fe films, different from the aforementioned oxide systems, has also been theoretically predicted with the DMI mechanism related to the hybridization and charge transfer between atomic oxygen and metal (31). Chemisorbed oxygen on a 3d metal surface is an ideal system to test this picture, as well as the recent theoretical prediction of the relation between the DMI and the electric dipole moment (32), as the presence of atomic oxygen creates a strong internal electric field at the atomic oxygen/metal interface, because of the large difference of electronegativity between oxygen and 3d ferromagnets (oxygen has a Pauling electronegativity of 3.44, and 3d ferromagnets have a Pauling electronegativity of ~1.90), yet such experimental examinations are still missing so far.",
                "Here, we report the direct observation of a large DMI induced at room temperature by chemisorbed oxygen on Ni/Co/Pd/W(110) multilayers, using spin-polarized low-energy electron microscopy (SPLEEM) (33). We first show that the effective DMI in the multilayer stack can be tuned by precisely controlling the Pd spacer layer thickness, d Pd , which is supported by density functional theory (DFT) calculations. Then, we monitor the oxygen coverage (d O )-dependent evolution of DW chirality in perpendicularly magnetized Ni/Co films on Pd/W(110). We find that the chemisorbed oxygen can switch the DW chirality when the effective DMI of the bare (oxygen-free) Ni/ Co/Pd/W(110) multilayer is Pd-like (left-handed), as a result of a relatively thick Pd spacer layer, but chemisorbed oxygen cannot switch the DW chirality when the Pd spacer layer is thinner and the effective DMI of the bare multilayer is tungsten-like (right-handed). A systematic measurement of the chirality in d Pdd O space allows us to quantify the DMI induced by chemisorbed oxygen. We find that the magnitude of the chemisorbed oxygen-induced DMI is comparable to those induced at ferromagnet/heavy metal interfaces, despite the low atomic number of oxygen. We demonstrate that this oxygen-induced DMI is sufficiently strong to tailor a skyrmion's winding number as well as its domain wall type at room temperature. The observed large magnitude of the DMI induced by oxygen may be useful for the development of applications in the field of spintronics and magneto-ionics."
            ],
            "subsections": [
                {
                    "title": "RESULTS",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "A tunable platform for measuring unknown DMI contributions",
                            "paragraphs": [
                                "One of the approaches to quantify the DMI in a layered system is to measure the DW spin texture as a function of layer thickness, where the sign and magnitude of the DMI can be determined by measuring the critical thickness where DW transitions from chiral Néel to achiral Bloch textures (10). This can be done by using SPLEEM (13,19,23) or scanning electron microscopy with polarization analysis (34). If the addition of a new interface with unknown DMI to a layered system with calibrated DMI is found to switch the handedness of DWs, then the unknown DMI of the new interface can be quantified by comparison. For example, the observation of righthanded chirality in Co/Ru(0001) and left-handed chirality in graphene/ Co/Ru(0001) allowed unambiguous determination of left-handed DMI at the graphene/Co interface (23). The aim to generalize this experimental method motivates the development of DMI-tunable platforms that combine pairs of buried interfaces with opposite DMI (19,35) to provide magnetic surfaces with either left-or right-handed DW chirality, so that the sign of an unknown DMI at any new interface added to the structure can be unambiguously determined.",
                                "In this work, tungsten and palladium are chosen because the growth of Pd on W(110) results in high-quality epitaxial films (fig. S1). The strong LEEM image intensity oscillations associated with the layer-by-layer growth allow a precise determination of the Pd film thickness, which permits fine-tuning of the effective DMI in the Pd/W system. Ni/Co bilayers grown on top provide perpendicular magnetic anisotropy, which allows the observation of DW chirality (19). The compound SPLEEM images (Fig. 1, A, C, andE) show the Pd thickness-dependent switching of the DW Néel chirality in Ni/ Co/Pd/W(110) multilayers. The histograms (Fig. 1, B, D, andF) of the angle  calculated from the SPLEEM images show the statistics of DW chirality (19,23). Note that the DW is aligned along the easy axis of the uniaxial magnetic anisotropy, i.e., the W[001] direction; this alignment is induced by the uniaxial strain in face-centered cubic (fcc) layers on W(110) (18). Therefore, the DW type (Néel, Bloch, or mixed wall) varies on the basis of the DW orientation with respect to the tungsten crystal orientation. While this may result in shifted peaks in the  histogram away from 0° and 180°, the sensitivity of the Néel-component to the interfacial DMI persists (18). The d Pd -dependent chirality evolution (Fig. 1G (thick d Pd ) Néel chirality occurs near d Pd = 2.5 monolayers (MLs) (Materials and Methods). This chirality switching is attributed to the sign change of the effective DMI, which is supported by DFT calculations (Fig. 1H), where the W-like DMI is right-handed and the Pd-like DMI is left-handed. This tunable DMI, by simply varying the Pd thickness, provides an ideal platform to the quantitative study of the interface-induced DMI."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Examining chemisorbed oxygen-induced DW chirality",
                            "paragraphs": [
                                "Ni( 111) is an ideal surface to study the role of oxygen on the DMI, as the phase diagram of oxygen chemisorbed on Ni(111) is well understood from literature (36). Two-dimensional O/Ni(111) adsorbate layers can be realized in the range of 0 to 0.5 ML oxygen with respect to the planar atomic density of Ni(111), where oxygen atoms strongly bind to threefold hollow sites on the Ni(111) surface with an oxygen-nickel bond length of 1.88 Å. At room temperature, the oxygen layer remains in a \"lattice gas phase\" (no long-range order) at a low coverage below 0.21 ML, as the interaction energy between the oxygen adatoms is an order of magnitude smaller than the binding energy (36) S2].",
                                "In this work, we focus on room temperature oxygen adsorption in the coverage regime up to 0.29 ML, where no formation of NiO is observed (see Materials and Methods) (36).",
                                "We find that the presence of adsorbed oxygen on Ni/Co/Pd/W(110) samples favors right-handed chirality. This is unambiguously demonstrated by using the tunability of the DMI in this multilayer, where the chirality of the magnetic layer can be adjusted from left-handed to achiral to right-handed, as a function of the thickness of the Pd spacer.  2H for d Pd = 2.60 ML, 2.76 ML, and 2.83 ML. This is because the effective left-handed DMI increases with the Pd layer thickness (19,37), and more O coverage is required to provide the balancing right-handed DMI. The role of the chemisorbed oxygen-induced DMI is also examined in systems without heavy metal, where the chirality switching from left-handed chiral Néel wall to achiral Bloch wall is observed in [Co/Ni] 3 /Cu(111) with 0.21 ML chemisorbed oxygen (fig. S3). This observation further confirms the large DMI induced at the chemisorbed oxygen/cobalt interface (38). Consequently, for sub-monolayer variations of the Pd layer thickness, we can approximate that the DMI varies linearly with Pd thickness. Under this approximation, the DMI change induced by a Pd layer thickness variation of ∆d Pd = 0.37 ML is about 37% of the DMI change induced by a Pd layer thickness variation of ∆d Pd = 1 ML, which, as described above, amounts to 0.41 ± 0.17 meV/ atom. As our experiments show that the DMI variation induced by ∆d Pd = 0.37 ML equals that induced by adding 0.24 ML oxygen onto the Ni surface, which is (0.41 ± 0.17) × 0.37 = 0.15 ± 0.06 meV/ atom, these measurements allow an estimate of the DMI induced by the chemisorbed oxygen as ( 0.41 ± 0.17 ) × 0.37 _ 0.24 = 0.63 ± 0.26 meV / atom for 1 ML of oxygen coverage."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Quantifying chemisorbed oxygen-induced DMI",
                            "paragraphs": [
                                "It is interesting to compare the extracted oxygen-induced DMI in this system to DMI values in other systems, as summarized in Fig. 3  (C andD). Here, we compare only measurements derived using the experimental approach described in (10,19,23) to avoid potential systematic biases due to the use of different methods. Compared to another light element, the DMI at the oxygen/Ni interface is approximately four times larger than that at the graphene/Co interface, where D graphene/Co = 0.16 ± 0.05 meV/atom (23). The chemisorbed oxygen-induced DMI is also comparable to the DMI induced at interfaces with many transition metals. For selected materials adjacent to the Ni layer (Fig. 3C): D Ni/Ir = 0.12 ± 0.04 meV/atom (19), D Ni/W ≈ 0.24 meV/atom (18), D Ni/Cu + Fe/Ni = 0.15 ± 0.02 meV/atom (13), and D Ni/Pt = 1.05 ± 0.18 meV/atom (19). For selected materials adjacent to the Co layer (Fig. 3D): D Co/Ir = 0.36 ± 0.08 meV/atom (39), D Co/Ru = 0.05 ± 0.01 meV/atom (23), and D Co/Pd = 1.44 ± 0.15 meV/ atom as measured in this work (see Materials and Methods)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Tailoring chirality of spin textures via adsorbed oxygen",
                            "paragraphs": [
                                "The large DMI induced by oxygen coverage on magnetic layers opens up new possibilities for designing chiral spin textures without using heavy metals. In the following, we demonstrate experimentally that chemisorbed oxygen can be used to tailor the spin texture of magnetic bubbles. Compound SPLEEM images in Fig. 4 (A to F) highlight DW structures in a down-magnetized magnetic bubble with uniaxial anisotropy at various oxygen coverages in a Ni(1 ML)/Co(3 ML)/Pd(2.6 ML)/W(110) sample, where a complete chirality transition from left-handed (Fig. 4A) to achiral (Fig. 4D) to right-handed (Fig. 4F) is observed. Note that the deformation of the bubble shape is due to the oxygen-induced change of perpendicular magnetic anisotropy. To demonstrate the role of oxygen-induced DMI on regular skyrmions, we also performed experiments on oxygen-assisted skyrmion evolution in the isotropic [Co/Ni] 3 /Cu(111) system, without any uniaxial anisotropy. The skyrmion shown in Fig. 4G is a left-handed hedgehog type. With increasing oxygen coverage (0.12 and 0.21 ML oxygen in Fig. 4, H andI, respectively), the skyrmion gradually evolves to the Bloch type. Note that the Bloch-type chirality is not defined by the interfacial DMI; therefore, a bubble with bigger diameter may exhibit achiral Bloch walls at the same oxygen coverage (fig. S3C). These results represent a new approach to tailor the inner structure of magnetic bubbles or skyrmions, which may influence the stability and dynamic properties of the initial bubble domain, due to possible changes of topological number or DW-typedependent current-induced dynamics (10)."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "DISCUSSION",
                    "paragraphs": [
                        "Note that the DMI of oxygen adsorbed on top of Ni favors righthanded DW textures, which is the same handedness as Pt/Ni and Pd/Ni, suggesting that earth-abundant oxygen could potentially be used as an alternative to replace those rare noble metals in device applications where sizable DMI is needed. The large magnitude of the DMI induced by oxygen may be sufficient to stabilize magnetic chirality in a-few-nanometer-thick magnetic films; for instance, the chirality in typical perpendicular magnetic anisotropy multilayers [Co(1 ML)/Ni(2 ML)] n might be stabilized up to n = 5 (roughly 3 nm thick). The physical origin of the large magnitude of the oxygeninduced DMI is linked to the electric surface dipole moment induced by charge transfer and related hybridization between p-orbitals of oxygen and d-orbitals of ferromagnets (31). The charge transfer can be explained by the large difference in electronegativity, and therefore, our results provide experimental evidence for the recently predicted relationship between DMI and electronegativity (32). A large work function change (~0.7 eV) is observed for the Ni/Co/ Pd/W system upon oxygen chemisorption (fig. S5A), which confirms the oxygen adatom-induced dipole moment (36). This suggests that other adsorbates with strong electronegativity differences may also induce a sizable DMI."
                    ],
                    "subsections": []
                },
                {
                    "title": "CONCLUSION",
                    "paragraphs": [
                        "In summary, our experiments show that chemisorbed oxygen onto ferromagnet surfaces can induce a large DMI at room temperature, comparable to those induced at typical ferromagnet/transition metal interfaces. The induced DMI can be used to directly tailor the winding number of magnetic skyrmions at room temperature. We anticipate that sizable DMI may also be induced by chemisorbed oxygen on other magnetic surfaces such as chromium (40), manganese (40), iron (41), or cobalt (38). The observation of the large DMI induced by chemisorbed oxygen, along with the possibility of voltage-controlled oxygen migration in multilayer systems (42,43), may create new possibilities in the field of spintronics and magneto-ionics."
                    ],
                    "subsections": []
                },
                {
                    "title": "MATERIALS AND METHODS",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Sample preparation",
                            "paragraphs": [
                                "The experiments were conducted in the SPLEEM instrument at the National Center for Electron Microscopy of the Lawrence Berkeley National Laboratory. All samples were prepared under ultrahigh vacuum (UHV) conditions in the SPLEEM chamber, with a base pressure lower than 4.0 × 10 Oxygen exposures were done by controlled leaking of high-purity oxygen (99.993%) in pressure ranges of 5 × 10 -9 torr to 1 × 10 -8 torr, and the surface contamination from other residual gases (base pressure < 4 × 10 -11 torr) is estimated to be at least two orders of magnitude less, which is insufficient to influence the result. The oxygen coverage is estimated based on the kinetics relation reported in (36). Our measurements of the oxygen coverage-dependent work function change show excellent agreement with the previous measurement (fig. S5) (36). The oxygen coverage on the surface of [Co/Ni] 3 / Cu(111) is estimated by the oxygen thickness-dependent low-energy electron diffraction (LEED) pattern (fig. S3D, inset), and no formation of CoO is seen due to the absence of additional CoO LEED spots (38)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Magnetic imaging and vector field analysis",
                            "paragraphs": [
                                "The real-space magnetic images were acquired using the SPLEEM instrument at the National Center for Electron Microscopy at the Lawrence Berkeley National Laboratory (33). In each SPLEEM image, the contrast is obtained by calculating the asymmetry of the spindependent reflection between spin-polarized beams with up and down spins, which is A = (I ↑ -I ↓ )/(I ↑ + I ↓ ). This asymmetry A represents P • M, where P is the spin polarization vector of the illumination beam and M is the magnetization vector. The Cartesian components M x , M y , and M z of the magnetization were resolved by taking sets of images with the illumination beam spin polarization aligned along the x, y, and z directions, respectively (18,19). The two in-plane orthogonal directions were chosen to be W [1][2][3][4][5][6][7][8][9][10] and W[001]. All images were measured on the samples held at room temperature. The energy of the incident electron beam was set to 5.6 eV for the Ni/Co/Pd/W system to optimize the magnetic contrast. The compound SPLEEM images are converted by combining the set of SPLEEM images (M x , M y , and M z ), where the color wheel highlights in-plane magnetization, and gray values represent the perpendicular magnetization component +M z (black) and -M z (gray), respectively.",
                                "The method to analyze the DW chirality from the SPLEEM images is the same as that described previously (19,23). The DW normal vector n is determined from out-of-plane SPLEEM images, and the DW magnetization vector m is measured from the asymmetry values of two in-plane SPLEEM images. To highlight the contributions of the Néel component in a DMI system with finite in-plane uniaxial magnetic anisotropy, the angle -dependent Néelcomponent counts in the histograms in Figs. 1 and2 are calculated as total counts ×|cos| (18)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Estimating the DMI strength",
                            "paragraphs": [
                                "The method to estimate the DMI strength from the film thicknessdependent DW evolution in Fig. 3 is the same as that described previously (19,23). The strength of the DMI vector can be estimated by calculating the dipolar energy difference in thinner films with Néel walls (lower DMI limit) and thicker films with Bloch walls (upper DMI limit). The dipolar energy constant is  0 ( d Co  Co + d Ni  Ni ) 2 / 8 a ∥ 3 , where  Co = 1.7  B ,  Ni = 0.6  B , and a ∥ = 2.51 Å . We numerically calculated the dipolar energy difference of [Ni/Co] n /Pd/W with various film thicknesses, where cases with n = 3 and n = 5 lead to values of -1.30 meV/atom and -3.20 meV/atom, respectively. Therefore, the DMI vector d is converted based on the hexagonal lattice case (19,23), which gives 0.41 ± 0.17 meV/atom for [Ni/Co] n /3.46 ML Pd/W(110). Using the same approach, we further measured the DMI at the Co interface with bulk Pd in the [Ni/Co] n /Pd(111) system, finding D Co/Pd = 1.44 ± 0.15 meV/atom (fig. S6). These results show that the bulk Pd-induced DMI is much larger than the DMI variation induced by a small Pd thickness change in the Ni/Co/ Pd/W(110) system, similar to the smooth thickness dependence observed in another heavy metal-induced DMI system (37)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "DFT calculation of DMI strength",
                            "paragraphs": [
                                "All calculations were based on DFT. Because of the preferred hexagonal growth of Ni, Co, and Pd, we approximated the whole system to follow this pseudomorphic growth. The lattice constant was chosen to be 250 pm. For the stacking order, we followed the preferred bulk ordering for each metal. This results in a reduced C 2v symmetry, in agreement with the real physical system. To most accurately model the W(110), we adjusted the W interlayer distances to obtain the correct experimental bulk volume. Structural relaxations have been performed to determine the remaining interlayer distances using the Vienna ab initio simulation package (44,45) using the generalized gradient approximation of Perdew-Burke-Ernzerhof (46) for exchange and correlation effects and the projectoraugmented wave method (47). The magnetic properties were determined in the local density approximation (48), using the full-potential linearized augmented plane wave method as implemented in the FLEUR code (for the program description, see http://flapw.de). The charge densities of spin spiral states have been converged using a cutoff parameter for the basis functions of k max = 4.0 a.u. -1 and (32 × 32) k-points in the full two-dimensional Brillouin zone (2DBZ). The DMI was calculated by including spin-orbit coupling in first-order perturbation theory (49) with (64 × 64) k-points in the full 2DBZ on top of a scalar-relativistic spin-spiral calculation, as described in (50,51)."
                            ],
                            "subsections": [
                                {
                                    "title": "Acknowledgments",
                                    "paragraphs": [
                                        "Funding: This work has been supported by the NSF (DMR-1610060 and DMR-1905468) and the UC Office of the President Multicampus Research Programs and Initiatives (MRP-17-454963). Work at the Molecular Foundry was supported by the Office of Science, Office of Basic Energy Sciences, of the U.S. Department of Energy under contract no. DE-AC02-05CH11231. Work at GU has been supported, in part, by SMART (2018-NE-2861), one of seven centers of nCORE, a Semiconductor Research Corporation program, sponsored by the National Institute of Standards and Technology (NIST). A.M. and M.A.G.B. acknowledge support from MINECO (Spain) under the project no. MAT2017-87072-C4-2-P and from Comunidad de Madrid under the project no. S2018/NMT4321. The Jülich team acknowledges financial"
                                    ],
                                    "subsections": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "SUPPLEMENTARY MATERIALS",
            "paragraphs": [
                "Supplementary material for this article is available at http://advances.sciencemag.org/cgi/ content/full/6/33/eaba4924/DC1 support from the DARPA TEE program through grant MIPR (# HR0011831554) from the DOI, the European Union H2020-INFRAEDI-2018-1 program (grant no. 824143, project \"MaX-Materials at the exascale\"), the Deutsche Forschungsgemeinschaft (DFG) through SPP 2137 \"Skyrmionics\" (project BL 444/16), the Collaborative Research Centers SFB 1238 (project C01), and computing resources at the supercomputers JURECA at Juelich Supercomputing Centre and JARA-HPC from RWTH Aachen University (projects jias1f and jara0197). R.L.C., A.K.S., and R.W. acknowledge financial support from the European Union via an International Marie Curie Fellowship (grant no. "
            ],
            "subsections": []
        }
    ]
}