{
    "id": "https://semopenalex.org/work/W3029889617",
    "authors": [
        "Zhen Liu",
        "Jia Chen",
        "Ying Wang",
        "Xiao Wang",
        "Li Yang",
        "Jing Wu",
        "Wei Zhu",
        "Jifang Li",
        "Zhi Zhou",
        "Xingxu Huang",
        "Wenxia Yu",
        "Bei Yang",
        "Jia Wei",
        "Junquan Liang",
        "Zongyang Lu",
        "Chengfeng Ding",
        "Yi–Ming Xiong",
        "Siting He"
    ],
    "title": "Cas12a Base Editors Induce Efficient and Specific Editing with Low DNA Damage Response",
    "date": "2020-06-01",
    "abstract": "Summary The advent of base editors (BEs) holds great potential for correcting pathogenic-related point mutations to treat relevant diseases. However, Cas9 nickase (nCas9)-derived BEs lead to DNA double-strand breaks, which can trigger unwanted DNA damage response (DDR). Here, we show that the original version of catalytically dead Cas12a (dCas12a)-conjugated BEs induce a basal level of DNA breaks and minimally activate DDR proteins, including H2AX, ATM, ATR, and p53. By fusing dCas12a with engineered human apolipoprotein B mRNA editing enzyme, catalytic polypeptide-like 3A (APOBEC3A), we further develop the BEACON ( b ase e diting induced by human A POBEC3A and C as12a with o ut D N A break) system to achieve enhanced deamination efficiency and editing specificity. Efficient C-to-T editing is achieved by BEACON in mammalian cells at levels comparable to AncBE4max, with only low levels of DDR and minimal RNA off-target mutations. Importantly, BEACON induces in vivo base editing in mouse embryos, and targeted C-to-T conversions are detected in F0 mice.",
    "sections": [
        {
            "title": "In Brief",
            "paragraphs": [
                "Wang et al. develop a BEACON baseediting system by combining dCas12a with human APOBEC3A and its engineered versions. BEACON induces efficient editing in cells and mouse embryos with basal levels of DNA damage response, RNA off-target mutations, and unintended side products."
            ],
            "subsections": [
                {
                    "title": "INTRODUCTION",
                    "paragraphs": [
                        "The CRISPR-Cas9 system has been successfully applied in various living organisms for genome editing (Hsu et al., 2014;Knott and Doudna, 2018;Komor et al., 2017). The Cas9 nuclease generates DNA double-strand breaks (DSBs) at specific genomic loci under the direction of guide RNAs (gRNAs) (Cong et al., 2013;Jinek et al., 2013;Mali et al., 2013), which are further processed by downstream DNA repair pathways to induce gene editing outcomes. Therefore, the formation of DSBs is required for CRISPR-Cas9-mediated genome editing. Although Cas9 nickase (nCas9) only generates DNA single-strand breaks (SSBs), apolipoprotein B mRNA editing enzyme, catalytic polypeptide-like (APOBEC)/activation-induced cytidine deaminase (AID) family members (Harris and Liddament, 2004) together with base excision repair proteins (Chen et al., 2014) can lead to DSBs during the repair of these SSBs (Lei et al., 2018). In addition, base editors (BEs) that link nCas9 with APOBEC1 are also associated with DSBs, demonstrated by the induced insertions or deletions (indels) of nucleotides around target sites (Komor et al., 2016;Lei et al., 2018;Nishida et al., 2016).",
                        "In most cases, DSBs are repaired through the non-homologous end joining (NHEJ) pathway (Ceccaldi et al., 2016) to yield indels (Chakrabarti et al., 2019;van Overbeek et al., 2016), which lead to knockout of protein-coding genes. Alternatively, DSBs can be resolved through homology-directed repair (HDR) in the present of a donor DNA (Ceccaldi et al., 2016), which can be used to induce precise sequence replacement. However, DSBs are highly toxic lesions (Chapman et al., 2012) and can trigger downstream DNA damage response (DDR) signaling pathways to disturb cellular homeostasis (Roos et al., 2016;Zhou and Elledge, 2000), e.g., cell proliferation (Haapaniemi et al., 2018;Ihry et al., 2018). Specifically, the generation of DSBs can trigger the autophosphorylation of the protein kinase ataxia-telangiectasia mutated (ATM) (Shiloh and Ziv, 2013). Meanwhile, during the repair of DSB, an end resection process generates single-stranded DNA (ssDNA) regions (Ceccaldi et al., 2016) and further activates another protein kinase, ATM and RAD3-related (ATR) (Cimprich and Cortez, 2008). ATM, and to some extent ATR, can phosphorylate the histone variant H2AX and tumor suppressor protein p53, which signal DSB repair (Mah et al., 2010) and then regulate the cell cycle (Bieging et al., 2014).",
                        "Cas12a (as known as Cpf1) is another CRISPR-Cas protein that is distinct from Cas9 in many aspects (Zetsche et al., 2015). Cas12a recognizes a T-rich PAM sequence, requires a short gRNA (CRISPR RNA, crRNA) and has been reported to have a generally higher targeting specificity than Cas9 (Kim et al., 2016;Kleinstiver et al., 2016Kleinstiver et al., , 2019;;Yan et al., 2017). These characteristics render Cas12a a promising gene editing platform. We have recently developed catalytically dead Cas12a (dCas12a)-derived BEs that were conjugated with rat APOBEC1 (rA1) (Li et al., 2018). In theory, dCas12a-derived BEs are unlikely to cause DSBs; therefore, unwanted DDR could be largely avoided. Nevertheless, dCas12a-BEs also induced much lower editing efficiencies than nCas9-BEs did (Gehrke et al., 2018;Huang et al., 2019;Koblan et al., 2018;Li et al., 2018;Thuronyi et al., 2019;Wang et al., 2019), and in vivo base editing by dCas12a-BEs has not been achieved in animals. In this study, we confirmed that the early version of dCas12a-derived BEs induced very low levels of DDR. Furthermore, by screening and engineering different APOBEC/AID family members, we identified that highly efficient and specific C-to-T editing could be induced by human APOBEC3A (hA3A)-dCas12a-BEs, referred to as BEACON (base editing induced by human A3A and Cas12a without DNA break). With no toxic DSB and basal levels of DDR and RNA off-target (OT) effects, BEACON also induced in vivo base editing successfully in mouse embryos, and targeted C-to-T conversions were detected in F0 mice."
                    ],
                    "subsections": []
                },
                {
                    "title": "RESULTS",
                    "paragraphs": [
                        "Low Levels of DDR Induced by dCas12a-BE Different from Cas9-mediated genome editing, dCas12aderived BEs only deaminate one or a few cytosines in the ssDNA of the R-loop formed by gRNA at target sites, which will be converted to thymines after DNA replication. Given the fact that dCas12a is used as the Cas moiety, dCas12a-derived BEs theoretically are unlikely to generate DNA breaks or activate DDR cascades (Figure 1A). In contrast, nCas9-derived BEs triggered indel formation as the nCas9-generated nick would be converted to a DSB (Lei et al., 2018), which activates DDR proteins. Indeed, much higher levels of phosphorylated H2AX (gH2AX) were observed in cells treated with Cas9 or a nCas9-derived BE3 than those in cells treated with rA1-dCas12a-BE (Figures 1B, 1C, and S1A). Correspondingly, the levels of phosphorylated p53 (p-p53), ATM (p-ATM), and ATR (p-ATR) in rA1-dCas12a-BE-treated cells were also lower than those in the cells treated with Cas9 or BE3 (Figures 1B,1C,and S1A). As shown in Figure S1B, rA1-dCas12a-BE induced almost no indel at the target site, whereas high levels of indels were observed with the Cas9 or BE3 treatment. In addition, the catalytically dead Cas9 (dCas9)-derived BE2 also triggered low levels of DDR (Figures 1B, 1C, and S1A) and indels (Figure S1B), but it only induced base editing with limited efficiencies (Figure S1C). These results demonstrated that rA1-dCas12a-BE induced base editing with the least damage on genomic DNA."
                    ],
                    "subsections": [
                        {
                            "title": "Screening of dCas12a-Derived BE",
                            "paragraphs": [
                                "We next compared the editing efficiencies of rA1-dCas12a-BE and the commonly used BE3 at disease-associated target sites (Wang et al., 2019; Figure S2). Although rA1-dCas12a-BE induced purer C-to-T editing products and fewer indels than BE3, it induced ~4-fold lower C-to-T editing frequencies (median, p = 2 3 10 À11 ; Figure S2E) than BE3 (~13% to 48%; Figure S2B) at seven selected disease-associated genomic loci.",
                                "The fact that currently available rA1-dCas12a-BEs induce significantly low editing efficiency impedes its broad applications. We sought to develop new dCas12a-derived BEs with high C-to-T editing efficiencies by linking dCas12a with different APOBEC/ AID family members. Among three newly constructed BEs (hA3A-dCas12a-BE, hA3B-dCas12a-BE, and hAID-dCas12a-BE) and one previously reported rA1-dCas12a-BE (Figure 2A), hA3A-dCas12a-BE induced the highest editing efficiency, which is ~4-fold higher than the original rA1-dCas12a-BE (median, p = 2 3 10 À7 ; Figure 2C), across 15 genomic loci (Figure 2B). Further analysis showed that hA3A-dCas12a-BE induced the purest Cto-T editing as well (Figure 2D)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Improvement of hA3A-dCas12a-BE",
                            "paragraphs": [
                                "We then aimed to further improve the editing efficiency of hA3A-dCas12a-BE by engineering its hA3A moiety. According to the structure of hA3A in complex with a 5 0 -TC-containing ssDNA (Shi et al., 2017), the targeted C was usually accommodated in a grove that is formed by hA3A residues from active center loops (AC-loops) 1, 3, 5, and 7 (Figure 3A). Of the residues on these loops, His29, His70, Tyr130, Ser99, Asp131, and Tyr132 are directly involved in substrate coordination (Figure 3A, close up view in right panel). Thus, we opted to avoid mutating these residues and instead to choose aromatic AC-loop residues that are located on the peripheral of the ssDNA binding grove, i.e., Trp98 and Trp104, for subsequent engineering. Meanwhile, Pro134 was also selected for engineering, as proline is generally considered a secondary structure disruptor and the change of Pro134 may have effects on the flexibility of AC-loop 7. Molecular simulation of the corresponding hA3A mutants in complex with ssDNA ligands (Figure 3B) indicated that mutations of W104A and P134Y significantly strengthened the interaction between hA3A and ssDNA, whereas W98A largely destabilized the interaction (Figure 3B). Although the W98Y mutation alone seemed to not affect the binding of the ssDNA ligand (Figure 3B), it might loosen the nucleotide preference at À1 positions (Shi et al., 2017). Thus, we introduced the amino acid changes of W98Y, W104A, and P134Y into the hA3A moiety of hA3A-dCas12a-BE, with the mutation W98A serving as the negative control (Figure 3C). In total, four engineered BEs (hA3A W98A -dCas12a-BE, hA3A W98Y -dCas12a-BE, hA3A W104A -dCas12a-BE, and hA3-A P134Y -dCas12a-BE) were obtained for subsequent comparison. Among them, three engineered BEs (hA3A W98Y -dCas12a-BE, hA3A W104A -dCas12a-BE, and hA3A P134Y -dCas12a-BE) induced higher editing frequencies than the wild-type hA3A-dCas12a-BE (median, 1.32-, 1.54-, and 1.40-fold; and p = 6 3 10 À10 , 8 3 10 À12 , and 3 3 10 À16 , respectively), whereas hA3A W98A -dCas12a-BE showed decreased editing efficiency (Figure 3D). As a control, two mutations at amino acids (C101S and C106S) close to the enzymatic active site eliminated editing efficacy (Figure S3A). Next, we further combined the amino acid changes of W98Y, W104A, and P134Y to test whether these alternations can increase the editing efficiency in a synergistic manner (Figure 3F). The dual-change combinations of W98Y/W104A and   W104A/P134Y induced higher editing frequencies than W98Y/ P134Y (Figure 3G). Interestingly, the triple-change combination of W98Y/W104A/P134Y induced lower editing frequencies than the original hA3A-dCas12a-BE (Figure 3G), suggesting that the triple amino acid changes may compromise the cytidine-deaminase activity of hA3A. Among all engineered BEs, three of them (hA3A W104A -dCas12a-BE, hA3A W98Y/W104A -dCas12a-BE, and hA3A W104A/P134Y -dCas12a-BE) induced high levels of editing frequencies, i.e., 1.54-, 1.57-, and 1.64-fold of editing efficiencies relative to hA3A-dCas12a-BE (median, p = 8 3 10 À12 , 2 3 10 À13 , and 5 3 10 À21 , respectively; Figures 3D and3G), and were used for further engineering.",
                                "Next, we also optimized the codons of these four BEs (Figure 4A) for mammalian expression to enhance their editing efficiencies (Koblan et al., 2018). As expected, editing efficiencies of these codon-optimized BEs (hA3A-dCas12a-BEop, hA3A W104A -dCas12a-BE-op, hA3A W98Y/W104A -dCas12a-BE-op, and hA3A W104A/P134Y -dCas12a-BE-op) were all significantly improved (Figure 4B). Among them, the engineered and codon-optimized ones (hA3A W104A -dCas12a-BE-op, hA3A W98Y/W104A -dCas12a-BE-op, and hA3A W104A/P134Y -dCas12a-BE-op) induced higher levels of editing frequencies (i.e., 1.55-, 1.71-, and 1.76-fold) than hA3A-dCas12a-BE-op with optimized codons only (Figure 4B, the far right panel). Of note, the engineering of hA3A or codon optimization did not substantially affect the product purity induced by corresponding BEs (Figures 3E,3H,and 4C).",
                                "Editing windows of hA3A W104A -dCas12a-BE-op, hA3A W98Y/ W104A -dCas12a-BE-op, and hA3A W104A/P134Y -dCas12a-BE-op were shown to be ~15 bp long (Figures 4D andS3B, positions 6-20, setting the PAM-proximal nucleotide as position 1).",
                                "Although large editing windows are useful for intended mutagenesis, e.g., creating stop codons to knock out genes (Billon et al., 2017;Kuscu et al., 2017), they were otherwise too wide for precise editing, as multiple cytosines might exist in the editing window (Rees and Liu, 2018). In order to narrow editing windows, we further introduced Y130F and/or Y132D, which were previously shown to narrow the editing windows of hA3A-conjugated BEs (Wang et al., 2018) into the engineered hA3As. Either Y130F or Y132D narrowed the editing windows while maintaining (or slightly affecting) editing efficiencies (Figures 4D,4E, 4F, and S3B). Interestingly, the introduction of Y130F or Y132D further reduced the formation of indels (Figures S3C-S3F) with an unknown mechanism. However, despite an even further narrowed editing window, simultaneous introduction of Y130F and Y132D led to a reduced editing efficiency (Figures 4F andS3B). Thus, we chose hA3A-dCas12a-BEs containing either Y130F or Y132D for subsequent analysis and designated them as BEACON (base editing induced by human A3A and Cas12a without DNA break). Hereafter, hA3A W104A/Y132D -dCas12a-BEop and hA3A W98Y/W104A/Y130F -dCas12a-BE-op are rereferred to as BEACON1 and BEACON2, respectively. Both BEACONs exhibit narrowed editing windows and induce low levels of indels (Figures 4D,S3D,and S3E)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Comparison of BEACON and Other BEs",
                            "paragraphs": [
                                "With efficiency-maximized and editing-window-narrowed dCas12a-BEs in hand, we next compared base-editing outcomes induced by BEACON1 and BEACON2 with those by BE2, BE3 (Komor et al., 2016), YE1-BE3 (Kim et al., 2017), and AncBE4max (Koblan et al., 2018) at seven disease-related genomic loci (Figure 5A). Across these sites, both BEACON1 and BEACON2 induced significantly higher editing than BE3 (median: 1.88-fold, p = 2 3 10 À5 ; and median: 2.14-fold, p = 1 3 10 À5 , respectively; Figure 5E) and reached levels similar to those of AncBE4max (Figure 5E). At some sites, BEACON2 induced even more efficient C-to-T editing than AncBE4max, e.g., sites BMPR2, PDE6C, and PMS2 (Figure 5B). In addition, the product purity yielded by BEACON2 was higher than that by BE3 (median C-to-T fraction, 99.26% versus 87.28%, p = 1 3 10 À6 ; Figures 5C and5F) and similar to that by AncBE4max (median C-to-T fraction, 99.26% versus 97.80%, p = 0.0002; Figures 5C and5F). As BEACONs use dCas12a as the Cas moiety, they generated no DSB and only background levels of indels (Figure 5D), which were much lower than those by BE3 and An-cBE4max (Figure 5G). Importantly, the levels of DDR proteins in BEACON-treated cells were also lower than those in BE3-and Cas9-treated cells (Figures 5H, S4A, and S4B), consistent with the results that BEACON caused almost no toxic DSB (Figures 5D and5G). Correspondingly, BEACON2 led to less DSBs (Figure S4C) and fewer negative effects on cell proliferation than An-cBE4Max and Cas9 (Figure S4D), as DSBs can activate p53 and then lead to negative effects on cell proliferation (Haapaniemi et al., 2018;Ihry et al., 2018)  (legend on next page) Zhou et al., 2019). Thus, we performed RNA sequencing (RNAseq) to determine whether BEACONs also trigger RNA OT mutations with RADAR (RNA-editing analysis pipeline to decode all twelve types of RNA-editing events) (Figures 6 andS4E).",
                                "In agreement with previous findings that A-to-I is the most common type of RNA editing event (Eisenberg and Levanon, 2018;Ramaswami et al., 2013;Zhu et al., 2013), only A-to-I RNA editing was found to be predominantly distributed in RNA-seq datasets from untransfected control cells or Cas9treated cells (Figure 6A). However, C-to-U RNA editing was dramatically increased in RNA-seq datasets from BE3-treated cells, demonstrating widespread and unintended RNA OT effects induced by the rA1 moiety of BE3 (Figures 6B and6C; Zhou et al., 2019). In contrast, much less RNA OT effects were observed in cells treated with AncBE4max, BEACON1, or BEACON2 (Figure 6B). Of note, the hA3A-Y130F-containing BEACON2 only induced RNA OT mutations similar to the background level (Figures 6B and6D), which is consistent with a basal level of RNA OT effects induced by previously reported hA3A-Y130F-conjugated BEs (Wang et al., 2018;Zhou et al., 2019)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "In Vivo Base Editing Induced by BEACON",
                            "paragraphs": [
                                "To test whether the BEACON system can induce base editing in vivo, one target cytosine in the mouse hydroxysteroid 17beta dehydrogenase 3 (Hsd17b3) gene was chosen for editing (Figures 7A-7C). We co-injected the mRNA of BEACON1, BEA-CON2, or rA1-dCas12a-BE with the Hsd17b3-targeted crRNA into one-cell mouse embryos and then analyzed base-editing efficiencies at the blastocyst stage (Figure 7A). Among 8 and 14 embryos injected with BEACON1/crRNA and BEACON2/crRNA, respectively, 1 and 9 were found to bear edited cytosine at the Hsd17b3 locus (Figures 7B, S5C, andS5E). Deep-sequencing analysis confirmed the editing efficiencies at targeted C11 in these embryos (21.04% for BEACON1 and 17.04%-56.84% for BEACON2; Figure 7C). Meanwhile, only a basal level of editing was observed at four other nearby cytosines outside the editing window (C6, C14, C15, and C17; Figure 7C). In contrast, no edited embryo was detected in 11 embryos injected with rA1-dCas12a-BE/crRNA (Figures 7B andS5A). These results further demonstrated the improved in vivo editing efficiency by fusing engineered hA3A with dCas12a.",
                                "In addition to comparing BEACONs and rA1-dCas12a-BE in mouse embryos, we also transplanted the embryos into surro-gate mothers (Figure 7A). A total of 24 pups were obtained from BEACON1-injected embryos (Figure 7D), and among them, 2 pups were edited (#7 and #11; Figure S5D) with the C11 editing frequencies at 57.73% or 23.10% in tails (Fig- ure 7E). Consistent with the results from mouse embryos, no edited mouse pup was found from the rA1-dCas12a-BE injected embryos (Figure S5B). To further confirm the base editing in mouse offspring, we dissected one BEACON1-edited offspring (#7) and determined the editing frequencies in different tissues. The editing frequencies in heart, liver, spleen, lung, kidney, brain, and testis ranged from 51.34% to 71.24% (Figure 7E), similar to the editing frequency in the tail (Figure 7E). Finally, minimal indels were detected in the embryos or offspring treated with BEACONs (Figure S5F) and only a background level of distal OT editing (the base editing at OT sites where the crRNA potentially binds to) was detected in the tissues of the C11-edited mouse offspring (Figure S6), demonstrating the editing specificity induced by BEACON.",
                                "To further compare in vivo editing induced by BEACON2 with BE3 and AncBE4max, we also examined their efficiencies in mouse embryos at a target site within their overlapped editing windows (Wang et al., 2019; Figure S7). Both BE3 and AncBE4max achieved very efficient C-to-T editing in injected mouse embryos (16 of 16 embryos edited and 14 of 15 embryos edited, respectively), and BEACON2 induced a relatively lower efficiency (8 of 15 embryos edited) (Figures S7A-S7D). These results suggested that the nickase activity is beneficial for in vivo editing efficiency. However, both BE3 and AncBE4max induced significant levels of indels in mouse embryos but BEACON2 did not (Figures S7E-S7G), consistent with the in vitro results (Figures 5D and 5G)."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "DISCUSSION",
                    "paragraphs": [
                        "Great efforts have been made to develop more efficient and specific BEs for correcting pathogenic-related point mutations to treat relevant diseases (Ranzau and Komor, 2019;Rees and Liu, 2018;Yang et al., 2019), e.g., using nCas9 to boost editing efficiency and introducing alternations in the APOBEC moiety of BEs to suppress unwanted RNA editing (Gr€ unewald et al., 2019;Komor et al., 2016;Nishida et al., 2016;Rees et al., 2019;Zhou et al., 2019). Besides the unwanted OT effects, nCas9-derived BEs also caused the formation of DSBs (Komor   , 2016;Lei et al., 2018;Nishida et al., 2016). DSBs can activate downstream DDR proteins, e.g., the phosphorylation of p53 and H2AX, to disturb cellular homeostasis and eventually cause cell death (Haapaniemi et al., 2018;Ihry et al., 2018), especially when simultaneous editing at multiple sites is pursued (Niu et al., 2017). In addition, it has been reported that DSBs also trigger large deletions or chromosomal rearrangements (Kosicki et al., 2018). As therapeutic applications of gene editing generally involve stem cells or primary cells, in which DDR pathways are active, the unavoidable DNA breaks induced by nCas9derived BEs may impede their applications in clinics. Different from nCas9-based BEs, DSBs that are induced by dCas12aconjugated BEs were barely detectable (Figures 5D and5G); also, dCas12a-conjugated BEs activate lower levels of DDR proteins, including gH2AX and p53 (Figure 5H), than nCas9-BEs, shedding new light on the potential of dCas12a-conjugated BEs in therapeutics. The original dCas12a-based BE exhibited relatively low editing efficiency (Li et al., 2018), which hampers its application in vivo. In this study, we screened different APOBEC/AID members and found that the fusion of hA3A-dCas12a could induce efficient base editing (Figure 2). With a series of structureguided protein engineering, codon optimization, and editing window narrowing (Figures 3 and4), we further developed the BEACON system, which induced high editing efficiency in mammalian cells (Figure 5) and in mouse embryos (Figure 7). The construction of BEACON also has several advantages in terms of editing precision. First, given that Cas12a has a generally high targeting specificity (Kim et al., 2016;Kleinstiver et al., 2016;Yan et al., 2017), we examined the editing induced by BEACON in vivo at predicted genomic OT sites and found BEA-CON induced undetectable OT editing at these sites (Figure S6). Moreover, BEACONs with the Y130F or Y132D alternation in the hA3A moiety have narrowed editing windows (Figures 4D,4E, 4F, and S3B), which enable precise base editing when multiple cytosines locate in a same target site (Figures 7C and7E). Finally, we also compared the RNA OT mutations triggered by various BEs and found that BEACON2 induced only background levels of OT editing transcriptome wide (Figure 6). Of note, the incorporation of hA3A in BEACON may also induce efficient base editing in methylated DNA regions and/or GpC sites, as previously developed hA3A-nCas9-BE did (Wang et al., 2018).",
                        "In summary, we developed a dCas12a-based BEACON system and successfully applied it for both in vitro and in vivo editing (Table S1). The BEACON system achieves efficient and specific base editing without generating DNA breaks or triggering DDR cascades, which is essential for its broad applications in mammalian cells and in clinics."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "STAR+METHODS",
            "paragraphs": [
                "Detailed methods are provided in the online version of this paper and include the following:   "
            ],
            "subsections": [
                {
                    "title": "RESOURCE AVAILABILITY",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Lead Contact",
                            "paragraphs": [
                                "Further information and requests for resources and reagents should be directed to and will be fulfilled by the Lead Contact, Jia Chen (chenjia@shanghaitech.edu.cn)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Materials Availability",
                            "paragraphs": [
                                "This study did not generate new unique reagents."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Data and Code Availability",
                            "paragraphs": [
                                "The original DNA deep-sequencing and RNA sequencing data from this study have been deposited in the NCBI Gene Expression Omnibus (GEO: GSE145552) and the National Omics Data Encyclopedia (accession number OEP000822)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "EXPERIMENTAL MODEL AND SUBJECT DETAILS Animals",
                            "paragraphs": [
                                "All mice experiment procedures were approved by the Animal Care and Use Committee of the Institute of Neuroscience, Chinese Academy of Sciences, Shanghai, China. Mice were maintained in standard cages in an Assessment and Accreditation of Laboratory Animal Care credited specific pathogen free facility under a 12 hr dark-light cycle. Sample sizes were estimated based on experiments in similar studies, and the experiments were not randomized or blinded. Female B6D2F1 (C57BL/6 3 DBA2J) mice (4-week-old) were superovulated and mated with male B6D2F1 mice (4-week-old). The injected zygotes were cultured in KSOM medium at 37 C (in 5% CO2) and transferred to oviducts of pseudopregnant females (ICR mice, 10-week-old).",
                                "Human cell lines and cell culture HEK293T and U2OS cells from ATCC were maintained in DMEM (10566, GIBCO/Thermo Fisher Scientific) + 10% FBS (16000-044, GIBCO/Thermo Fisher Scientific) and regularly tested to exclude mycoplasma contamination."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "METHOD DETAILS",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Plasmid construction",
                            "paragraphs": [
                                "Primer sets (hA3A_dCpf1_PCR_F/hA3A_ dCpf1_PCR_R) were used to amplify the fragment Human_APOBEC3A with template pUC57-Human_APOBEC3A (synthesized by Genscript). Then the fragment Human_APOBEC3A was cloned into the SacI and SmaI linearized dCpf1-BE with plasmid recombination kit Clone Expressâ (Vazyme, C112-02) to generate the hA3A-dCas12a-BE expression vector pCMV-SV40NLS-hAPOBEC3A-XTEN-dLbCpf1(D832A/E1006A/D1125A)-SV40NLS-SGGS-UGI-SV40NLS. hA3B-dCas12a-BE and hAID-dCas12a-BE expression vectors were constructed with the same strategy.",
                                "Two primer sets (hA3A_dCpf1_PCR_F/hA3A_dCpf1_W98A_PCR_R) (hA3A_dCpf1_W98A_PCR_F/hA3A_dCpf1_PCR_R) were used to amplify the W98A-containing fragment hA3A-W98A. Then the fragments were cloned into the ApaI and SmaI linearized hA3A-dCas12a-BE expression vector to generate the hA3A W98A -dCas12a-BE expression vector pCMV-SV40NLS-hAPOBEC3A_W98A-XTEN-dLbCpf1(D832A/E1006A/D1125A)-SV40NLS-SGGS-UGI-SV40NLS.",
                                "hA3A W98Y -dCas12a-BE, hA3A W104A -dCas12a-BE, hA3A W104Y -dCas12a-BE, hA3A P134A -dCas12a-BE, hA3A P134Y -dCas12a-BE, hA3A C101S -dCas12a-BE, hA3A C106S -dCas12a-BE, hA3A W98Y/W104A -dCas12a-BE, hA3A W98Y/P134Y -dCas12a-BE, hA3A W104A/P134Y -dCas12a-BE and hA3A W98Y/W104A/P134Y -dCas12a-BE expression vectors were constructed with the same strategy.",
                                "pCMV-hA3A-dCas12a-BE-op was commercially synthesized. Two primer sets (hA3A_dCpf1_PCR_F-op/hA3A_dCpf1_ W104A_PCR_R-op) (hA3A_dCpf1_W104A_PCR_F-op/hA3A_dCpf1_PCR_R-op) were used to amplify the W104A containing fragment hA3A-W104A-op. Then the fragments were cloned into the NotI and SmaI linearized hA3A-dCas12a-BE-op expression vector to generate the hA3A W104A -dCas12a-BE-op expression vector pCMV-SV40NLS-hAPOBEC3A_W104A-XTEN-dLbCpf1(D832A/E1006A/D1125A)-SV40NLS-SGGS-UGI-SV40NLS-op.",
                                "hA3A W104A/Y130F -dCas12a-BE-op, hA3A W104A/Y132D -dCas12a-BE-op, hA3A W98Y/W104A -dCas12a-BE-op, hA3A W98Y/W104A/Y130F -dCas12a-BE-op, hA3A W98Y/W104A/Y132D -dCas12a-BEop, hA3A W104A/P134Y -dCas12a-BE-op, hA3A W104A/P134Y/Y130F -dCas12a-BE-op, hA3A W104A/P134Y/Y132D -dCas12a-BE-op and hA3A W98Y/W104A/Y130F/Y132D -dCas12a-BE-op expression vectors were constructed with the same strategy.",
                                "Primer sets (T7-LBCpf1-For/T7-LBCpf1-REV) were used to construct the pLb-Cpf1-pGL3-T7-crRNA expression vector with template pLb-Cpf1-pGL3-U6-sgRNA. Then the fragment was recombinated by plasmid recombination kit Clone Expressâ (Vazyme, C112-02).",
                                "Oligonucleotides hDYRK1A_cpf1_FOR/hDYRK1A_cpf1_REV were annealed and ligated into BsaI linearized pLb-Cpf1-pGL3-U6-sgRNA to generate crDYRK1A expression vector pcrDYRK1A. Oligonucleotides hDYRK1A_cpfsp_FOR/ hDYRK1A_cpfsp_REV were annealed and ligated into BsaI linearized pGL3-U6-sgRNA-PGK-puromycin to generate sgDYRK1A expression vector psgDYRK1A. Other crRNA and sgRNA expression vectors were constructed by the same The sequences of the oligos used for plasmid construction are listed in Table S2 and the amino acid sequences of BEs are listed in Table S3."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Transfection",
                            "paragraphs": [
                                "For base editing in genomic DNA, HEK293T and U2OS cells were seeded in a 24-well plate at a density of 1.6 3 105 per well and transfected with 200 mL serum-free Opti-MEM that contained 5.04 mL LIPOFECTAMINE LTX (Life, Invitrogen), 1.68 mL LIPOFECT-AMINE plus (Life, Invitrogen), 1 mg rA1-dCas12a-BE expression vector (or hA3A-dCas12a-BE, hA3B-dCas12a-BE, hAID-dCas12a-BE, hA3A W98A -dCas12a-BE, hA3A W98Y -dCas12a-BE, hA3A W104A -dCas12a-BE, hA3A W104Y -dCas12a-BE, hA3A P134A -dCas12a-BE, hA3A P134Y -dCas12a-BE, hA3A C101S -dCas12a-BE, hA3A C106S -dCas12a-BE, hA3A -dCas12a-BE, hA3A W98Y/P134Y -dCas12a-BE, hA3A W104A/P134Y -dCas12a-BE, hA3A W98Y/W104A/P134Y -dCas12a-BE, hA3A W104A -dCas12a-BE-op, hA3A W104A/Y130F -dCas12a-BE-op, hA3A W104A/Y132D -dCas12a-BE-op, hA3A W98Y/W104A -dCas12a-BE-op, hA3A W98Y/W104A/Y130F -dCas12a-BE-op, hA3A W98Y/W104A/Y132D -dCas12a-BE-op, hA3A W104A/P134Y -dCas12a-BE-op, hA3A W104A/P134Y/Y130F -dCas12a-BEop, hA3A W104A/P134Y/Y132D -dCas12a-BE-op and hA3A W98Y/W104A/Y130F/Y132D -dCas12a-BE-op, BE3 (addgene, #73021), BE2 (addgene, #73020), YE1-BE3 (addgene, #85174) and AncBE4max (addgene, #112094) expression vector) and 0.68 mg crRNA or sgRNA expression vector. After 72hr, the genomic DNA was extracted from the cells with QuickExtract DNA Extraction Solution (QE09050, Epicenter) or the cells were lysed in 2 3 SDS loading buffer for western blot."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Cell sorting and RNA extraction",
                            "paragraphs": [
                                "After 40hr after transfection, Cells in the first 15% of the fluorescence intensity were sorted by FACSAriaIII. Total RNAs of sorted cells were extracted by using the RNeasy Mini Kit (QIAGEN #74104).",
                                "In vitro transcription rA1-dCas12a-BE, hA3A W104A/Y132D -dCpf1-BE-op, hA3A W98Y/W104A/Y130F -dCpf1-BE-op, BE3 (addgene, #73021) and AncBE4max (addgene, #112094) vector including T7 promoter was linearized by BbsI (NEB, R3539L) and in vitro transcribed using T7 Ultra Kit (Ambion, AM1345). mRNA was purified by Mini Kit (QIAGEN,74104). crRNA oligos were annealed into LbCpf1-pGL3-T7-crRNA expression vectors with T7 protomer. Then crRNA was amplified and in vitro transcribed by MEGAshortscript Kit (Ambion, AM1354). The sgRNAs were purified by MEGAclear Kit (Ambion, AM1908) according to the manufacturer's protocols. sgRNA expression vectors were constructed by the same way. Primers used for transcription in vitro were listed in Table S4."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Microinjection and embryos transfer",
                            "paragraphs": [
                                "Female B6D2F1 (C57BL/6 3 DBA2J) mice (4-week-old) were superovulated and mated with male B6D2F1 mice. One-cell-stage embryos were collected to inject with crRNA/sgRNA (50 ng/ml) and rA1-dCas12a-BE, BEACON1, BEACON2, BE3 and AncBE4max (100 ng/ml) into the cytoplasm of zygotes in a droplet of M2 medium containing 5 mg/ml cytochalasin B (CB) using a piezo (Primetech) microinjector. The injected zygotes were cultured in KSOM mediums at 37 C under 5% of CO2 in air and transferred to oviducts of pseudopregnant females at 0.5 day post copulation."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Western blot",
                            "paragraphs": [
                                "Transfected cells were lysed in NP40 lysis buffer (50 mM Tris pH 8.0, 150mM NaCl, 1% NP-40, 0.1% SDS, 1mM PMSF, protease inhibitors, and phosphatase inhibitor) for 30 min on ice, then incubated at 97 C for 15 min, separated by SDS-PAGE (Genscript) in sample loading buffer and proteins were transferred to nitrocellulose membranes (Thermo Fisher Scientific). After blocking with TBST (25 mM Tris pH 8.0, 150 mM NaCl, and 0.1% Tween 20) containing 5% (w/v) nonfat dry milk and 1% BSA for 2h, the membrane was reacted overnight with indicated primary antibody. After extensive washing, the membranes were reacted with HRP-conjugated secondary antibodies for 1h. Reactive bands were developed in ECL (Thermo Fisher Scientific) and detected with Amersham Imager 680."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Immunofluorescence",
                            "paragraphs": [
                                "Transfected U2OS cells were fixed in 4% PFA for 1 hour at 4 C. After washing in PBS, cells were blocked with PBS containing 0.3% Triton X-100 and 2.5% BSA for 1 hour. Then, cells were incubated overnight at 4 C with primary antibodies (anti-gamma H2AX, 1:300) diluted in PBS containing 0.1% Tween-20. Signals were developed with Alexa Fluor secondary antibodies (Abcam, 1:500) at room temperature for 1 hour after washing in PBST (0.1% Tween-20). Before mounting, cells were counterstained with DAPI. Pictures were collected on a confocal microscope (Zeiss LSM800)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "DNA library preparation and sequencing",
                            "paragraphs": [
                                "Target genomic sites were PCR amplified by high-fidelity DNA polymerase PrimeSTAR HS (Clonetech) with primers flanking each examined crRNA or sgRNA target site. The PCR primers used to amplify target genomic sequences were listed in Table S4. Indexed DNA libraries were prepared by using the TruSeq ChIP Sample Preparation Kit (Illumina) with some minor modifications. Briefly, the PCR products were fragmented by Covaris S220 and then amplified by using the TruSeq ChIP Sample Preparation Kit (Illumina). After being quantitated with Qubit High-Sensitivity DNA kit (Life, Invitrogen), PCR products with different tags were pooled together for e4 Cell Reports 31, 107723, June 2, 2020 Article deep sequencing by the Illumina NextSeq 500 (2 3 150) or Hiseq X Ten (2 3 150) at CAS-MPG Partner Institute for Computational Biology Omics Core, Shanghai, China. Raw read qualities were evaluated by FastQC (http://www.bioinformatics.babraham.ac.uk/ projects/fastqc/). For paired-end sequencing, only R1 reads were used. Adaptor sequences and read sequences on both ends with Phred quality score lower than 28 were trimmed. Trimmed reads were then mapped with the BWA-MEM algorithm (BWA v0.7.9a) to target sequences. After being piled up with samtools (v0.1.18), indels and base substitutions were further calculated."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "QUANTIFICATION AND STATISTICAL ANALYSIS RADAR",
                    "paragraphs": [
                        "We developed a computational pipeline RADAR (RNA-editing Analysis-pipeline to Decode All twelve-types of RNA-editing events, https://github.com/YangLab/RADAR) to detect and visualize all possible twelve-types of RNA editing events from RNA-seq datasets. RADAR consists of three steps (Figure S4E).",
                        "STEP 1: RNA-seq read mapping. After quality control by FastQC (version 0.11.4, parameters: default), RNA-seq reads are trimmed by Trimmomatic (version 0.36, parameters: TruSeq3-PE-2.fa:2:30:10 TRAILING:25 MINLEN:30) (Bolger et al., 2014) to remove read sequences with low quality, and then mapped to ribosomal DNA (rDNA) sequences by BWA-MEM algorithm (version 0.7.9a, parameters: default) to remove reads mapped to redundant rRNAs. To capture more mismatches for RNA editing candidates, a two-round unique mapping strategy is then applied to align high-quality RNA-seq reads to human hg38 reference genome, sequentially by HI-SAT2 (version 2.1.0, parameters:-rna-strandness RF-no-mixed-secondary-no-temp-splicesite-known-splicesite-infile-no-softclip-score-min L,-16,0-mp 7,7-rfg 0,7-rdg 0,7-max-seeds 20 -k 10-dta) (Kim et al., 2019) with up to two mismatches and by BWA-MEM (version, parameters: default). Unique mapped reads by HISAT2 and BWA-MEM with up to six mismatches are selected and combined for subsequent analysis. After marking duplicate reads identified by Picard (version 2.7.1, parameters: CREATE_IN-DEX = true VALIDATION_STRINGENCY = SILENT) in the BAM file, uniquely-mapped reads that span exon-exon junctions are split into segments by the GATK (version 4.1.2.0) (McKenna et al., 2010) command, SplitNCigarReads (parameters: default). Base quality scores of all uniquely-mapped reads are recalibrated by two GATK (version 4.1.2.0) commands, BaseRecalibrator (parameters: default) and ApplyBQSR (parameters: default).",
                        "STEP 2: RNA editing calling. RNA variants are determined from the BAM file with uniquely-mapped reads by the GATK (version 4.1.2.0) command HaplotypeCaller (parameters:-minimum-mapping-quality 0-stand_call_conf 0-dont-use-soft-clipped-bases true). After filtering out RNA variants overlapped with single nucleotide polymorphisms (SNPs) from dbSNP version 151 (https:// www.ncbi.nlm.nih.gov/SNP/), the 1000 Genomes Project (https://www.internationalgenome.org/) and the University of Washington Exome Sequencing Project (https://evs.gs.washington.edu/EVS/), low-quality RNA variants with mapped read numbers < 2, hits per billion-mapped-bases (HPB; Zhu et al., 2013) < 3 or editing ratio < 0.05 were further removed.",
                        "RNA variants for potential RNA editing events are classified into three groups according to their genomic locations as previously described (Ramaswami et al., 2013), including in Alu, non-Alu repetitive or non-repetitive regions. Different to those in Alu regions, RNA variants in non-Alu repetitive and non-repetitive regions are further filtered with a series of stringent cutoffs to remove false positive. In brief, RNA variants in simple repeats, in mononucleotide microsatellites R 5 bp or within 4 bp of splice junctions are removed. In addition, BLAST-like alignment tool (BLAT, version 364, parameters: -repMatch = 2253 -stepSize = 5) (Kent, 2002) is used to remove RNA variants within highly similar regions. Finally, RNA variants within bidirectional transcription regions are also removed.",
                        "All twelve types of RNA editing events in Alu, non-Alu repetitive and non-repetitive regions are eventually determined according to the strands of overlapped genes (Human: hg38 knownGene.txt updated at 2015/6/28).",
                        "STEP 3: RNA editing visualizing. All possible RNA-editing events from each given RNA-seq dataset are listed in an Excel file. Numbers of all twelve-types of RNA editing events are plotted by histograms according to their genomic locations in Alu, repetitive non-Alu and non-repetitive regions. Manhattan plots are further used to illustrate RNA editing ratios of selected types of RNA-editing events, such as C-to-U or A-to-G."
                    ],
                    "subsections": [
                        {
                            "title": "Image analysis/Immunostaining quantification",
                            "paragraphs": [
                                "The intensities of western blot bands were determined with ImageJ."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Indel frequency calculation",
                            "paragraphs": [
                                "For dCas12a-BEs, indels were estimated in the aligned regions spanning from upstream 3 nucleotides to the downstream 48 nucleotides both according to PAM sites (55bp). For dCas9-and nCas9-BEs, indels were estimated in the aligned regions spanning from upstream 8 nucleotides to the target sites to downstream 19 nucleotides to PAM sites (50 bp). Indel frequencies were subsequently calculated through dividing the counts of reads containing at least one inserted and/or deleted nucleotides by the counts of all the mapped reads in the same region. Counts of indel-containing reads and total mapped reads are listed in Table S5."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Base substitution calculation",
                            "paragraphs": [
                                "Base substitutions were selected at each position of the examined crRNA or sgRNA target sites that mapped with at least 1,000 independent reads, and obvious base substitutions were only observed at the targeted base editing sites. Counts of reads for each base and total reads are listed in Table S6. Base substitution frequencies were calculated by dividing base substitution reads by total reads. Figures depicting the interaction between hA3A and ssDNA were prepared using the Pymol program (The PyMOL Molecular Graphics System, Version 2.1 Schro ¨dinger, LLC.) All mutant hA3A-DNA complex structures were modified from the structure of hA3A in complex with ssDNA (PDBid:5KEG) and then energy optimized using Protein Preparation Wizard from Schrodinger Suite 2019-1 (https://www.schrodinger.com) following default settings. The simulation systems were solvated with SPC water and neutralized, containing ClÀ and Na + ions at a concentration of 0.15 M to mimic physiological ionic strength. 200 ns molecular dynamics simulations were then performed with Desmond from Schrodinger Suite 2019-1(https://www.schrodinger.com), using OPLS3 force field. During the simulation, a Desmond implemented muti-stage MD simulation protocol was employed with Temperature T and pressure P kept constant at 310 K and 1 atm, respectively. The RMSD and RMSF of protein and DNA molecule as well as the protein-ligand contacts diagram were calculated with Simulation Interactions Diagram from Schrodinger Suite 2019-1 (https://www. schrodinger.com). The binding energy between hA3A variants and ssDNA along the simulation trajectory was calculated with third-party script thermal_mmgbsa.py from Schrodinger, with a step_size of 2."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Statistical analysis",
                            "paragraphs": [
                                "For all figures, error bars show mean ± SD. Statistics and graphs were prepared using Prism software version 8. Statistical significance of differences in C-to-T editing frequency, indel frequency and C-to-T fraction were determined using Student's t test (onetailed). For all tests, p values of < 0.05 were considered statistically significant."
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        }
    ]
}