{
    "id": "https://semopenalex.org/work/W2164040197",
    "authors": [
        "Martín C. Mihm",
        "David C. Ward",
        "Yupo Ma",
        "Milton Waner",
        "Jianchang Yang",
        "Dan Xu",
        "Louis M. Fink",
        "Archil Shartava",
        "Taylor C. Fowles",
        "Murray Teresa"
    ],
    "title": "Isolation, characterization, and in vitro propagation of infantile hemangioma stem cells and an in vivo mouse model",
    "date": "2011-12-01",
    "abstract": "Infantile hemangiomas (IH) are the most common benign tumors of infancy. The typical clinical course consists of rapid growth during the first year of life, followed by natural and gradual involution over a multi-year time span through unknown cellular mechanisms. Some tumors respond to medical treatment with corticosteroids or beta-blockers, however, when this therapy fails or is incomplete, surgical extirpation may be necessary. Noninvasive therapies to debulk or eliminate these tumors would be an important advance. The development of an in vitro cell culture system and an animal model would allow new insights into the biological processes involved in the development and pathogenesis of IH.We observed that proliferative stage IH specimens contain significantly more SALL4+ and CD133+ cells than involuting tumors, suggesting a possible stem cell origin. A tumor sphere formation assay was adapted to culture IH cells in vitro. Cells in IH tumor spheres express GLUT1, indicative of an IH cell of origin, elevated levels of VEGF, and various stem/progenitor cell markers such as SALL4, KDR, Oct4, Nanog and CD133. These cells were able to self-renew and differentiate to endothelial lineages, both hallmarks of tumor stem cells. Treatment with Rapamycin, a potent mTOR/VEGF inhibitor, dramatically suppressed IH cell growth in vitro. Subcutaneous injection of cells from IH tumor spheres into immunodeficient NOD-SCID mice produced GLUT1 and CD31 positive tumors with the same cellular proliferation, differentiation and involution patterns as human hemangiomas.The ability to propagate large numbers of IH stem cells in vitro and the generation of an in vivo mouse model provides novel avenues for testing IH therapeutic agents in the future.",
    "sections": [
        {
            "title": "Background",
            "paragraphs": [
                "Infantile hemangiomas are benign tumors whose proliferative phase during the first year of life is characterized by a rapid outgrowth of vascular endothelial cells. An involuting phase then occurs lasting up to 10 years with replacement of vascular tissues by fibrofatty tissues[1-4]. Clinically, most hemangiomas present few serious health problems. In some cases, they may be extremely disfiguring, impede vision, cause airway obstruction or congestive heart failure [5-7]. Traditionally, medical therapy for IH involved the use of topical, intralesional or systemic corticosteroids. This has now largely been replaced by beta-blockers. When medical therapy fails or is incomplete, surgical resection is necessary [8,9].",
                "Depending on the patient's age and degree of surgical resection, these vascular tumors may recur at the same location[10]. This suggests either incomplete surgical resection or the presence of a population of tumor stem cells that is responsible for recurrence[11]. The isolation of IH stem cells using anti-CD133 antibodies and immunomagnetic techniques was recently reported [12]. Transplantation of these cells into nude mice produced tumors that were composed of endothelial cells and blood vessels. However, while the formation of blood vessels was followed by involution and fibrofatty tissue production, no obvious proliferative phase was observed.",
                "In the study reported herein, the isolation of IH stem cells was accomplished using growth in selective culture media. These cells form tumor spheres that express CD133 [13,14] and other stem/progenitor cell markers and possess self-renewal capabilities. The tumor sphere cells can be differentiated to GLUT1-expressing cells (indicative of an IH cell origin) [15-17] by exposure to VEGF.",
                "By multiplex Luminex analysis, we demonstrated that a specific growth factor, VEGF, is secreted from the IH tumor spheres and that an mTOR/VEGF inhibitor, Rapamycin, dramatically inhibits IH tumor stem cell growth. Furthermore, when cells from tumor spheres are injected into nude mice, they recapitulate human IH tumors, exhibiting characteristic proliferative and involuted phases."
            ],
            "subsections": []
        },
        {
            "title": "Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Patient Samples",
                    "paragraphs": [
                        "Infantile hemangioma tissues were obtained with approval of Yale University Institutional Review Board and all participants gave informed written consent."
                    ],
                    "subsections": []
                },
                {
                    "title": "Immunohistochemical Staining",
                    "paragraphs": [
                        "Staining was performed according to standard techniques as previously reported [18]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Ih Tumor Sphere Culture",
                    "paragraphs": [
                        "Post-operative IH tissue samples were washed using PBS and transferred into a sterile Petri dish. The tissue was minced into a fine paste (1 × 1 mm2) and washed with PBS again. IH tissues were then digested with 2 mg/ml collagenase (Invitrogen, CA) for at least 2 hours shaking at 37°C. The cells were dispersed by repeat passage through a pipette tip and filtration through a 100 μM nylon cell strainer. Cells were plated on low attachment Petri dish at a density of 2 × 105 cells/ml using a stem cell culture (SCC) media (all ingredients from Invitrogen, CA) consisting of Knockout DMEM, 15% Knockout Serum Substitute, 1x non-essential amino acids (NEAA), and 20 ng/ml of both basic fibroblast growth factor (bFGF) and human endothelial growth factor (hEGF). Tumor spheres were passaged approximately every seven days (roughly 200 cells/sphere); spheres were washed once with PBS and then single cell suspension made by incubation with 2 mg/ml collagenase IV at 37°C for 10 minutes."
                    ],
                    "subsections": []
                },
                {
                    "title": "Differentiation Of Ih Tumor Spheres",
                    "paragraphs": [
                        "Tumor spheres were transferred to gelatin coated dishes to attach and were differentiated using IH differentiation medium containing Knockout DMEM, 15% Knockout Serum Substitute, 1x non-essential amino acids (NEAA), 20 ng/ml each of basic fibroblast growth factor (bFGF), 20 ng/ml human endothelial growth factor (hEGF), and 50 ng/ml vascular endothelial growth factor (VEGF) (R&D Minneapolis MN)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Immunofluorescent Staining",
                    "paragraphs": [
                        "Cells were fixed with 4% freshly prepared paraformaldehyde for 15 minutes. Following three washes, the cells were blocked with 5% bovine serum albumin (BSA) in 1x phosphate buffered saline-Triton X-100 (TPBS) for 1 h at room temperature. Primary antibodies [mouse anti-GLUT1 (1:80 Abcam, Cambridge, MA), rabbit anti- GLUT1 (1:80, Abcam, Cambridge, MA), rabbit anti-mouse FDR (1:50, Alpha Diagnostic International, San Antonio, TX), rat-anti-mouse CD31 (1:25 BD Biosciences, San Jose, CA), rabbit anti-CD133 (1:25 Biocare Medical, Concord, CA) or rabbit anti-SALL4 (1:400; developed by this laboratory)] in TPBS/1% BSA were added to the tissue sections and the slides were incubated at 4°C overnight. Following a wash with TPBS, an appropriate secondary antibody [goat anti-rabbit-FITC (SouthernBiotech, Birmingham, AL), goat anti-rabbit-RPE (SouthernBiotech, Birmingham, AL), donkey anti-mouse-Rhodamine (Chemicon, Temecula, CA), or donkey anti-mouse-FITC (Sigma, Louis, MO)] was added and the slides were incubated at room temperature for 2 h in the dark. After another three washes with TPBS, the cells were counterstained with 50 ng/ml 4', 6-diamidino-2-phenylindole (DAPI) for 10 minutes."
                    ],
                    "subsections": []
                },
                {
                    "title": "Measurement Of Growth Factor Secretion From Tumor Spheres",
                    "paragraphs": [
                        "Tumor spheres were cultured in stem cell culture media for 15 days. The conditioned media, which had been exposed to the tumor cells for 5, 10 and 15 days, was collected and analyzed for the levels of the growth factors (VEGF, EGF, FGF basic and G-CSF) using the human growth factor (GF)4-Plex kit (Invitrogen, Carlsbad, CA) and following manufacture's recommended protocol."
                    ],
                    "subsections": []
                },
                {
                    "title": "Rapamycin, A Potent Mtor/Vegf Inhibitor, Suppresses Proliferation Of Ih Tumor Stem Cells In Vitro",
                    "paragraphs": [
                        "Tumor spheres were seeded onto Petri dishes and exposed to 1 nM, 2 nM, and 4 nM Rapamycin in stem cell culture media (see Methods, IH Tumor Sphere Culture) for 10 days. Approximately 30 tumor spheres were collected at each time point (0, 3, 6 and 10 days), dissociated by collagenase IV to single cells and counted for cell numbers. Each sample was assayed in triplicate."
                    ],
                    "subsections": []
                },
                {
                    "title": "Mouse Model",
                    "paragraphs": [
                        "IH tumor spheres cultured for one week were dissociated by collagenase to single cells and resuspended in Matrigel at a concentration of 5 × 106 cells per ml. 200 μl (106 cells) was injected subcutaneously in both sides of flanks of immunodeficient NOD/SCID mice. Matrigel with PBS or 0.9% NaCl (without tumor cells) was injected into two additional subcutaneous sites as a control. After 10, 20 and 30 days, the mice were sacrificed, the tumor tissues excised, and fixed in formalin. Some tissue sections were stained with standard hematoxylin and eosin (H & E). Other IH tissue sections were analyzed using anti-Glut1 antibody and anti-CD31, a human endothelial cell marker, for their expression levels."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Isolation And In Vitro Culture Of Hemangioma Stem Cells",
                    "paragraphs": [
                        "Until now, there has been no adequate in vivo model to evaluate novel therapeutic modalities for IH. The ability to culture IH specimens would be an extremely valuable translational research tool. Recently, Khan and colleagues described an hemangioma stem cell population that expressed CD133 and, when transplanted into nude mice, produced tumors that shared many characteristics of hemangiomas but lacked an obvious proliferative stage[12].",
                        "Our group and others [19,20] have previously shown that mouse SALL4 plays an essential role in maintaining the self-renewal and pluripotent properties of embryonic stem (ES) cells and in governing the fate of the inner cell mass through transcriptional modulation of Oct4 (also known as Pou5f1) and Nanog [19-24]. We have also observed expression of SALL4 in hematopoietic stem cells suggesting a role in stem cells of various organ systems [25,26]. Very recently, we demonstrate that SALL4 acts as a robust stimulator for both human and mouse hematopoietic stem/progenitor cell ex vivo proliferation [27-29]. We have hypothesized that IHs are a stem cell disease and sought to determine if IHs express either SALL4 and/or CD133. By flow cytometry assay, it was shown that the proliferative IHs expressed both markers either alone or together (data not shown). Indeed, using immunohistochemistry, we observed significantly more cells expressing SALL4 and CD133 in proliferative IHs than in involuting phase IHs (Figure 1). This supports the hypothesis that IHs may involute because of depletion of stem cells or endothelial progenitor cell populations.",
                        "We next sought to establish an in vitro culture system to study the proliferation of IHs. Primary surgical specimens were dissociated and plated on Petri dishes in serum-free media. Mature endothelial cells and fibroblasts were unable to survive in these conditions. However, structures resembling the tumor spheres of other tumor types were able to grow as shown in Figure 1, 1. Tumor spheres derived from IH samples could be cultured for prolonged periods of time (currently up to passage 30). In addition, IH tumor spheres could also be expanded into high density cultures (Figure 1) - an advantageous feature for therapeutic uses. The IH tumor spheres also resembled induced pluripotent (iPS) stem cells that have been generated from fibroblasts in our laboratory (Figure 1, 1), and also express SALL4. This suggests that the tumor spheres may contain stem cells."
                    ],
                    "subsections": []
                },
                {
                    "title": "Characterization Of Ih Tumor Spheres",
                    "paragraphs": [
                        "Next, we wanted to ensure that spheres formed in our assay were enriched for stem/progenitor cell markers and that IHs were the cell of origin. As shown in Figure 2 and 2, these spheres were positive when immunostained with antibodies against human stem cell markers, SALL4 and CD133, and FDR (an early marker for endothelial cell precursors) as well as an IH signature marker, GLUT1. These data suggest that IH tumor spheres are enriched for stem cells or progenitor cells and that they express markers for early endothelial differentiation and are derived from IH tissue.",
                        "Since IH tumor spheres express markers for immature cell lineages and they are the IH cell of origin, we sought to examine if tumor spheres bear the stem cell properties of self renewal and differentiation. Following the preparation of single cell suspensions, replating of single cells from tumor spheres gave rise to secondary tumor spheres within 3 to 4 days. The process of dissociation to single cells was repeated and the formation of tertiary tumor spheres was observed (Figure 3 and 3) and tumor spheres could be passaged for prolonged periods of time (currently up to passage 30). This suggests that tumor spheres are able to self renew in the absence of differentiation signals. When tumor spheres were cultured in media favoring endothelial differentiation using VEGF, they would adhere and differentiate toward an endothelium- like morphology (Figure 3 and 3). The differentiating tumor spheres continually expressed GLUT1 (Figure 3). Expression of an endothelial marker, CD31, increased from day 3 to day 12 and expression of CD133 decreased over the same time period (Figure 3). This data illustrates that tumor spheres derived from IH tissues have stem cell properties and supports the hypothesis that IH is a stem cell disease."
                    ],
                    "subsections": []
                },
                {
                    "title": "Tumor Spheres Specifically Secrete Vegf (Vascular Endothelial Growth Factor)",
                    "paragraphs": [
                        "Studies have indicated that tumor stem cells often contribute to or are associated with a microenvironmental niche. Understanding this process may allow development of a tumor stem cell therapy. We measured the concentration of growth factors, VEGF, EGF, FGF basic and G-CSF, in tumor sphere culture media at different time points (Figure 4). The level of the growth factors in the media was set as a background (blank). These values were automatically deducted by the software from the concentrations of the growth factors which were measured in the samples of interest. The concentrations were derived from the measured level of fluorescence in the samples by comparison with the fluorescence of the standard curve of known concentrations. The values for EGF, bFGF and G-CSF were below the range of the standard curve and considered as insignificant. Thus they are not presented on the graph. Media was collected on day 0, 5, 10 and 15 and analyzed for the level of growth factors by using the Human Growth Factor (GF) 4-Plex Kit (Invitrogen, Carlsbad, CA). The concentration of VEGF was undetectable at day 0 but became detectable at day 5 and was significantly increased during the 15-day measurement period (Figure 4). However, none of the other growth factors including EGF were detectable during the 15 days."
                    ],
                    "subsections": []
                },
                {
                    "title": "Treatment With Rapamycin, A Potent Mtor/Vegf Inhibitor, Dramatically Inhibits Proliferation Of Ih Tumor Stem Cells In Vitro",
                    "paragraphs": [
                        "As shown above, IH tumor stem cells were able to specifically secrete VEGF and this study indicates that VEGF may play a significant role in tumor stem cell growth. Should this hypothesis be correct, inhibition of VEGF functions should inhibit IH stem cell growth [30-32]. In fact, treatment of IH tumor stem cells with Rapamycin leads to inhibition of the growth of IH stem cells in our tumor sphere culture system. As shown in Figure 4, three different concentrations of Rapamycin, 1 nM, 2 nM and 4 nM, all in a biologically significant range, inhibited IH stem cell growth in a dose dependent manner. At days 0, 3, 6, 10, tumor sphere samples were collected, dissociated with collagenase IV, and the number of cells counted. Treatment with Rapamycin dramatically inhibited IH tumor stem cell growth."
                    ],
                    "subsections": []
                },
                {
                    "title": "In Vivo Mouse Model",
                    "paragraphs": [
                        "In order to generate an in vivo hemangioma mouse model, and to determine whether IH stem cells have the ability to generate tumors in immunodeficient mice, dissociated IH tumor sphere cells were resuspended in Matrigel and injected subcutaneously into 6-week-old NOD/SCID mice (106 cells/200 μl Matrigel/animal). Tumors were produced and as shown in Figure 5, all the tumors were GLUT1 positive indicating an IH cell of origin. Tumors exhibiting a proliferative cell phase were positive for CD31, an endothelial cell marker. These results demonstrated that IH stem cells can form hemangiomas in vivo. Tumors visible on day 10 exhibited mostly proliferative endothelial cells after H & E staining. Twenty days after injection, both blood vessels and fatty tissue became visible in H & E sections although proliferating cells were still present. By day 30, most of the cells injected into the animal had differentiated, and tumor involution occurred, with a high percentage of fatty tissue present (See Figure 5). This 30 day cycle of in vivo tumorigenis in mice represents the 5-9 year process seen in human cases of IH. The apparent faithful replication of hemangioma growth in this IH stem cell-induced in vivo hemangioma mouse model suggests that this system can be used as a tool to discover novel therapeutics specifically targeting IHs."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "Infantile hemangiomas are the most common tumors of childhood and the head and neck region is most commonly affected. They may grow rapidly and cause destruction of normal anatomic structures, leading to severe disfigurement. Some of these tumors respond to medical therapy with beta-blockers. However, when this therapy fails, surgical excision may be necessary. Noninvasive therapies to debulk or eliminate these tumors would be an important advance. The development of an in vitro cell culture system and an animal model should permit new insights into the biological processes involved in the development and pathogenesis of IH.",
                "The natural history of rapid proliferation during early infancy and subsequent involution strongly suggests that normal growth factors are regulating the growth and expansion of these tumors. In contrast to many other tumors which do not regress, IH is not naturally capable of sustained tissue renewal or growth. There has been speculation that the placenta may be the source of cells that form the IH because of the similarities between the expression of specific proteins such as GLUT1, and RNA array expression profiles from IH and the placenta. While the present studies cannot support or refute the placental origin of IH stem cells, they show that stem cell markers such as SALL4 and CD133 can be identified in IH. The tumors from younger patients with more proliferative IH contain more cells immunochemically staining for these early stem cell markers than tumors excised from older children which have more adipose and fibrous connective tissue characteristic of the involuting IH. Based on this study, the involution process is accompanied by, and related to a decrease in the number of IH stem cells.",
                "IH stem cells have been isolated from IHs surgically removed from patients and grown to purity as tumor spheres in selective media. When grown in stem cell media the fibroblasts that initially grow out of the minced tissue are depleted and the resulting cell population consists only of IH tumor stem cells, which form tumor spheres. Complex protocols for the purification of tumor stem cells have been described utilizing methods such as FACs sorting and immunomagnetic purification strategies [12]. In contrast, the preparation of purified stem cell from IH tumors described here by growth in selective media is quite simple.",
                "The cells from the IH tumor spheres have been shown to express stem cell markers and GLUT1-positive staining (Figure 2). The tumor spheres can be dissociated into single cells and can undergo many generations of growth in vitro. The dissociated cells can be reseeded to form new tumor spheres. This extensive multi-generational growth after multiple rounds of subculturing supports the concept that the IH stem cells are not preprogrammed to age and die within the in vitro culture system.",
                "IH tumor sphere cells also express VEGF. VEGF is commonly expressed by tumor cells, presumably due to hypoxia, and aids in creating an optimal environment for growing tumors by increasing angiogenesis. Anti-VEGF therapies, including monoclonal antibodies such as bevacizumab (Avastin), antibody derivatives such as ranibizumab (Lucentis), or orally-available small molecules that inhibit the tyrosine kinases stimulated by VEGF: sunitinib (Sutent), sorafenib (Nexavar), axitinib, and pazopanib, have become well accepted chemotherapeutic agents. The sensitivity of IH tumor sphere cells to rapamycin implies that anti-VEGF therapy should be tested in the animal model described here, with potential eventual application for therapy.",
                "When the tumor spheres are replated in medium containing serum, the spheres show an outgrowth of cells that are endothelial cells and their precursors (Figure 2), suggestive of the angiogenic differentiation seen in IH tumors. Cells derived from tumor spheres have been placed subcutaneously in immune-suppressed mice where they form tumors that recapitulate the histological pattern of IH removed from patients. The tumors removed from the inoculated mice stained with GLUT1 and CD31 confirming that they are of human origin and are similar to human IHs (Figure 5).",
                "These IH xenografts were removed from the mice and studied at 10, 20 and 30 days post inoculation. Histological studies showed that at 10 days there was a tumor formed that was composed of proliferating endothelial cells and blood vessels consistent with a proliferative IH, at 20 days there was less proliferation and some fat and fibrous connective tissue consistent with the beginning of involution, at 30 days most of the vascular tissue was gone and there was a predominance of adipose and connective tissue (Figure 5). This temporal sequence mimics the natural course IH undergoes in humans.",
                "The development of a mouse xenograft of IH and the establishment of an in vitro tissue culture system for propagating IH stem cell will be critical for assessing both host effects and the efficacy of drug therapies. The stem cell of the IH can now be studied for genetic aberrations as well as epigenetic modifications caused by the loss or gain of host growth factors or exogenous agents."
            ],
            "subsections": []
        },
        {
            "title": "Competing Interests",
            "paragraphs": [
                "The authors declare that they have no competing interests."
            ],
            "subsections": []
        },
        {
            "title": "Authors' Contributions",
            "paragraphs": [
                "All authors are accountable for the integrity of the research results. TMO, MW and YM are responsible for the conception of the research and DX, TMO, AS, TCF and JY are responsible for the execution and for data collection; JY, LMF, DCW, MM, MW and YM wrote the paper with contributions from the other authors. All authors read and approved the final manuscript."
            ],
            "subsections": []
        }
    ]
}