{
    "id": "US20200254066",
    "authors": [
        "Gregory M. Fahy",
        "Robert T. Brooke"
    ],
    "title": "PHARMACEUTICALS AND DOSING MEANS FOR HUMAN AGING REVERSAL",
    "date": "2018-08-07 00:00:00",
    "abstract": "A combination of medications and medication doses is disclosed whereby age-related changes in systemic inflammation, cancer risk, heart disease risk, CD38 expression, hair color, thymotrophic hormones, immune cell populations, the CD4/CD8 cell ratio, bone marrow density, thymus structure, kidney function, and epigenetic age can be reversed in humans. Surprisingly, agents that accelerate the growth of cells reduce cancer risk, agents that intensify immune responses attenuate age-related inflammation, agents with no prior connection to hair color reverse age-related hair whitening, and a combination of agents that induces IGF-1, a hormone previously thought to drive systemic aging, results in a reversal of systemic aging as documented by an epigenetic clock. Medication combinations useful in the present invention include human growth hormone (GH) or GH releasers, dehydroepiandrosterone (DHEA), and metformin.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [
                "This patent application claims priority to U.S. Provisional Application Ser. No. 62/543,269, filed on Aug. 9, 2017, and is also related to U.S. patent application Ser. No. 14/997,397 (“Novel Applications of Growth Hormone Therapy and Related Pharmaceutical Compositions”). It is additionally related to U.S. Pat. No. 6,297,212 B1 (“Growth Hormone Therapy and Related Methods and Pharmaceutical Compositions”) and U.S. Pat. No. 7,166,569 B2 (“Method for the Prevention of Transplant Rejection”). All of the foregoing applications and patents are herein expressly incorporated by reference, in their entirety."
            ],
            "subsections": [
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "The present invention was initially motivated by the desirability of discovering medications and medication doses and methods capable of advantageously regenerating the human thymus (i.e., pharmacologically addressing the medical condition known as thymic involution) so as to prevent age-related immune dysfunction (immunosenescence) or restore immune function (reverse immunosenescence) in the elderly. We sought to correct the deficiencies of the few [12, 33, 34] prior art medications and medication doses and methods for human thymus regeneration, which have failed to adequately address the issue of insulin control, safety, and efficacy in otherwise healthy aging adults. Prior to the present invention, the following concerns and unanswered questions confronted the use of prior art medications and medication doses and methods intended to treat the medical condition known as thymic involution (i.e., to induce clinical thymus regeneration).",
                        "The Problem with Growth Hormone: Aging, Diabetes, and Cancer",
                        "Growth hormone (GH) has been the basis of attempted human thymus regeneration to date [12, 33, 34] based in part on positive short-term results in animals [25]. However, there is no approved or generally recognized benefit of GH other than to treat certain childhood diseases and failure to grow, or bona fide GH deficiencies in adults, which are quite rare. In addition, the scientific consensus is that aging itself is driven by the IGF-1 produced in response to GH secretion given the universality of the involvement of similar signaling processes in the aging of most animal species [28, 29, 43], the fact that mutant mice deficient in GH/IGF1 signaling live longer than wild-type mice [7, 19, 29, 41, 43] and that there is an inverse correlation between IGF-1 levels and lifespans between mouse strains [48].",
                        "One pro-aging effect of HGH administration is the “diabetogenic” effect of GH, wherein HGH increases insulin resistance and consequently increases blood insulin levels [30, 38]. Elevated insulin levels may lead to an increased risk of atherosclerosis, other cardiovascular diseases, and accelerated aging in general [31]. An instructive hallmark of calorie restriction, which is one of the most powerful anti-aging interventions now known, is simultaneous reduction in both glucose and insulin levels secondary to powerfully increased insulin sensitivity [4, 45]. Normal aging and GH administration both result in the opposite effect, i.e., elevated insulin and unchanged or elevated glucose levels, owing to increased insulin resistance. This phenomenon is often called metabolic syndrome or type II diabetes, and is responsible for many age-related diseases. It is undesirable to foster this condition in an attempt to slow aging, but this serious side effect of HGH administration has been almost universally ignored. Although Fahy, uniquely, proposed HGH administration in combination with dehydroepiandrosterone (DHEA) to block the diabetogenic effect of HGH [11, 12], his method was only shown to be effective in a single relatively young individual [12, 13], and its validity and sufficiency for the general population therefore remains unknown. Recently, 50 mg of DHEA per day was found to improve glucose tolerance in 65-75 year old men [46], but this was in the absence of GH administration, leaving the effectiveness of DHEA in combination with GH as well as optimal methods of DHEA use with GH unresolved. Past use of GH for thymus regeneration in HIV patients (who may be unrepresentative of the general healthy aging population [32]) ignored the issue of hyperinsulinemia [33, 34], and it is unknown whether correcting hyperinsulinemia might prevent any benefit of thymus regeneration.",
                        "GH administration to adult humans [1, 3, 18, 42] and to adult rodents [10, 23, 26] has not been shown to increase the risk of developing cancer despite often elevating IGF-1 levels to far above the normal range. However, paradoxically, the highest levels of IGF-1 in men not treated with HGH have been associated with about a 50% increase in prostate cancer risk [36], and in women, IGF-1 stimulates processes that worsen breast cancer outcomes [9]. Therefore, there has been an unresolved concern that use of growth hormone for thymus regeneration may lead to significant elevations in cancer risk. Moreover, DHEA is a precursor to testosterone, and androgens are a risk factor for prostate cancer development and progression [39]. Therefore, the combination of DHEA and HGH is particularly concerning from the standpoint of potential exacerbation of prostate cancer, and it might be argued that the decline of DHEA with age [40, 44], like the decline of GH secretion and IGF-1 levels with age, has arisen as a hedge against cancer. Furthermore, sex hormones, including androgens, have been shown to drive thymus involution [16, 17], making the use of DHEA in a treatment for thymus regeneration potentially counterproductive.",
                        "Thymus Regeneration Vs “Inflammaging”",
                        "In addition to increased insulin resistance, another major hallmark of aging is “inflammaging” [14], which is a state of chronic and generalized inflammation that arises in the course of normal aging and has been speculated to contribute to age-related increases in cancer risk. It is logical to assume that if thymus regeneration were to increase the intensity of immune responses in the elderly, this would exacerbate inflammaging, and in fact, one famed gerontologist and immunologist to whom thymus regeneration was suggested by one of the present inventors (G. M.F.) did strongly express just this concern. A priori, there is no way to rebut this concern or determine the magnitude of this presumed problem, and the prior art is completely silent on this question; although HGH has been widely used, its potential exacerbation of inflammaging has not been defined. To underscore the seriousness of this potential drawback, it was recently reported that a new immune system stimulating drug, TGN-1412, induced a severe inflammatory reaction known as a “cytokine storm” in a Phase 1 trial, and therefore had to have its development halted [6]. Furthermore, the thymus involutes early in life in all vertebrates, including humans, leading some researchers to question if this change is adaptive, perhaps, for example, to blunt inflammation later in life. If so, thymus regeneration could be counterproductive.",
                        "In order to address these unknowns, a first of its kind one-year clinical trial was carried out on 9 healthy men aged 50-65. The results have been illuminating, not only with respect to the above-described questions, but also as to the existence of previously unknown deficiencies of prior art methods as well as the effectiveness of a new pharmaceutical dosage form that provides an unprecedented set of new health benefits and valuable new drug indications. These indications go beyond the immediate goals of thymus regeneration and T cell improvement. The same essential pharmacological approach should be effective as well in women."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate thymus regeneration",
                        "limitations of prior art medications",
                        "problem with growth hormone",
                        "diabetogenic effect of GH",
                        "metabolic syndrome and type II diabetes",
                        "Fahy's method",
                        "DHEA and glucose tolerance",
                        "GH administration and cancer risk",
                        "IGF-1 and cancer risk",
                        "DHEA and prostate cancer",
                        "thymus regeneration vs \"inflammaging\"",
                        "concern about exacerbating inflammaging",
                        "cytokine storm",
                        "clinical trial results"
                    ],
                    "num_characters": 7047,
                    "outline_medium": [
                        "motivate thymus regeneration",
                        "limitations of prior art medications",
                        "problems with growth hormone",
                        "diabetogenic effect of GH",
                        "cancer risk and GH administration",
                        "thymus regeneration vs \"inflammaging\"",
                        "unknowns and clinical trial"
                    ],
                    "outline_short": [
                        "motivate thymus regeneration",
                        "limitations of prior art medications",
                        "concerns of growth hormone therapy"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The invention is a drug combination and mode of drug administration that has novel therapeutic effects that are consistent with a generalized reversal of human aging. The invention is also the first demonstrated method for reversing multiple aspects of aging, and even aging in general, in humans. More specifically, the invention consists of a combination of human growth hormone (GH) and/or GH releasers, dehydroepiandrosterone (DHEA), and metformin and means of delivering this combination of medications that results in the reversal of normal age-related changes in kidney function, systemic inflammation, cancer risk, heart disease risk, CD38 expression, hair color, thymotrophic hormones, the CD4/CD8 cell ratio, immune cell populations, bone marrow density, thymus structure, and epigenetic age. Still more specifically, the above drug combination is to be given so as to optimize the CD4/CD8 cell ratio, which, using prior art methods, cannot be correctly optimized. Still more specifically, the above drug combination is to be given so as to minimize GH-induced or GH releaser-induced hyperinsulinemia and unpleasant side effects.",
                        "The invention also comprises the use of a combination of human growth hormone (GH) and/or GH releasers with dehydroepiandrosterone (DHEA) and metformin to manufacture a pharmaceutical dosage form to treat or to prevent broad aspects of human aging, including any one of, any combination of, or all of age-related changes in systemic inflammation as indicated by hsCRP or other accepted markers, cancer risk as indicated by PSA levels or the percent of free PSA or the ratio of PSA to percent of free PSA or its reciprocal and/or by the lymphocyte to monocyte cell ratio, heart disease risk as indicated by the lymphocyte to monocyte cell ratio, CD38-positive blood cell counts or percentages, hair color, IL-7 levels, IL-21 levels, the CD4/CD8 cell ratio, naïve CD4 and/or CD8 cell numbers or percentages, total CD4 and/or CD8 T cell numbers or percentages, bone marrow density, thymic fat-free fraction, glomerular filtration, and epigenetic age, as well as to reduce or prevent GH-induced hyperinsulinemia. The pharmaceutical dosage form or composition may consist of three separate agents or agent classes (the GH and/or GH releaser; DHEA; and metformin) administered simultaneously or within 2 hours of one another, or it may consist of GH and/or a GH releaser used simultaneously with or within two hours of a unified companion product composition containing DHEA in combination with metformin.",
                        "More particularly, in one aspect of the invention there is disclosed the use of a combination of human growth hormone (GH) and/or a GH releaser, dehydroepiandrosterone (DHEA), and metformin to manufacture a pharmaceutical dosage form to treat, prevent, or reverse broad aspects of human aging, including any one of, any combination of, or all of age-related changes in systemic inflammation as indicated by hsCRP or other accepted markers, cancer risk as indicated by PSA levels or the percent of free PSA or the ratio of PSA to percent of free PSA or its reciprocal and/or by the lymphocyte to monocyte cell ratio, heart disease risk as indicated by the lymphocyte to monocyte cell ratio, CD38-positive blood cell counts or percentages, hair color, IL-7 levels, IL-21 levels, the CD4/CD8 cell ratio, naïve CD4 and/or CD8 cell numbers or percentages, total CD4 and/or CD8 T cell numbers or percentages, bone marrow density, thymic fat-free fraction, glomerular filtration, and epigenetic age, as well as to reduce or prevent GH-induced or GH releaser-induced hyperinsulinemia. This combination may comprise any of a) three separate agents or agent classes (the GH and/or GH releaser; DHEA; and metformin), which are to be administered simultaneously or within 2 hours of one another; and b) GH and/or a GH releaser used simultaneously with or within two hours of a unified companion product composition containing DHEA in combination with metformin.",
                        "In another aspect of the invention, there is disclosed a composition for use in the treatment of human aging, comprising a combination of GH and/or a GH releaser, dehydroepiandrosterone, and metformin whose administration results in mitigation of age-related changes in any one of, any combination of, or all of the following: systemic inflammation as indicated by hsCRP or other accepted markers, cancer risk as indicated by PSA levels or the percent of free PSA or the ratio of PSA to percent of free PSA or its reciprocal and/or by the lymphocyte to monocyte cell ratio, heart disease risk as indicated by the lymphocyte to monocyte cell ratio, CD38-positive blood cell counts or percentages, hair color, IL-7 levels, IL-21 levels, the CD4/CD8 cell ratio, naïve CD4 and/or CD8 cell numbers or percentages, total CD4 and/or CD8 T cell numbers or percentages, bone marrow density, thymic fat-free fraction, glomerular filtration, and epigenetic age, as well as to reduce or prevent GH-induced or GH releaser-induced hyperinsulinemia. This composition may comprise any of a) three separate agents or agent classes (the GH and/or GH releaser; DHEA; and metformin), which are to be administered simultaneously or within 2 hours of one another, or b) GH and/or a GH releaser used simultaneously with or within two hours of a unified companion product composition containing DHEA in combination with metformin.",
                        "In still another aspect of the invention, there is disclosed a method for the mitigation or reversal of human aging, comprising administering a combination of GH and/or a GH releaser, dehydroepiandrosterone, and metformin so as to result in mitigation or reversal of age-related changes in any one of, any combination of, or all of the following: systemic inflammation as indicated by hsCRP or other accepted markers, cancer risk as indicated by PSA levels or the percent of free PSA or the ratio of PSA to percent of free PSA or its reciprocal and/or by the lymphocyte to monocyte cell ratio, heart disease risk as indicated by the lymphocyte to monocyte cell ratio, CD38-positive blood cell counts or percentages, hair color, IL-7 levels, IL-21 levels, the CD4/CD8 cell ratio, naïve CD4 and/or CD8 cell numbers or percentages, total CD4 and/or CD8 T cell numbers or percentages, bone marrow density, thymic fat-free fraction, glomerular filtration, and epigenetic age, as well as to reduce or prevent GH-induced of GH releaser-induced hyperinsulinemia. This method may further comprise any of:",
                        "a) administering three separate agents or agent classes (the GH and/or GH releaser; DHEA; and metformin) simultaneously or within 2 hours of one another, or b) administering GH and/or a GH releaser simultaneously with or within two hours of the oral administration of a unified companion product composition containing DHEA in combination with metformin.",
                        "In still another aspect of the invention, there is disclosed a composition for use in the treatment of human aging, comprising an agent that increases IGF-1 levels and one or more insulin-lowering agents whose administration results in mitigation of age-related changes in any one of, any combination of, or all of the following: immune system function as indicated by the lymphocyte to monocyte ratio, CD38-positive blood cell counts or percentages, total CD4 and/or CD8 T cell numbers or percentages, IL-7 levels, IL-21 levels, the CD4/CD8 cell ratio, naïve CD4 and/or CD8 cell numbers or percentages, bone marrow density, thymic density or fat-free fraction, or other accepted markers of immune system function, inflammation as indicated by hsCRP or other accepted markers, cancer risk as indicated by PSA levels, the percent of free PSA, the ratio of PSA to percent of free PSA, its reciprocal, and/or by the lymphocyte to monocyte cell ratio or other accepted markers of cancer risk, heart disease risk as indicated by the lymphocyte to monocyte cell ratio, CD38-positive blood cell counts or percentages or other accepted markers of heart disease risk, hair color, glomerular filtration or other accepted markers of kidney function, epigenetic age, or other critical endpoints of aging, as well as to reduce or prevent GH-induced or GH releaser-induced hyperinsulinemia.",
                        "Yet another aspect of the invention involves a composition for use in the treatment of human aging, comprising a combination of one or more anabolic agents with one or more insulin-lowering agents whose administration results in mitigation of age-related changes in any one of, any combination of, or all of the following: immune system function as indicated by the lymphocyte to monocyte ratio, CD38-positive blood cell counts or percentages, total CD4 and/or CD8 T cell numbers or percentages, IL-7 levels, IL-21 levels, the CD4/CD8 cell ratio, naïve CD4 and/or CD8 cell numbers or percentages, bone marrow density, thymic density or fat-free fraction, or other accepted markers of immune system function, inflammation as indicated by hsCRP or other accepted markers, cancer risk as indicated by PSA levels, the percent of free PSA, the ratio of PSA to percent of free PSA, its reciprocal, and/or by the lymphocyte to monocyte cell ratio or other accepted markers of cancer risk, heart disease risk as indicated by the lymphocyte to monocyte cell ratio, CD38-positive blood cell counts or percentages or other accepted markers of heart disease risk, hair color, glomerular filtration or other accepted markers of kidney function, epigenetic age, or other critical endpoints of aging as well as to reduce or prevent GH-induced or GH releaser-induced hyperinsulinemia."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce drug combination and mode of administration",
                        "reverse human aging",
                        "combination of GH, DHEA, and metformin",
                        "optimize CD4/CD8 cell ratio",
                        "minimize GH-induced hyperinsulinemia",
                        "treat or prevent age-related changes",
                        "pharmaceutical dosage form",
                        "GH and/or GH releaser with DHEA and metformin",
                        "treat or prevent systemic inflammation",
                        "treat or prevent cancer risk",
                        "treat or prevent heart disease risk",
                        "treat or prevent CD38-positive blood cell counts",
                        "treat or prevent hair color changes",
                        "treat or prevent IL-7 and IL-21 level changes",
                        "treat or prevent CD4/CD8 cell ratio changes",
                        "treat or prevent bone marrow density changes",
                        "treat or prevent thymic fat-free fraction changes",
                        "treat or prevent glomerular filtration changes",
                        "treat or prevent epigenetic age changes"
                    ],
                    "num_characters": 9600,
                    "outline_medium": [
                        "introduce drug combination and mode of administration",
                        "reversal of human aging",
                        "specific aspects of aging reversed",
                        "CD4/CD8 cell ratio optimization",
                        "minimize GH-induced hyperinsulinemia",
                        "pharmaceutical dosage form",
                        "treat or prevent broad aspects of human aging",
                        "composition for use in treatment of human aging",
                        "method for mitigation or reversal of human aging"
                    ],
                    "outline_short": [
                        "introduce novel therapeutic effects",
                        "describe drug combination and mode of administration",
                        "outline benefits of the invention",
                        "summarize composition and method of treatment"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "The invention consists of the use of a combination of human growth hormone (GH) and/or a GH releaser, dehydroepiandrosterone (DHEA), and metformin to manufacture a pharmaceutical dosage form to treat, prevent, or reverse broad aspects of human aging, including any one of, any combination of, or all of age-related changes in systemic inflammation as indicated by CRP or other accepted markers, cancer risk as indicated by PSA levels or the percent of free PSA or the ratio of PSA to percent of free PSA or its reciprocal and/or by the lymphocyte to monocyte cell ratio, heart disease risk as indicated by the lymphocyte to monocyte cell ratio, CD38-positive blood cell counts or percentages, hair color, IL-7 levels, IL-21 levels, the CD4/CD8 cell ratio, naïve CD4 and/or CD8 cell numbers or percentages, total CD4 and/or CD8 T cell numbers or percentages, bone marrow density, thymic fat-free fraction, glomerular filtration, and epigenetic age, as well as to reduce or prevent GH-induced or GH releaser-induced hyperinsulinemia. The pharmaceutical dosage form or composition may consist of three separate agents or agent classes (the GH and/or GH releaser; DHEA; and metformin) administered simultaneously or within 2 hours of one another, or it may consist of GH and/or a GH releaser used simultaneously with or within two hours of a unified companion product composition containing DHEA in combination with metformin.",
                        "The invention is also a composition for use in the treatment of human aging, comprising a combination of GH and/or a GH releaser, dehydroepiandrosterone, and metformin whose administration results in mitigation of age-related changes in any one of, any combination of, or all of the following: systemic inflammation as indicated by CRP or other accepted markers, cancer risk as indicated by PSA levels or the percent of free PSA or the ratio of PSA to percent of free PSA or its reciprocal and/or by the lymphocyte to monocyte cell ratio, heart disease risk as indicated by the lymphocyte to monocyte cell ratio, CD38-positive blood cell counts or percentages, hair color, IL-7 levels, IL-21 levels, the CD4/CD8 cell ratio, naïve CD4 and/or CD8 cell numbers or percentages, total CD4 and/or CD8 T cell numbers or percentages, bone marrow density, thymic fat-free fraction, glomerular filtration, and epigenetic age, as well as to reduce or prevent GH-induced or GH releaser-induced hyperinsulinemia. The composition may consist of three separate agents or agent classes (the GH and/or GH releaser; DHEA; and metformin) administered simultaneously or within 2 hours of one another, or it may consist of GH and/or a GH releaser used simultaneously with or within two hours of a unified companion product composition containing DHEA in combination with metformin.",
                        "The invention is also a method for the mitigation or reversal of human aging, comprising administering a combination of GH and/or a GH releaser, dehydroepiandrosterone, and metformin so as to result in mitigation or reversal of age-related changes in any one of, any combination of, or all of the following: systemic inflammation as indicated by CRP or other accepted markers, cancer risk as indicated by PSA levels or the percent of free PSA or the ratio of PSA to percent of free PSA or its reciprocal and/or by the lymphocyte to monocyte cell ratio, heart disease risk as indicated by the lymphocyte to monocyte cell ratio, CD38-positive blood cell counts or percentages, hair color, IL-7 levels, IL-21 levels, the CD4/CD8 cell ratio, naïve CD4 and/or CD8 cell numbers or percentages, total CD4 and/or CD8 T cell numbers or percentages, bone marrow density, thymic fat-free fraction, glomerular filtration, and epigenetic age, as well as to reduce or prevent GH-induced of GH releaser-induced hyperinsulinemia. The method may consist of administering three separate agents or agent classes (the GH and/or GH releaser; DHEA; and metformin) simultaneously or within 2 hours of one another, or it may consist of administering GH and/or a GH releaser simultaneously with or within two hours of the oral administration of a unified companion product composition containing DHEA in combination with metformin.",
                        "Suitable Medication Compositions",
                        "The utility of GH for the invention as reduced to practice is proven beyond doubt by the Examples described below. The purpose of administering GH is to increase circulating levels of both GH and IGF-1, which then modulate appropriate biological targets to produce the intended therapeutic effects. However, GH is costly, and alternative means are available for elevating circulating GH and IGF-1 so as to modulate the same biological targets as are modulated by GH and IGF1 and thereby to achieve the same biological effect as is achieved by GH injection. Therefore, any method, composition, or use of agents to manufacture a pharmaceutical dosage form that raises blood concentrations of GH and IGF-1 so as to produce the same therapeutic effect as GH injection within the practice of the present invention is an acceptable equivalent method, composition, or use to GH injection, GH, or GH use, respectively, for the purposes of the present invention.",
                        "Within the purposes of the present invention, “a GH releaser” or “GH releaser” is understood to mean either a single molecular entity (including complexes such as salts) or a combination of molecular entities whose administration results in an increase in circulating blood levels of GH and IGF-1 such that the resulting blood concentrations of GH and IGF-1 fall within the range of the concentrations that are reached (in individuals capable of increasing IGF-1 levels in response to GH injection) after GH is injected for the purposes of the present invention. However, it is not necessary to measure blood concentrations of GH for the purpose of determining the effectiveness of a GH releaser, because suitable increases in blood GH levels can be inferred from suitable increases in blood IGF-1 levels, and blood IGF-1 levels are conveniently measured, whereas GH levels are often awkward and costly to measure. The prior art has verified the release of GH by GH releasers, and there is no need to duplicate that verification in individuals. As long as the IGF-1 response to GH releaser administration is measured and is found to be satisfactory, use of the GH releaser is appropriate. For those individuals for whom the administration of a GH releaser does not result in an adequate increase in IGF-1, the use of GH is preferred over the use of a GH releaser for the purposes of the present invention. For purposes of evaluating the suitability of a GH releaser for use in this invention, a fold change in IGF-1 level of at least 1.2 fold, or a final IGF-1 concentration of at least 170 ng/ml, are indicative of at least the potential for an adequate response.",
                        "GH releasers are well known to those of skill in the art. Examples include but are not limited to: sermorelin, ipamorelin, ghrelin, GHRH, and MK-0677.",
                        "In each case, the dose of GH releaser to be administered is equal to the dose required to optimize the CD4/CD8 cell ratio, which will be specific to each individual, using the dosing method described below.",
                        "In the prior art, GH releasers have been used as alternatives to the use of GH. However, a useful variation of part of our pharmaceutical composition is a combination of GH and a GH releaser. GH is ideally administered at bedtime, so as to simulate the normal diurnal elevation of IGF-1 that occurs during sleep, when the largest release of GH normally takes place. However, injection of recombinant GH (the preferred form of GH to be used in the present invention) may blunt the natural release of GH by the pituitary, thus both disturbing normal GH physiology and resulting in a need for a higher dose of GH than would be the case if natural GH release occurred. This problem can be overcome by combining GH and a GH releaser into a unified product composition using methods known in the art, or co-administering both GH and GH releaser as a virtual unified product, which can be marketed as one product. This approach and composition will be valuable when GH injection is generally preferred over the use of a GH releaser, but it is desired to reduce the cost of GH injection, and when the use of a GH releaser alone is able to raise IGF-1 levels but is insufficient to optimize the CD4/CD8 cell ratio. The approach will also be appealing to those who wish to combine the benefits of GH with the theoretical safety advantages of GH releasers.",
                        "In combinations of GH and GH releaser, the dose of GH will generally be reduced by 10-50% compared to non-use of a GH releaser, and the dose of GH releaser will generally be in the range of 30-100% the dose that would be administered without GH. Typically, GH and GH releaser preparations consist of a standardized amount of freeze-dried powder that is reconstituted to a liquid state prior to injection. A convenient unified dosage form can contain 50% as much GH per vial of powder as is normally present and 75% as much GH releaser as is normally present, with total delivered dose per injection being determined by the volume injected as required on an individualized basis.",
                        "The inclusion of both DHEA and metformin within the invention was discovered to be mandatory for optimum control of GH-induced hyperinsulinemia. Even though each agent was beneficial for suppressing hyperinsulinemia, neither agent alone was sufficient, and even in combination, it was necessary to employ the maximum permissible doses of each within the limits set by the trial design. Sulfonylureas and meglitinides, which increase insulin secretion, are inappropriate treatments for hyperinsulinemia.",
                        "DHEA and metformin can easily be combined into a single dosage form or composition because both are solids and will be chemically stable when combined. A unified composition of DHEA and metformin is advantageous for simplifying treatment, improving patient compliance, ensuring correct dosage administration, and adapting both DHEA and metformin pharmacokinetics to the purposes of the present invention. In particular, a significant deficiency of metformin and of lower doses of DHEA for the suppression of GH-induced hyperinsulinemia is the fact that the half-lives of these agents in the bloodstream are shorter than the expected duration of hyperinsulinemia. By incorporating DHEA and metformin into a timed-release formulation, which is easily done using technologies known to those of skill in the art, the antihyperinsulinemic effect of this combination of agents can be tailored to match the duration of the hyperinsulinemic effect of GH or a GH releaser. In general, release over 9-15 hours is desirable to either completely suppress hyperinsulinemia or enable hyperinsulinemia to be controlled during sleep so that a second dose of DHEA plus metformin can be administered in the morning to continue insulin suppression.",
                        "As described below, useful initial doses of DHEA and metformin are 75 mg and 850 mg, respectively, which may be combined into one dosage form containing these quantities. Ingesting two such tablets will deliver 150 mg of DHEA and 1700 mg of metformin, which are both useful doses during high to intermediate dosing with GH/GH releaser. At the highest doses of GH/GH releaser, three tablets comprising 225 mg of DHEA and 2550 mg of metformin can be ingested, either simultaneously or in divided doses taken within 2-4 hours of GH administration, including one tablet with dinner and two tablets at bedtime along with GH/GH releaser. This dosage form will be advantageous with or without timed release formulations; 225 mg of DHEA is projected to sustain elevated DHEA levels for over 9 hours, whereas the half-life of metformin is shorter and may justify selective time release of this agent. Of course, other variations are practicable within the invention, including a tablet containing only 33 or 50 mg of DHEA and 850 mg of metformin for men with initial PSA levels between 3 and 4 at the onset of the trial (these men can begin with 50 mg/850 mg and switch to two or three 33 mg/850 mg tablets as insulin suppression needs increase, so as to limit ultimate DHEA intake to 99 mg/dose), and a women's tablet that contains only 17 or 33 mg of DHEA and 850 mg of metformin, to limit the highest intake to 51 or 99 mg, respectively, when three tablets are consumed. Women can and should initiate treatment with the men's 50 mg DHEA plus 850 mg metformin tablet, and then switch to one of the other women's tablets when the number of tablets needed to suppress insulin levels increases to two or three.",
                        "The above formulations are designed particularly to combat nocturnal hyperinsulinemia and enable the user to awake with a normal insulin level despite taking antihyperinsulinemic therapy only once, prior to sleeping. However, they will be useful as well for daytime GH therapy, combining greater convenience with better insulin control overall. In fact, these companion formulations can be used by individuals who are taking metformin for type 2 diabetes, who may benefit from the inclusion of DHEA and timed release of metformin, without thymus regeneration or aging reversal therapy.",
                        "The inventors believe that the combination of GH or a GH releaser with DHEA and metformin creates an invention that is “more than the sum of its parts.” For reasons that are not completely clear, the combination of these specific agents has beneficial effects that are otherwise not available. For example, as noted above, GH alone is generally expected to accelerate epigenetic aging rather than to reverse it, metformin use was not shown to either slow or reverse epigenetic aging in women [35], and there is no evidence that DHEA alone can reverse epigenetic aging, but the combination of agents comprising the present invention quite clearly does have this profound and unprecedented effect. As another example, one individual has reported that DHEA caused immediate and significant prostatic hypertrophy when used either alone or in combination with metformin, but when it was used in combination with both metformin and GH, prostatic hypertrophy was, surprisingly, actually reversed (made significantly less than prior to DHEA administration), and sexual function was also improved. Therefore, we do not believe that the totality of the effects of our invention would be obvious to one of ordinary skill in the art based on prior art knowledge. Accordingly, our results, methods, and medication compositions and combinations enable beneficial new treatments to improve human health and enable beneficial new drug indications.",
                        "Medication Doses and Medication Dose Administration",
                        "Best Mode GH/GH releaser Administration Method. The initial dose of GH for men is preferably in the range of 0.01-0.02 mg/kg, to enable pre-adaptation of the body to GH without side effects, preferably for 1-6 weeks. The initial dose of GH releaser is chosen to produce the same effect on IGF-1 levels as 0.01-0.02 mg/kg GH, as determined from prior art knowledge, and is also maintained for 1-6 weeks when a GH releaser is used in place of or in addition to GH. Postmenopausal women should be started on the same dose regimen whether or not they are taking estrogen replacement hormones (HRT). Women on HRT will experience lower increases in IGF-1, but lower increases in IGF-1 will enable more thorough evaluation of safety prior to increasing doses for thymus regeneration/aging reversal. Women should be carefully evaluated for breast cancer risk prior to enrolling in thymus regeneration/aging reversal treatment, including genetic testing for alleles that favor breast cancer development.",
                        "After the initial adaptation phase, the dose of GH, GH releaser, or GH plus GH releaser is increased so as to maximize the CD4 to CD8 cell ratio, as measured by commonly available blood testing services, over about the next 60 days in both men and women. Typically, a target CD4/CD8 ratio of 120±10% of baseline is considered satisfactory for 50-65 year-old men and women, regardless of the initial absolute CD4/CD8 ratio, and regardless of whether the ratio is increased by a decrease in CD8 cell counts or percentages or by an increase in CD4 cell counts or percentages (both ways of computing the CD4/CD8 cell ratio give similar results and are acceptable for purposes of the invention).",
                        "The preferred GH/GH releaser dosing frequency should be 4-7 times a week. Side effects should be controlled by reducing dosing frequency first and then, if that is insufficient, by dose reductions. A dosing frequency as low as 3 times a week can be effective for some patients.",
                        "We find that a maximum CD4/CD8 cell ratio is achieved in different individuals over a broad range of absolute IGF-1 concentrations and IGF-1 fold changes. The prior art method of increasing IGF-1 levels or inducing IGF-1 fold changes to either an arbitrary extent or as much as possible within upper physiological limits was found to be counterproductive, resulting in eventual decreases in the CD4/CD8 cell ratio. We also found wide variations in IGF-1 concentrations in response to a specific dose of GH, and essentially no correlation between CD4/CD8 cell ratio and IGF-1 concentration. Therefore, the optimum dosing strategy is to optimize CD4/CD8 cell ratio by either increasing or decreasing the GH/GH releaser dose as may be necessary as indicated by how the ratio changes with dose. This dose-response relationship may also change over time, so monitoring once every 1-3 months is recommended. Thus, medical supervision is necessary for achieving optimal results.",
                        "The strategy of dosing based on the CD4/CD8 ratio is unique, and is the first non-arbitrary method of GH/GH releaser administration. This method was inferred a posteriori based on the unprecedented observation that with the prior art method, the CD4/CD8 ratio tended to peak after different treatment times in different individuals, and then further decline, as described in detail below.",
                        "Because food and alcohol may inhibit natural HGH release from the pituitary, the effectiveness of GH in the present invention should be maximized by not drinking alcoholic or sugary beverages or consuming significant quantities of food within 2-4 hours of injecting GH.",
                        "Best Mode DHEA Administration Method. DHEA was not found to either raise testosterone levels (at doses up to 200 mg) or induce benign prostatic hypertrophy in the presence of GH or GH plus metformin in our trial. The best mode use is to administer DHEA within one or two hours, and ideally simultaneously, with the administration of GH. A useful initial oral dose of DHEA for most men, once GH treatment begins, is 75 mg. Men with PSA levels between 3 and 4 should restrict DHEA to 50 mg initially, and raise DHEA only if benign prostatic hypertrophy and/or PSA elevation is not encountered. Men with PSA levels above 4 should not undergo thymus regeneration/age reversal therapy unless PSA elevation is caused by established prostatitis or until additional information becomes available establishing the safety of treatment for such men. We believe that for most men, 300 mg of DHEA should be safe, but we recommend limiting DHEA intake to 225 mg until more safety information becomes available.",
                        "Women can safely take 50 mg of DHEA, and in the best mode, this is the preferred initial dose unless specific issues arise for particular women. Out of general caution, we recommend limiting the intake of DHEA to 100 mg for women. This can be achieved using the dosage forms described above, which ensure limitation of DHEA to 51 or 99 mg even when antihyperinsulinemic therapy is maximized.",
                        "Best Mode Metformin Administration Method.",
                        "A useful initial dose of metformin, which should be given upon initial administration of GH, is 850 mg. If necessary to prevent gastric distress, this dose can be divided into two doses taken as close together in time as gastric distress will permit. Most individuals do not have difficulty taking this or higher doses of metformin. Metformin, like DHEA, can be taken either as part of a virtual composition or as part of a unified product composition containing both DHEA and metformin, as detailed above.",
                        "As for GH/GH releaser administration, the intake of metformin and DHEA should gradually increase over about the first 60 days of therapy to adjust to the continuously changing degree of insulin resistance induced by the GH/GH releaser. Thereafter, an additional, slower increase or decrease may be required, as GH/GH releaser dose is fine-tuned and the body adjusts to all three medications. The metformin dose ranges for men and women are the same. However, if women experience a different hyperinsulinemic effect than men, or a different antihyperinsulinemic effect of DHEA and metformin, dose adjustments can easily be made as necessary.",
                        "The metformin dose ranges described here differ significantly from ranges recognized in the prior art. The maximum accepted single dose of metformin is 850-1200 mg, and doses above 850 mg may cause an upset stomach in some users. However, in our experience, and as newly disclosed herein, 850-1200 mg of metformin is very insufficient to control hyperinsulinemia induced by GH in, as measured the morning after a GH dose (typically, at 8-10 am), even when DHEA is co-administered. We were able to use higher doses with minimal to no difficulty by devising the following dosing methods.",
                        "First, 500 mg of metformin can be given with dinner, and another 1000 mg can be co-administered with HGH and DHEA, achieving a total dose of 1500 mg. This regimen was universally well tolerated. Second, taking 1500 or 2000 mg of metformin in one dose together with GH at bedtime was also well tolerated, perhaps because the onset of sleep relieves feelings of gastric discomfort. Third, taking 1500 mg at dinner and 1000 mg with DHEA and HGH at bedtime was also well tolerated, enabling us to attain a dose of 2500 mg. In these methods, “dinner” need not be taken literally, the essence of the concept being to essentially administer a large virtual dose by combining two smaller doses that are administered within an effective time span, which may be 1-5 hours in duration, but preferably 1-2 hours in duration, to reduce side effects such as gastric distress while still enabling increased control of hyperinsulinemia.",
                        "Essentially, we learned that we could compensate for the short half-life of metformin in the bloodstream (˜2-3 hours) by using quantities beyond normal dosing limits to prolong its effectiveness, and discovered that this was acceptable in all cases, perhaps in part because we administered GH at night to simulate the normal diurnal peak in GH that takes place shortly after the onset of sleep. However, the same goals can be achieved even more effectively by using the timed dose release preparation described herein, which will deliver metformin or metformin and DHEA over a longer time span, both reducing gastric distress and achieving longer-lasting protection from hyperinsulinemia. In addition, this preparation can also if desired be taken during the day without distress due to slower release of the metformin.",
                        "Short Term Thymus Regeneration and Aging Reversal is Sufficient",
                        "A unique feature of our treatment is that it need not and should not be implemented for the life of the patient in order to achieve life-long benefits. Once thymus regeneration has been established and new T cells have been produced and released into the circulation, they may persist for decades even though the thymus will re-involute following the termination of treatment. In addition, aging reversal, once shown to be long-lasting, might only need to be repeated once every few years, or less frequently. This feature of the present invention is advantageous for reasons of both safety and cost, and as further improvements of our invention are made, the duration of benefit may become longer still, and the duration of required treatment may become shorter. In the present best mode practice of the invention, we believe that the optimum treatment time is 0.5-1.5 years, and perhaps 0.75-1.25 years."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce pharmaceutical dosage form",
                        "describe composition for treating human aging",
                        "outline method for mitigating human aging",
                        "introduce GH and GH releaser",
                        "explain GH and IGF-1 modulation",
                        "describe GH releaser administration",
                        "define GH releaser",
                        "measure IGF-1 response to GH releaser",
                        "list examples of GH releasers",
                        "describe GH and GH releaser combination",
                        "explain GH injection and natural GH release",
                        "introduce unified product composition",
                        "describe GH and GH releaser dosing",
                        "introduce DHEA and metformin",
                        "explain GH-induced hyperinsulinemia",
                        "describe DHEA and metformin combination",
                        "outline timed-release formulation",
                        "describe initial doses of DHEA and metformin",
                        "outline dosage forms for men and women",
                        "describe benefits of unified composition",
                        "introduce medication doses and administration",
                        "describe GH/GH releaser administration method",
                        "outline initial dose and adaptation phase",
                        "describe dose increase and CD4/CD8 ratio",
                        "outline dosing frequency and side effects",
                        "describe maximum CD4/CD8 cell ratio",
                        "outline medical supervision",
                        "describe food and alcohol restrictions",
                        "introduce DHEA administration method",
                        "outline initial dose and restrictions",
                        "describe DHEA intake limitations",
                        "introduce metformin administration method",
                        "outline initial dose and divided doses",
                        "describe metformin dose ranges",
                        "outline metformin dosing methods",
                        "describe benefits of timed-release preparation",
                        "introduce short-term thymus regeneration",
                        "describe life-long benefits",
                        "outline treatment duration",
                        "describe benefits of short treatment duration",
                        "outline GH/GH releaser dose optimization",
                        "describe CD4/CD8 cell ratio monitoring",
                        "outline medical supervision",
                        "describe food and alcohol restrictions",
                        "outline DHEA and metformin intake",
                        "describe hyperinsulinemia control",
                        "outline treatment adjustments",
                        "describe benefits of the invention"
                    ],
                    "num_characters": 24232,
                    "outline_medium": [
                        "introduce pharmaceutical dosage form for treating human aging",
                        "describe composition of GH, DHEA, and metformin",
                        "outline method for mitigating or reversing human aging",
                        "discuss suitable medication compositions",
                        "define GH releaser and its effects",
                        "describe GH releaser administration method",
                        "discuss combination of GH and GH releaser",
                        "outline benefits of GH and GH releaser combination",
                        "describe DHEA and metformin inclusion in invention",
                        "discuss importance of DHEA and metformin for hyperinsulinemia control",
                        "outline unified dosage form of DHEA and metformin",
                        "describe timed-release formulation of DHEA and metformin",
                        "discuss benefits of timed-release formulation",
                        "outline initial doses of DHEA and metformin",
                        "describe variations of DHEA and metformin tablets",
                        "discuss benefits of combination therapy",
                        "outline GH/GH releaser administration method",
                        "describe initial dose and adaptation phase",
                        "discuss increasing dose to maximize CD4/CD8 cell ratio",
                        "outline dosing frequency and side effect control",
                        "describe importance of medical supervision",
                        "discuss DHEA administration method",
                        "outline metformin administration method",
                        "discuss short-term thymus regeneration and aging reversal"
                    ],
                    "outline_short": [
                        "introduce pharmaceutical composition for treating human aging",
                        "describe GH and GH releaser administration methods",
                        "explain use of DHEA and metformin to control GH-induced hyperinsulinemia",
                        "detail GH releaser administration and dosing",
                        "describe combination of GH and GH releaser for optimal CD4/CD8 cell ratio",
                        "outline DHEA and metformin dosage forms and administration methods",
                        "explain timed-release formulation for DHEA and metformin",
                        "describe GH/GH releaser dosing frequency and side effect management",
                        "detail CD4/CD8 cell ratio optimization and monitoring",
                        "explain food and alcohol restrictions for GH administration",
                        "outline best mode administration methods for DHEA and metformin",
                        "discuss short-term thymus regeneration and aging reversal treatment"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [
                        "Nine normal, putatively healthy 50-65 year-old male volunteers with normal age-related thymic involution were enrolled in and completed a clinical study performed under an IND from the US Food and Drug Administration and separate supervision from a California Institutional Review Board. All aspects of the study also complied with the oversight requirements and standards of multiple institutions at Stanford University. The TRIIM trial (standing for Thymus Regeneration, Immunorestoration, and Insulin Mitigation) treatment period was limited to 12 months. Exclusion criteria included GH use in the prior 10 years, carpal tunnel syndrome, malignancies or high risk of malignancy, BMI greater than 30, PSA above the age-adjusted range, symptomatic prostatic hypertrophy, unstable metabolic disorders, unstable cardiovascular disorders, elevated levels of inflammatory markers, alcoholism, allergy to study medications, cognitive impairment, abnormal metabolic or hormonal results, existing type 1 or type 2 diabetes, or other unstable medical conditions. Informed consent was obtained from all patients and was collected using IRB-approved informed consent documents and procedures. The study was conducted consistently with the Declaration of Helsinki, Protection of Human Volunteers (21 CFR 50), Institutional Review Boards (21 CFR 56), and Obligations of Clinical Investigators (21 CFR 312).",
                        "Data variability was minimized and controlled by using each volunteer as his own control, and by standardizing the time and day of blood sampling. Blood was generally collected between 7 AM and 10 AM to avoid the effects of circadian and other temporal influences. In addition, patients standardized their pre-testing evening meal, used consistent testing sites and methods, and were redundantly tested between pre-established time points in some cases. All volunteers were asked to take supplements of 3000 IU vitamin D3 and 50 mg of elemental zinc daily. Further, volunteers were instructed not to consume food or alcohol within 4 hours of medication administration.",
                        "The initial dose of GH was 0.015 mg/kg, injected subcutaneously into superficial abdominal fat using a provided “pen” injector designed for this purpose. GH doses were varied over the time course described above so as to maximize IGF1, and were not adjusted for any changes in body weight.",
                        "Insulin mitigation in the trial was staged to enable the effects first of DHEA and then of DHEA plus metformin to be evaluated. The course of dose adjustment of DHEA and metformin in the trial were as described above.",
                        "The following unexpected and remarkably beneficial new discoveries were made as a result of the TRIIM trial."
                    ],
                    "subsections": [
                        {
                            "title": "Example 1",
                            "paragraphs": [
                                "As shown in FIG. 1, as the trial progressed and GH doses increased, there was a sustained trend for high-sensitivity CRP (hsCRP), a marker of systemic inflammation, to decrease. By 9-12 months, the decrease was about 40±10%, which is substantial, and the decline in hsCRP at 9-12 months was statistically significant compared to baseline (p<0.001). Normally, hsCRP would be expected to rise or stay the same over a one-year period, but with the treatment and medications of the invention, this normal age-related trend was reversed, despite attempted reactivation of the aging immune system. This contradicts the prior art concern that immune stimulation must exacerbate inflammation, and indicates that it is possible to simultaneously increase immune competence (see below) and decrease inflammation."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe decrease in hsCRP"
                            ],
                            "num_characters": 802,
                            "outline_medium": [
                                "describe decrease in hsCRP levels"
                            ],
                            "outline_short": [
                                "show decrease in hsCRP"
                            ]
                        },
                        {
                            "title": "Example 2",
                            "paragraphs": [
                                "FIG. 2 provides evidence that the medications of the invention surprisingly and rapidly (within 1 month) reverse the normal age-related increase in prostate cancer risk based on reduced levels of prostate-specific antigen (PSA, which rises with risk), increased percentages of free (unbound) PSA (with declines with increasing risk), and the ratio of PSA to free PSA, which was devised as an overall index of risk. Throughout most of the trial, relative risk is reduced by about 30%, and at 12 months, the risk factor decrease of nearly 40% was significant at the p<0.001 level. The increase in PSA, decrease in percent free PSA, and spike in putative overall risk at 6 months was due to results for three men. Given the immediate return to normal values after this time point (in the worst case, PSA was re-checked one week after the aberrant result, and was found to have returned to baseline levels, and in no case did the PSA level rise to 4 or above), the spike was not due to prostate cancer, and is believed to have been due to sexual activity too close to the time of blood collection.",
                                "The results of FIG. 2 are remarkable because they show a reduction in prostate cancer risk by a treatment that induces greatly increased IGF-1 levels, which have been considered a risk factor for prostate cancer, coupled with the use of an androgenic steroid. This effect on cancer risk is entirely unpredictable over the prior art and remains unexplained. Furthermore, the trend is strong enough to be clearly visible even in a group of only 9 rather heterogeneous aging men. Not visible in this figure is the fact that this trend applied without regard to baseline prostate cancer risk, men with PSA levels between 3 and 4 at the onset of the trial benefitting by the same proportion as men with PSA levels of 2 and below."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe decrease in PSA",
                                "describe increase in free PSA",
                                "describe overall index of risk"
                            ],
                            "num_characters": 1819,
                            "outline_medium": [
                                "describe decrease in prostate cancer risk based on PSA levels"
                            ],
                            "outline_short": [
                                "show decrease in PSA"
                            ]
                        },
                        {
                            "title": "Example 3",
                            "paragraphs": [
                                "FIG. 3 shows the ratio of circulating CD38 positive monocytes to total lymphocytes over the 12 months of the TRIIM trial and for another 6 months after discontinuing treatment. There is more than a 33% decline in the monocyte to lymphocyte ratio (MLR), which is quite significant, both biologically and statistically (p=0.00055), and this decline persists after discontinuing treatment. This is to be understood in the light of the fact that CD38 is the enzyme whose age-related increase in expression drives the cardinal age-related loss of NAD [8], which in turn drives deep and widespread aspects of mammalian aging [15]. An increased MLR also strongly correlates with the age-related increase in risk of both cancer [27] and cardiovascular disease [22]. Cancer and cardiovascular disease are the two leading killers of aging humans, and reduced risk from these two diseases of aging further suggests a general reversal of aging processes. The MLR was determined from CyTOF analysis of TRIIM PBMC samples that were stored and analyzed at Stanford's Human Immune Monitoring Center."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe decline in monocyte to lymphocyte ratio",
                                "describe persistence of decline after treatment"
                            ],
                            "num_characters": 1083,
                            "outline_medium": [
                                "describe decrease in monocyte to lymphocyte ratio"
                            ],
                            "outline_short": [
                                "show decrease in monocyte to lymphocyte ratio"
                            ]
                        },
                        {
                            "title": "Example 4",
                            "paragraphs": [
                                "FIG. 4 shows the relationship between thymic fat-free fraction (TFFF; see below) and the lymphocyte to monocyte cell ratio (LMR). The statistical significance of the correlation is at the p=0.0019 level, and links the improvement in LMR to the improvement in putative thymic functional mass. In fact, when variance explained by changes in TFFF are factored out of variance in the LMR, no change in LMR survives, suggesting that changes in the LMR are in fact caused by improvements in thymic function."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe correlation between thymic fat-free fraction and lymphocyte to monocyte cell ratio"
                            ],
                            "num_characters": 501,
                            "outline_medium": [
                                "describe correlation between thymic fat-free fraction and lymphocyte to monocyte cell ratio"
                            ],
                            "outline_short": [
                                "show correlation between thymic fat-free fraction and lymphocyte to monocyte ratio"
                            ]
                        },
                        {
                            "title": "Example 5",
                            "paragraphs": [
                                "To our surprise, three of our trial volunteers (33%) reported to us that their wives and friends had noticed darkening of their hair. FIG. 5 provides evidence that the invention surprisingly reverses the aging of hair follicles, based on three before-and-after comparisons showing one volunteer's hair a few months before treatment and at the end of treatment. This result is all the more remarkable considering that hair whitening is caused by the death of follicular melanocyte stem cells, suggesting restoration of stem cells by the invention.",
                                "These observations were completely unanticipated. This phenomenon is suggestive of a broad “anti-aging” effect, and has not been reported to our knowledge after use of any of the individual agents of the present invention (in this case, GH, DHEA, and metformin) when they are not combined with one another as required by the present invention, and this effect of the combination is unpredictable from the properties of the uncombined agents. The phenomenon adds further market appeal to the treatment, manufacturing process, medication combination, and compositions of the present invention."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe darkening of hair",
                                "provide evidence of hair follicle reversal"
                            ],
                            "num_characters": 1139,
                            "outline_medium": [
                                "describe reversal of hair follicle aging"
                            ],
                            "outline_short": [
                                "show reversal of hair whitening"
                            ]
                        },
                        {
                            "title": "Example 6",
                            "paragraphs": [
                                "FIG. 6 provides evidence that the invention surprisingly restores thymotrophic hormones in a subset of TRIIM trial volunteers, based on correlated increases in both IL-7 and IL-21 (FGF-21) in these men. IL-7 is a hormone whose downregulation in youth has been associated with the onset of thymic involution, and restoration of which has been proposed, but not achieved, for inducing thymic regeneration [5]. IL-21 has been shown to regenerate the aged thymus in rodents when excessively over-expressed to a level that may or may not be feasible or desirable in humans [2, 47], and is a theoretical alternative pathway to thymus regeneration. We asked whether part of the mechanism of action of our invention was induction of IL-7 and/or IL-21, i.e., stimulation by our medication combination of endogenous thymic regeneration pathways. FIG. 6 indicates that the answer to the question is positive, and demonstrates a heretofore unknown and safe method for increasing IL-7 and IL-21 in humans. Once again, reactivation of pathways found in youth provides additional evidence for an overall aging reversal effect of our combination of medications."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe increase in IL-7 and IL-21",
                                "demonstrate induction of thymic regeneration pathways"
                            ],
                            "num_characters": 1145,
                            "outline_medium": [
                                "describe increase in thymotrophic hormones"
                            ],
                            "outline_short": [
                                "show increase in IL-7 and IL-21"
                            ]
                        },
                        {
                            "title": "Example 7",
                            "paragraphs": [
                                "FIG. 7 reveals a heretofore unknown phenomenon, i.e., that the CD4/CD8 cell ratio peaks in the face of a constant or an increasing dose of GH or rise in IGF-1, and thereafter declines. Different men show a peak in CD4/CD8 ratio at different times (here, 3, 6-9, and 12 months; one volunteer failed to respond at any time). The decline of CD4/CD8 cell ratio with aging is a classical indication of the “immune risk phenotype” or immunosenescence, and appears to occur with or without chronic viral exposure [24] and has been a strong predictor of the short-term risk of death [37]. Our results therefore indicate that prior art methods of regenerating the thymus require improvement. Without knowledge of the phenomenology of FIG. 7, it was impossible to optimize GH therapy during the TRIIM trial, and in fact, the phenomenon was not understood until after the end of the trial, but we can now infer that the GH dose should stop increasing, and should even begin to decrease, when the CD4/CD8 cell ratio is observed to peak, so that the peak can be sustained. Although the considerable successes of the TRIIM trial were achieved without the advantage of the teachings of FIG. 7, adjusting treatment according to the findings of FIG. 7, as described herein, should produce still stronger benefits."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe peak in CD4/CD8 cell ratio",
                                "infer optimal GH therapy"
                            ],
                            "num_characters": 1296,
                            "outline_medium": [
                                "describe peak and decline of CD4/CD8 cell ratio"
                            ],
                            "outline_short": [
                                "show peak and decline of CD4/CD8 cell ratio"
                            ]
                        },
                        {
                            "title": "Example 8",
                            "paragraphs": [
                                "FIG. 8 provides detailed information on the improvement in functional thymic mass achieved by the TRIIM trial protocol and medications, as inferred from a reduction in the thymic fat percentage (TFFF=thymic fat-free fraction=100 minus the percentage of thymic mass represented by fat, where the thymic fat fraction was computed using an algorithm that has been shown to be of higher accuracy than standard histopathological assessment by biopsy [21]). Two basic phenomena are seen. First, for most men, there was a steady replacement of thymic fat with putative thymic functional mass from 0 to 9 months of treatment. In some cases, this improvement continued, whereas in others, it appeared to regress slightly from 9 to 12 months, akin to the peaking of the CD4/CD8 cell ratio described in FIG. 7, and perhaps originating from the same preventable cause. Second, two exceptional individuals showed a different pattern: their baseline TFFF was abnormally high and showed little improvement over time. These findings are further referred to in conjunction with the discussion of FIG. 9 below."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe improvement in functional thymic mass",
                                "infer two basic phenomena"
                            ],
                            "num_characters": 1092,
                            "outline_medium": [
                                "describe improvement in functional thymic mass"
                            ],
                            "outline_short": [
                                "show improvement in functional thymic mass"
                            ]
                        },
                        {
                            "title": "Example 9",
                            "paragraphs": [
                                "FIG. 9 provides a glimpse of some of the evidence that the invention is able to improve T cell populations in at least a subset of aging men and that the subset of men who benefit can be predicted prior to treatment and is closely related to changes seen in the thymus. As can be seen, the relative improvement of TFFF depends on basal TFFF: the higher the TFFF at baseline, the less room there is for improvement. Similarly, the improvement of naïve CD8 cell counts also depends on how high the counts are at baseline: volunteers with high naïve CD8 cell numbers at baseline have less need for improvement, and show less improvement, but despite lack of improvement, absolute counts remain good. Also, like TFFF, naïve CD8 cell counts are sometimes lower at 12 months than at 9 months in some cases, whereas volunteers with lower naïve CD8 cell counts at baseline, who have a stronger need for improved counts, show continuing improvement between 9 and 12 months. These results represent only a partial analysis of the TRIIM data; additional analysis is likely to show additional evidence of benefit. Note that the lower right panel shows that TFFF and naïve CD8 cells don't correlate well at baseline; therefore, changes in TFFF and naïve CD8 cells can only be correlated by showing the same trends in both, as demonstrated here.",
                                "In addition to the data shown here, there is a way to infer naïve CD8 cell counts from epigenetic clock data, which may be more accurate than relying on a relatively small number of frozen-thawed cell samples. On the basis of such data, the p value for an overall increase in naïve CD8 cell counts was found to be p=0.0017. A similar analysis for naïve CD4 cells fell just short of statistical significance, but subgroup analysis of the kind shown for naïve CD8 cells in FIG. 9, now underway, may reveal subsets of volunteers whose improvements in naïve CD4 cells are clear.",
                                "The fact that thymic structural improvement, the CD4/CD8 cell ratio, and naïve CD8 T cells all show signs of improvement to a certain point followed by a small reversion toward baseline supports the significance of adjusting treatment based on the CD4/CD8 cell ratio so as to prevent overdosing and desensitization of the thymus.",
                                "Meanwhile, the observations of FIG. 9 provide valuable diagnostic criteria (TFFF and naïve CD8 cell counts) by which patients wishing to consider thymus regeneration and aging reversal treatment can be evaluated prior to treatment to determine their likelihood of experiencing a positive response.",
                                "Finally, the restoration of naïve CD8 and perhaps naïve CD4 T cells represents yet one more example of processes that are the opposite of normal age-related trends.",
                                "**Example 10**",
                                "We observed that the treatment medications and methods were able to reverse age-related fatty infiltration of the bone marrow, based on the same analytical method used to determine an improvement in TFFF. The p value for this change was 9.5×10−12. Bone marrow function in aging is important for many reasons, but one important reason is that the bone marrow supplies progenitor T cells to the thymus, where they mature into competent T cells in youth. Successful immunorestoration in the elderly requires appreciable bone marrow function, and the changes observed from MRI investigation of bone marrow indicate that the medications of the present invention have effects on bone marrow consistent with this requirement. This change is one more change that is contrary to the direction of normal aging trends.",
                                "**Example 11**",
                                "FIG. 10 shows that the medications and treatments of the present invention result in increased glomerular filtration rates over the course of the 12 months of treatment and beyond, reaching statistical significance at 9 months, 12 months and overall out to 18 months. “eGFR” is “estimated GFR” and is calculated based on age, sex, race, and serum creatinine levels. Normally, renal function declines with aging. Here is another example of the functional reversal of a normal age-related trend.",
                                "**Example 12**",
                                "FIG. 11 demonstrates the first direct evidence for a global reversal of human aging. Using an epigenetic clock licensed by Zymo Research [20], the longitudinal epigenetic age of TRIIM trial volunteers was calculated at months 0, 9, and 12. At baseline (month 0), the mean epigenetic age of the volunteers was about 0.75 years older than their chronological ages. By 9 months, there was a gain of about 0.8 years, indicating rejuvenation back to a biological age appropriate for the volunteers' mean chronological age. However, three months later, the mean epigenetic age had declined to 1.5 years younger than the volunteers' mean chronological age. In total, net rejuvenation after 1 year of treatment was about 2.25 years. But since 1 year of treatment would have normally entailed one additional year of aging, the net gain was actually 3.25 years compared to no treatment. The p value for this change was 0.0059. In general, epigenetic clocks of this kind can determine biological age more accurately than biological age can be estimated from chronological age.",
                                "**Example 13**",
                                "FIG. 12 demonstrates that the invention can successfully suppress GH-induced hyperinsulinemia despite the increasing GH doses described in FIG. 1. Here, for context, insulin blood levels are expressed as a fraction of the distance from the bottom of the normal range to the top of the normal range. Although insulin control was not perfect, the final increase in insulin at trial end was acceptable based on volunteers averaging about one fifth of the upper limit for insulin. Note the rise in insulin early on, as lower doses of GH were given without administration of DHEA or metformin, followed by declining insulin levels as antihyperinsulinemic therapy was begun. Insulin and the normal insulin range were as reported by Quest Diagnostics."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe improvement in T cell populations",
                                "predict subset of men who benefit",
                                "correlate TFFF and naïve CD8 cell counts",
                                "show relative improvement of TFFF",
                                "show improvement of naïve CD8 cell counts",
                                "describe lower right panel",
                                "infer naïve CD8 cell counts from epigenetic clock data",
                                "analyze naïve CD4 cells",
                                "support significance of adjusting treatment",
                                "provide diagnostic criteria",
                                "represent restoration of naïve CD8 and CD4 T cells"
                            ],
                            "num_characters": 5884,
                            "outline_medium": [
                                "describe improvement in T cell populations",
                                "describe correlation between TFFF and naïve CD8 cell counts",
                                "describe subgroup analysis of naïve CD8 cell counts",
                                "describe diagnostic criteria for thymus regeneration treatment",
                                "describe restoration of naïve CD8 and CD4 T cells"
                            ],
                            "outline_short": [
                                "show improvement in T cell populations",
                                "show correlation between TFFF and naïve CD8 cell counts"
                            ]
                        }
                    ],
                    "outline_long": [
                        "describe clinical study",
                        "introduce Example 1: decrease in hsCRP",
                        "introduce Example 2: reduction in prostate cancer risk",
                        "introduce Example 3: decline in monocyte to lymphocyte ratio",
                        "introduce Example 4: correlation between thymic fat-free fraction and lymphocyte to monocyte cell ratio"
                    ],
                    "num_characters": 2685,
                    "outline_medium": [
                        "describe clinical study and trial design",
                        "outline exclusion criteria and informed consent process"
                    ],
                    "outline_short": [
                        "describe clinical study and its results"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "The present invention provides for the first time medication combinations, compositions, doses, dosage regimens, and other methods that have demonstrable and objective benefits for the treatment of immunosenescence and many fundamental aspects of aging in human patients, and for further improvements that are now enabled by the present disclosures.",
                        "Additional ways to describe the invention include the following.",
                        "1. A method whereby the co-administration of human growth hormone and/or one or more human growth hormone releasing agents, DHEA, and metformin to humans results in the reversal of age-related health risk factors other than thymic involution.",
                        "2. The method above (“the method”) wherein the dose of human growth hormone or growth hormone releasing agents is adjusted in response to changes in the CD4 to CD8 T cell ratio so as to prevent the CD4 to CD8 T cell ratio from declining due to over- or under-administration of human growth hormone or growth hormone releasing agents.",
                        "3. The method, wherein one age-related health risk factor that improves is the age-related decrease of estimated or directly measured glomerular filtration rate.",
                        "4. The method, wherein one age-related health risk factor that improves is the age-related increase in the blood level of prostate-specific antigen (or PSA) and/or the age-related decrease in the percent of free PSA.",
                        "5. The method, wherein one age-related health risk factor that improves is systemic inflammation, where the improvement is indicated by a decrease in high-sensitivity C-reactive protein (hsCRP) blood levels.",
                        "6. The method, wherein one age-related health risk factor that improves is the risk of cardiovascular disease, where the improvement is indicated by an increased lymphocyte to monocyte ratio.",
                        "7. The method, wherein one age-related health risk factor that improves is the risk of cancer, where the improvement is indicated by an increased lymphocyte to monocyte ratio.",
                        "8. The method, wherein one age-related health risk factor that improves is the age-related increase in CD38 levels, where the improvement is indicated by a decrease in CD38 positive monocytes.",
                        "9. The method, wherein said co-administration of human growth hormone and/or one or more human growth hormone releasing agents, DHEA, and metformin to humans also results in increased hair pigmentation.",
                        "10. The method, wherein said co-administration of human growth hormone and/or one or more human growth hormone releasing agents, DHEA, and metformin to humans also results in increased blood levels of FGF21/IL21 and/or IL7.",
                        "11. The method, wherein the dose of DHEA is 17-300 mg.",
                        "12. The method, wherein the dose of metformin is 500 to 2500 mg.",
                        "13. The method, wherein metformin or metformin and DHEA are provided in a unified composition.",
                        "14. The method, wherein said unified composition of metformin and DHEA is provided in a timed-release dosage form for better matching the half-lives of DHEA and/or particularly metformin to the duration of the hyperinsulinemic effect of GH, GH releaser, or GH plus GH releaser.",
                        "15. The method, wherein said human growth hormone and/or one or more human growth hormone releasing agents are combined into a unified product composition.",
                        "As noted above, a major mode of biological action within the invention is elevation of IGF-1, which may be accomplished by any IGF-1 elevating agent, including the anabolic agent IGF-1 itself or a combination of IGF-1 and IGFBP-3. In addition, other insulin-mitigating agents besides DHEA and metformin may have utility in the invention, including as weak and secondary antihyperinsulinemic agents, such as cinnamon preparations, chromium picolinate, and other forms known in the art. The best mode reduction of the invention as described here is intended to be descriptive but not limiting, and may affect other critical endpoints of aging in addition to those described herein."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "summarize invention",
                        "describe method of co-administration",
                        "adjust dose of human growth hormone",
                        "improve estimated glomerular filtration rate",
                        "improve PSA and free PSA",
                        "improve systemic inflammation",
                        "provide additional ways to describe invention"
                    ],
                    "num_characters": 3912,
                    "outline_medium": [
                        "summarize benefits of medication combinations for immunosenescence and aging",
                        "describe additional ways to describe the invention",
                        "outline various embodiments of the invention"
                    ],
                    "outline_short": [
                        "summarize invention and its benefits"
                    ]
                }
            ],
            "outline_long": [
                "claim priority and relate to other patents"
            ],
            "num_characters": 607,
            "outline_medium": [
                "claim priority and relate to other patents"
            ],
            "outline_short": [
                "claim priority and relate to other patents"
            ]
        }
    ],
    "claims": [
        "1. The use of a combination of human growth hormone (GH) and/or a GH releaser, dehydroepiandrosterone (DHEA), and metformin to manufacture a pharmaceutical dosage form to treat, prevent, or reverse broad aspects of human aging, including any one of, any combination of, or all of age-related changes in systemic inflammation as indicated by hsCRP or other accepted markers, cancer risk as indicated by PSA levels or the percent of free PSA or the ratio of PSA to percent of free PSA or its reciprocal and/or by the lymphocyte to monocyte cell ratio, heart disease risk as indicated by the lymphocyte to monocyte cell ratio, CD38-positive blood cell counts or percentages, hair color, IL-7 levels, IL-21 levels, the CD4/CD8 cell ratio, naïve CD4 and/or CD8 cell numbers or percentages, total CD4 and/or CD8 T cell numbers or percentages, bone marrow density, thymic fat-free fraction, glomerular filtration, and epigenetic age, as well as to reduce or prevent GH-induced or GH releaser-induced hyperinsulinemia.",
        "2. The pharmaceutical dosage form of claim 1, which may comprise any of\na) three separate agents or agent classes (the GH and/or GH releaser; DHEA; and metformin), which are to be administered simultaneously or within 2 hours of one another;\nb) GH and/or a GH releaser used simultaneously with or within two hours of a unified companion product composition containing DHEA in combination with metformin.",
        "3. A composition for use in the treatment of human aging, comprising a combination of GH and/or a GH releaser, dehydroepiandrosterone, and metformin whose administration results in mitigation of age-related changes in any one of, any combination of, or all of the following: systemic inflammation as indicated by hsCRP or other accepted markers, cancer risk as indicated by PSA levels or the percent of free PSA or the ratio of PSA to percent of free PSA or its reciprocal and/or by the lymphocyte to monocyte cell ratio, heart disease risk as indicated by the lymphocyte to monocyte cell ratio, CD38-positive blood cell counts or percentages, hair color, IL-7 levels, IL-21 levels, the CD4/CD8 cell ratio, naïve CD4 and/or CD8 cell numbers or percentages, total CD4 and/or CD8 T cell numbers or percentages, bone marrow density, thymic fat-free fraction, glomerular filtration, and epigenetic age, as well as to reduce or prevent GH-induced or GH releaser-induced hyperinsulinemia.",
        "4. The composition of claim 3, which may comprise any of:\na) three separate agents or agent classes (the GH and/or GH releaser; DHEA; and metformin), which are to be administered simultaneously or within 2 hours of one another, or\nb) GH and/or a GH releaser used simultaneously with or within two hours of a unified companion product composition containing DHEA in combination with metformin.",
        "5. A method for the mitigation or reversal of human aging, comprising administering a combination of GH and/or a GH releaser, dehydroepiandrosterone, and metformin so as to result in mitigation or reversal of age-related changes in any one of, any combination of, or all of the following: systemic inflammation as indicated by hsCRP or other accepted markers, cancer risk as indicated by PSA levels or the percent of free PSA or the ratio of PSA to percent of free PSA or its reciprocal and/or by the lymphocyte to monocyte cell ratio, heart disease risk as indicated by the lymphocyte to monocyte cell ratio, CD38-positive blood cell counts or percentages, hair color, IL-7 levels, IL-21 levels, the CD4/CD8 cell ratio, naïve CD4 and/or CD8 cell numbers or percentages, total CD4 and/or CD8 T cell numbers or percentages, bone marrow density, thymic fat-free fraction, glomerular filtration, and epigenetic age, as well as to reduce or prevent GH-induced of GH releaser-induced hyperinsulinemia.",
        "6. The method of claim 5, which may comprise any of:\na) administering three separate agents or agent classes (the GH and/or GH releaser; DHEA; and metformin) simultaneously or within 2 hours of one another, or\nb) administering GH and/or a GH releaser simultaneously with or within two hours of the oral administration of a unified companion product composition containing DHEA in combination with metformin.",
        "7. A composition for use in the treatment of human aging, comprising an agent that increases IGF-1 levels and one or more insulin-lowering agents whose administration results in mitigation of age-related changes in any one of, any combination of, or all of the following: immune system function as indicated by the lymphocyte to monocyte ratio, CD38-positive blood cell counts or percentages, total CD4 and/or CD8 T cell numbers or percentages, IL-7 levels, IL-21 levels, the CD4/CD8 cell ratio, naïve CD4 and/or CD8 cell numbers or percentages, bone marrow density, thymic density or fat-free fraction, or other accepted markers of immune system function, inflammation as indicated by hsCRP or other accepted markers, cancer risk as indicated by PSA levels, the percent of free PSA, the ratio of PSA to percent of free PSA, its reciprocal, and/or by the lymphocyte to monocyte cell ratio or other accepted markers of cancer risk, heart disease risk as indicated by the lymphocyte to monocyte cell ratio, CD38-positive blood cell counts or percentages or other accepted markers of heart disease risk, hair color, glomerular filtration or other accepted markers of kidney function, epigenetic age, or other critical endpoints of aging, as well as to reduce or prevent GH-induced or GH releaser-induced hyperinsulinemia.",
        "8. A composition for use in the treatment of human aging, comprising a combination of one or more anabolic agents with one or more insulin-lowering agents whose administration results in mitigation of age-related changes in any one of, any combination of, or all of the following: immune system function as indicated by the lymphocyte to monocyte ratio, CD38-positive blood cell counts or percentages, total CD4 and/or CD8 T cell numbers or percentages, IL-7 levels, IL-21 levels, the CD4/CD8 cell ratio, naïve CD4 and/or CD8 cell numbers or percentages, bone marrow density, thymic density or fat-free fraction, or other accepted markers of immune system function, inflammation as indicated by hsCRP or other accepted markers, cancer risk as indicated by PSA levels, the percent of free PSA, the ratio of PSA to percent of free PSA, its reciprocal, and/or by the lymphocyte to monocyte cell ratio or other accepted markers of cancer risk, heart disease risk as indicated by the lymphocyte to monocyte cell ratio, CD38-positive blood cell counts or percentages or other accepted markers of heart disease risk, hair color, glomerular filtration or other accepted markers of kidney function, epigenetic age, or other critical endpoints of aging as well as to reduce or prevent GH-induced or GH releaser-induced hyperinsulinemia."
    ]
}