{
    "id": "https://semopenalex.org/work/W2107467573",
    "authors": [
        "Johan A. Martens",
        "Christophe Bouchy",
        "Gaëlle Hastoy",
        "Emmanuelle Guillon"
    ],
    "title": "Fischer-Tropsch Waxes Upgrading<i>via</i>Hydrocracking and Selective Hydroisomerization",
    "date": "2009-01-01",
    "abstract": "In recent years, the production of hydrocarbon cuts from various sources via the Fischer-Tropsch process has lived a renewed interest. Paraffinic cuts produced via the Fischer-Tropsch reaction can be upgraded either to liquid fuels (middle distillates) or to lubricant base oil of high quality. The first kind of upgrading involves the use of a hydrocracking catalyst whereas for the second kind of upgrading selective hydroisomerization catalysts can be selected. Both catalysts are bifunctional and contain an hydrogenation/dehydrogenation function and an acidic function; however, it is shown that depending of the kind of upgrading needed, the acidic function has to fulfill various requirements. The first part of this article is a short review dealing with long chain n-paraffin hydrocracking mechanisms and catalysts. Specificities of Fischer-Tropsch feedstocks compared to conventional ones as well as the potential impact of oxygenate compounds on the hydrocracking catalysts are underlined. The second part of this article is devoted to the selective hydroisomerization mechanisms and catalysts. It is shown that the topology of the solid acid porosity is a key factor for governing the selectivity of the catalyst towards hydroisomerization.",
    "sections": [
        {
            "title": "INTRODUCTION",
            "paragraphs": [
                "In recent years, the production of liquid fuels from various sources (coal, biomass, gas) via the Fischer-Tropsch process has lived a renewed interest. In particular, diesel fuels produced according to this process exhibit outstanding properties compared to diesel fuels derived from crude oil: very high cetane number (typically above 70), and virtually no sulfur, nitrogen and aromatics, resulting in reduced emission of pollutants from the engine. Production of diesel fuels involves the catalytic hydrocracking of the heaviest part of the Fischer-Tropsch (FT) hydrocarbons. Alternatively, waxes produced by the Fischer-Tropsch unit could be upgraded to lubricant base oil, the catalytic dewaxing route to lubricants base oil becoming the preferred option compared to conventional solvent dewaxing. The catalytic dewaxing route involves the selective hydroisomerization of the heaviest part of the Fischer-Tropsch hydrocarbons. Both types of upgrading involve the use of bifunctional catalysts.",
                "In the first part of this article, a short review about long chain n-paraffin hydrocracking mechanisms and catalysts is provided. Special attention is paid to the specificities of the FT feedstocks, and the potential impact of oxygenate compounds on the hydrocracking catalyst.",
                "The second part of this article is dedicated to selective hydroisomerization of long chain n-paraffin. Special attention is paid to pore mouth and key-lock catalysis. It is illustrated how zeolite topology next to acidity is a key factor governing the selectivity of the hydroisomerization catalyst."
            ],
            "subsections": []
        },
        {
            "title": "GENERALITIES ON FISCHER-TROPSCH PRODUCTS AND HYDROCRACKING 1.Low Temperature Fischer-Tropsch Products",
            "paragraphs": [
                "Whatever the catalysts and reaction conditions, the Fischer-Tropsch reaction produces normal aliphatic hydrocarbon chains with a wide range of carbon numbers. The carbon number distribution of the products follows the Anderson -Flory -Schultz (AFS) polymerization model. According to the AFS model, the carbon number distribution of the products is a function of the chain growth probability α at the surface of the catalyst (Fig. 1).",
                "With such kinetics, the selective synthesis of a product with a narrow range of chain lengths is not possible, except for methane if α equals 0 or for infinite chain length if α equals 1. Assuming ideal AFS kinetics, the maximum straight run middle distillates yield (typically the C 10 -C 20 cut) achievable is about 40 wt% (Fig. 2).",
                "n-paraffins and n-olefins are the main products of the Low Temperature Fischer-Tropsch (LTFT) synthesis but sideproducts like oxygenates and branched compounds can also be obtained. LTFT products are virtually free of nitrogen and sulfur compounds [2].  Product composition (wt%) against chain growth probability assuming ideal AFS kinetics, from [1]."
            ],
            "subsections": [
                {
                    "title": "The Hydrocracking of Fischer-Tropsch Products",
                    "paragraphs": [
                        "Ideally, the hydrocracking stage should fulfill several requirements. Hydrocracking should selectively convert the heavy paraffins into middle distillates. It should minimize cracking of the middle distillates already present in the feedstock, if any. Furthermore, it should favor the production of isomerized middle distillates in order to improve the cold flow properties.",
                        "Hydrocracking catalysts always contain a hydrogenation/ dehydrogenation (HD/DHD) function provided by one or more metals or one or more sulfides and an acidic function of ",
                        "the Brönsted type. Compared to conventional hydrocracking of petroleum-based feedstocks, high conversion of the FT feedstock can be obtained under mild hydrocracking conditions thanks to the high chemical reactivity of heavy paraffin molecules and the absence of strong catalyst contaminants like sulfur or nitrogen compounds (Table 1). "
                    ],
                    "subsections": []
                },
                {
                    "title": "Hydrocracking Mechanisms",
                    "paragraphs": [
                        "Since the original reports from Weisz [7] and Coonradt and Garwood [8], the hydroisomerization and hydrocracking of n-paraffins on bifunctional catalysts have been extensively",
                        "studied. Currently, the most accepted reaction mechanism is the one depicted in Figure 3. For proper functioning, the HD/DHD site requires the presence of hydrogen gas. After adsorption on the HD/DHD site, the n-paraffin is dehydrogenated to a corresponding n-olefin. The n-olefin diffuses to a Brönsted acidic site to be protonated and transformed to a carbocation. The carbocation can be isomerized into an isocarbocation and/or cracked to produce a lighter olefin and a lighter carbocation. After deprotonation, the various olefinic products diffuse back to an HD/DHD site and are hydrogenated. Finally, hydrogenated products are desorbed from the catalyst. In the period 1980's-1990's, several authors proposed reaction mechanisms involving surface silicon alkoxide type reaction intermediates. The proposal was based on the outcome of computational studies on the interaction of small hydrocarbon molecules with cluster models representing a zeolite. Such simulations, because of computational limitations, have never been performed for the long alkanes discussed here. There is an important experimental observation in favor of the alkylcarbenium ion model. The detailed hydroisomerization and hydrocracking selectivity patterns obtained on Pt/H-USY zeolites with different acidity (different Si/Al content) is identical. If alkoxides were involved, and reaction mechanisms concerted as proposed by Kazanski et al. [9,10], the selectivity patterns would be different and strongly depending on the zeolite composition. Therefore, with long hydrocarbon chains, alkylcarbenium ion chemistry appropriately describes the catalytic conversions. These arguments are developed in references [11][12][13].",
                        "The formation of cracked products generally involves two successive reaction steps: the hydroisomerization step and the actual hydrocracking step."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Diffusion",
            "paragraphs": [
                "Bifunctional mechanism for hydroisomerization and hydrocracking of a normal paraffin.",
                "Several studies demonstrated that the A type isomerization is much faster than the B type isomerization [15,16]. Consequently, on bifunctional catalysts that do not exhibit molecular shape selectivity, positional isomer fractions tend to be distributed according to their internal thermodynamic equilibria.",
                "The hydrocracking step occurs via the scission of the carbon -carbon bond in β position of the positively charged carbon atom of the carbocation, a process called β-scission. It results in the formation of a smaller carbocation and an olefin. According to the stability of the carbocations involved, five types of β-scission can be distinguished (Table 2, [17]).",
                "The relative cracking rates are related to the relative stability of the carbocations involved. The reaction rate obeys to the following order: A >> B1 ≈ B2 > C >>> D. The relative rate of isomerization and β-scission reactions decreases in the following order: A type β-scission >> A type isomerization >> B type isomerization ≈ B1 and B2 type β-scission > C type β-scission >> D type β-scission. Fast cracking only can occur once the paraffin has been hydroisomerized and the fastest cracking mode require three branchings in the chain. The A and B type cracking mechanisms lead to the formation of cracked products that are branched (Table 2). The detailed composition of the carbon number fractions in terms of carbon number distribution and skeletal isomer 94",
                "Two types of mechanisms rule the hydroisomerization step: -Type A isomerization: the branching degree of the carbocation is not modified but branchings undergo positional changes via alkyl and hydride shift [14], for example:",
                "-Type B isomerization: the branching degree of the carbocation is increased or decreased via the formation of cyclic carbonium ion intermediates, like the protonated cyclopropane (PCP) [15]: The five types of β-scission, from [17] Type"
            ],
            "subsections": []
        },
        {
            "title": "Minimal number Carbenium ions of C-atoms in chain involved",
            "paragraphs": [
                "composition can be modeled based on the operation of the five types of β-scissions on the skeletal isomers of the converted model n-paraffin [18,19].",
                "The carbocation chemistry is of particular relevance for the hydrocracking of LTFT wax since the middle distillates produced will be branched as illustrated in Figure 4. The product inherently will exhibit improved cold flow properties. Evidently, primary cracked products can undergo some hydroisomerization depending on reaction severity. As a consequence the third requirement of the hydrocracking stage (see Sect. 1.2) can be met.",
                "For hydroisomerization and hydrocracking on bifunctional ultrastable Y zeolites (USY), kinetic models accounting for the entire reaction network and all elementary steps on acidic site including physisorption, (de)-protonation, hydride shift, alkyl shift, protonated cyclopropane branching, β-scission, are available [21][22][23]. In these models, elementary steps on the HD/DHD sites are not taken into account as hydrogenation/ dehydrogenation reactions attain quasi-equilibrium (\"ideal\" hydroisomerization/hydrocracking catalyst, see Sect. 1.4). Recently, a detailed kinetic model has been developped for the three-phase hydrocracking of heavy paraffins in wich the rate-determining step is assumed to occur on both acid and HD/DHD sites of the catalyst (\"non ideal\" hydrocracking catalyst) [24]. This review will be limited to the features of ideal bifunctional catalysis.",
                "Differences in acidity of Y zeolite catalysts can be accounted for by adapting the protonation enthalpy in the model of ideal bifunctional catalysis [12]. These single-event microkinetic models originally were developed for vaporphase conditions. The experiments were run in the pressure Figure 4 Isomerization degree of the C 30-cut produced by a commercial wax hydrocracked on a bifunctional catalyst [20]. range 0.1-5 MPa. The partial pressure of the n-paraffin was kept low enough to prevent condensation. Typically the H 2 /HC pressure ratio was 13 to 375. The models were adapted to liquid phase conditions by considering that the density of the bulk reactant phase affects the physisorption as well as the protonation steps in the reaction network [25]. Under vapor phase reaction conditions, the paraffins react strictly in order of decreasing chain length because of competitive physisorption. The denser the hydrocarbon phase, the less the heavier hydrocarbons are favoured for adsorption in the zeolite pores. According to theoretical calculations, the adsorption selectivity for the smallest molecules should increase with increasing pressure because small molecules can be packed more efficiently in a confined environment [26]. Next to the change in physisorption competition, phase density has also an impact on the protonation. Carbocations are better stabilized at higher bulk phase density [25]. Denayer et al. [27] reported that the rate of n-heptane conversion relative to n-nonane in a binary mixture was enhanced by more than a factor of 2 by changing the phase from vapor to liquid.",
                "There are many reports on the relative reactivity of n-paraffins towards cracking. The reactivity increases with the chain length and with the increasing number of possible scission reactions (Table 3). When LTFT waxes are processed on a bifunctional hydrocracking catalyst, process conditions can be tuned in order to achieve significant hydrocracking of the heavy part of the feed (say C 20+ paraffin) and to minimize the cracking of the lighter part of the feed and especially the middle distillates. As a consequence, the second requirement of the hydrocracking stage (see Sect. 1.2) could also be fulfilled.",
                "It should also be emphasized that under mild hydrocracking conditions, the feedstock is partially vaporized and the lighter part of the feed will therefore escape from the trickle bed reactor. Calemma et al. [6] reported the strong impact of temperature and hydrogen/feedstock ratio on the vapor/liquid ratio and phase composition in mild hydrocracking of FT waxes. From Table 4, it clearly appears that under typical process conditions the liquid phase is enriched in heavier C 22+ paraffins compared to the feedstock. For an ideal trickle bed reactor, catalyst particles are entirely covered by the liquid and the reaction takes place only in the liquid phase, enriched in heavier paraffins."
            ],
            "subsections": [
                {
                    "title": "\"Ideal\" Hydrocracking Catalyst",
                    "paragraphs": [
                        "In order to fulfill the first requirement of the hydrocracking stage (Sect. 1.2), the formulation of the hydrocracking catalyst is of course of prime importance. As middle distillates are the targeted hydrocracked products, successive cracking of the primary cracked products should be minimized, therefore: -the reaction rate should not be limited by olefins transport, so the two catalytic functions must be at short mutual distance in order to respect the Weisz's intimacy criterion [7]; In such catalyst, the hydro/dehydrogenation reactions are at quasi equilibrium and the limiting step of the reaction takes place on the acidic function (Fig. 3). Such catalyst is considered as an \"ideal\" bifunctional or hydrocracking catalyst according to Weitkamp terminology [28]. The key features of ideal hydrocracking of long chain n-paraffins are [28]: -low reaction temperature, -the possibility of high selectivities for isomerization, -the possibility of pure primary cracking.",
                        "For instance, Figure 5 depicts the molar carbon number distribution of cracked products for the hydrocracking of nhexadecane with an ideal (Pt/CaY) and non ideal (Co-Mo-S/SiO 2 -Al 2 O 3 ) hydrocracking catalyst [30]. For each catalyst, the reaction conditions were adjusted to obtain ca. 50% conversion in hydrocracked products. With the ideal hydrocracking catalyst, the carbon number distribution of cracked products is fully symmetrical and centered at around half of the original molecule. The molar ratio of cracked products to cracked n-C 16 H 34 molecules is equal to two, which is indicative of pure primary cracking: the n-C 16 H 34 molecule is cracked once and the cracked products are desorbed from the catalyst before any further scission occurs. On the contrary with the non ideal hydrocracking catalyst secondary cracking occurs, as revealed by the higher value of the molar ratio of cracked products to cracked n-C 16 H 34 , and the carbon number distribution of cracked products is now skewed to lighter compounds, peaking typically in the C 4 -C 5 cut. As the cracking reactions of the primary cracked products are consecutive reactions, at very high conversion even for an \"ideal\" hydrocracking catalyst secondary cracking will eventually occur. The distribution of cracked products will be shifted towards lighter compounds because of the higher reactivity of the 96  longest primary fragments [31]. Following Marcilly's definition, the ideal hydrocracking catalyst is the catalyst for which primary cracking occurs up to the highest conversion [32].",
                        "It should be emphasized that the occurrence of ideal hydrocracking is not only related to the catalyst formulation, but also depends on the operating conditions. Thybault et al. [33] demonstrated that for a given catalyst formulation (Pt-USY), increasing the total pressure and decreasing temperatures and molar hydrogen to hydrocarbon ratio favored ideal hydrocracking of n-alkanes (range n-octane to n-hexadecane). On the contrary, very high reactant carbon numbers were found to be detrimental to ideal hydrocracking. In the field of conventional hydrocracking, it is also well known that the presence of compounds like hydrogen sulfide or ammonia can strongly affect the balance of hydro/dehydrogenation function to cracking function and, as a result, deteriorate the \"ideality\" of the hydrocracking catalyst [34,35].",
                        "The typical product selectivities defined as C 3 -C 4 (LPG), C 5 -C 9 (naphtha) and C 10 -C 20 (middle distillates) cuts than can be reached when a long chain paraffin, say tricosane (n-C 23 H 48 ), undergoes ideal hydrocracking can be predicted assuming the following hypotheses based on the reaction mechanisms already discussed: -only pure primary cracking is allowed, -C 1 and C 2 cannot be formed, -equal molar amounts of fragments between C 4 to C 19 are formed, -molar amounts of C 3 and C 20 are half from molar amounts of fragments between C 4 and C 19 . Figure 6 depicts this theoretical molar carbon number distribution of cracked products for the ideal hydrocracking of tricosane. It appears that on a weight basis, typical selectivity in middle distillates as high as 79% can be obtained. Therefore, if the production of heavy paraffins in the Fischer-Tropsch unit is combined with an ideal hydrocracking of these paraffins in an hydrocracking unit working in a full conversion mode, middle distillates yields around 80% could be obtained. Interesting to note is that this value is about twice that of the maximum middle distillates yield than could be produced with a Fischer-Tropsch unit alone (see Fig. 2). The operation in two-stages, viz. FT followed by hydrocracking is applied in the Shell Middle Distillate Synthesis Process [29]."
                    ],
                    "subsections": []
                },
                {
                    "title": "LTFT Waxes Hydrocracking Catalysts Formulations 1.5.1 Hydro/Dehydrogenation (HD/DHD) Function",
                    "paragraphs": [
                        "Like for catalysts designed for hydrocracking of conventional petroleum feedstocks, the following metals could be used as HD/DHD function: noble metals (Pt, Pd), and non-noble transition metals from group VIA (Mo, W) and group VIIIA (Co, Ni). Transitions metals from group VIA and VIIIA are usually applied as sulfides (Ni-W, Ni-Mo, Co-Mo). Based on the hydrogenation of toluene in the presence of hydrogen sulfide there is an optimum atomic ratio ρ of about 0.25 for the hydrogenating activity of the catalysts [36]:",
                        "As the LTFT waxes contain negligible amounts of sulfur, the use of noble metals can be quite effective, like in the case of two stages units hydrocrackers with a separate recycle system for the second stage operation [37]. Indeed, in a low  Molar carbon number distribution of cracked products for the hydrocracking of n-hexadecane at ca. 50% hydrocracking yield (adapted from [30]).",
                        "Figure 6 Theoretical molar carbon number distribution of cracked products for the ideal hydrocracking of tricosane. sulfur environment, the relative hydrogenation activities could be classified as follow [36,38]: noble metals > sulfided transition metals. Moreover for sulfided catalysts, some sulfiding agent like dimethyl disulfide must be added during the process in order to keep the HD/DHD function in its sulfided form. For example, for the hydrocracking of LTFT waxes, D. Leckel reported that hydrogen sulfide levels of 200 vppm in the tailgas were necessary to keep sulfided a NiMo based hydrocracking catalyst [39]. On the other hand, the noble metal based catalysts are much more expensive, and as quoted by de Haan and co-workers, the use of such catalysts is only justified when the benefit derived from their use offsets the initial higher price, including the fact that noble metals are reclaimable [40]. Therefore, the potential replacement of noble metals by base metals can be of great interest. Sasol reported recently [40] the evaluation of a hydrocracking catalyst using reduced (non sulfided) nickel as HD/DHD function for the hydrocracking of n-hexadecane and LTFT wax. With the LTFT wax, promising results were obtained in terms of middle distillates selectivity, but the Ni based catalyst produced also significant amounts of C 1 and C 2 . Similar results were also reported for the hydrocracking of n-tetradecane with a reduced (non sulfided) hydrocracking catalyst containing cobalt and molybdenum oxides as HD/DHD phase precursors. In that study, molar selectivities as high as 50% towards methane production were reported [41]. Methane and ethane could hardly be produced via the classical bifunctional mechanism as it would involve the formation of unstable primary carbocations. The observed methane formation is explained by the known high propensity of reduced cobalt or nickel to catalyse hydrocarbons deep hydrogenolysis, a reaction that proceeds much slowly on palladium or platinum [42] (see Fig. 7).",
                        "Clark et al. proposed to reduce the undesired hydrogenolysis by the adjunction of some group IB metal like copper [43], presumably on the basis of the initial report from the group of Sinfelt about nickel-copper alloys and their catalytic properties. It was reported that the nickel activity for ethane to methane hydrogenolysis was strongly suppressed in the presence of copper, whereas it was much less the case for the dehydrogenation of cyclohexane to benzene [44]. Similarly to Clark et al., de Haan et al. proposed to add tin to nickel based catalysts to reduce the excessive hydrogenolysis [45].",
                        "Finally, from a practical point of view, the HD/DHD function also plays a key role when the catalyst stability is considered. A strong hydrogenating function will hydrogenate coke precursors like polynuclear aromatics formed by dehydrocyclisation of the paraffins and, therefore, improve catalyst life cycle. Indeed, for the hydroconversion of n-decane at atmospheric pressure on Pt-HY catalysts, Alvarez et al. [46] observed that increasing the ratio of accessible platinum sites to strong acid sites markedly improved the catalysts stability (Fig. 8)."
                    ],
                    "subsections": [
                        {
                            "title": "Acidic Function",
                            "paragraphs": [
                                "In an ideal catalyst the rate determining step of the reaction occurs on the Brönsted acid sites, as discussed in Section 1.4. Various factors can adversely affect the selectivity of the cracking of a wax molecule to middle distillates, like secondary cracking and cracking near the end of the chain [47]. Schematically, the possibility of secondary cracking will increase with an increased average residence time of olefinic intermediates in the vicinicity of acid sites. Therefore, any diffusional limitation or confinement effect resulting in a too strong adsorption of the intermediates should be minimized Reaction pathways of monofunctional hydrogenolytic demethylation, adapted from [41].",
                                "Figure 8 Ratio of the final to initial activities (A f /A 0 ) of Pt-HY catalysts during n-decane hydroconversion as a function of the ratio of accessible platinum sites to strong acid sites (n Pt /n A ), adapted from [46]. [48,49]. Reducing the acid site density and maintaining a constant hydrogenating power should also retard secondary cracking [50] [51]. Interestingly, they observed that propane abstraction was significantly more pronounced with the ZSM-22 than with the USY zeolite. This is consistent with the fact that for USY zeolite (a 12-MR zeolite) pore mouth and key lock catalysis do not occur.",
                                "In the rather scarcely published findings about middle distillates production via LTFT waxes hydrocracking, various acidic solids have been used to formulate hydrocracking catalysts, including: -amorphous silica-alumina [41,52], -MoO 3 modified amorphous silica-alumina [53], -silicated alumina [40,54], -anion modified (tungstated, sulfated) zirconia [55], -tungstated zirconia and sulfated zirconia mixtures [56], -tungstated zirconia and zeolites (Y, beta, mordenite) mixtures [56], -microcrystalline USY zeolite [57], -microcrystalline USY zeolite and silica-alumina mixtures [58], -polyoxocation-pillared montmorillonite [59], -chlorinated alumina [60].",
                                "Generally speaking, it can be deduced from the published results that high middle distillates yields can be obtained using solid acids with weak or medium acid strength, like silica-aluminas, silicated aluminas or polyoxocation pillared montmorillonite. Such observations are quite expected since with these solid acids the overcracking of olefinic intermediates can be minimized. In the field of conventional petroleum feedstocks hydrocracking, it is also well known that amorphous silica-alumina based catalysts are less active than zeolite based catalysts but are more suited to maximize the middle distillates production [61]. Interestingly, it was recently claimed that the addition of very small amounts of USY zeolite to amorphous silica-alumina could strongly improve the activity of the catalyst for waxes hydrocracking without significant middle distillates selectivity loss [62]."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "Potential Impact of Oxygenates on LTFT Waxes Hydrocracking Catalysts",
                    "paragraphs": [
                        "LTFT products are virtually free of nitrogen or sulfur compounds but can contain several percentages of oxygenated and olefinic compounds. GC 2 analyses performed at IFP on a LTFT effluent demonstrated that oxygenates are mainly composed of alcohols, but other species like carboxylic acids, ketones and esters can also be found [63]. These compounds or their decomposition products can have various effects on hydrocracking catalysts and modify activity and selectivity by changing the HD/DHD function to acidic function balance. This can be illustrated by the results of an IFP study about the impact of 1-decanol on the activity and selectivity of a well balanced noble metal / silica-alumina catalyst. Tests conditions used for that study are provided in Table 5. The feedstock selected was a commercially hydrotreated wax free of olefinic and oxygenated compounds. It can bee seen from Figure 9 that the presence of 1-decanol results in a loss of activity compensated by a temperature rise of about 5 K, while the selectivity towards middle distillates production remains unchanged. It was demonstrated that under the selected hydrocracking conditions 1-decanol is easily decomposed into water and C 10 alkanes. It is proposed that the main effect of 1-decanol (or water) is to adsorb on the acidic sites of the silica-alumina in competition with the alkenes intermediates. This would in turn decrease the number of acidic sites available for the hydrocracking reaction and decrease the activity of the catalyst. The middle distillates selectivity and isomerization degree (not shown) are not affected by the presence of water as the catalyst is already well balanced. A very interesting study was published recently by Leckel [64]. A noble metal / silica-alumina based catalyst was used for the hydrocracking of a commercially purified C80 wax with or without tetradecanol addition. An outcome of the study was that alcohol addition results in a loss of activity of the catalyst by 5 K. Interestingly, it was accompanied by a slight increase of the selectivity towards middle distillates. This suggests that under the applied process conditions and with the feedstock selected, the acidic function of the catalyst was not perfectly balanced by the HD/DHD function and that a slight overcracking of the wax occurred in the absence of tetradecanol. In the case of real FT feedstock that is not hydrotreated, the picture could be more complicated owing to the fact that other oxygenates like carboxylic acids are present. Formation of surface carboxylate species and/or decomposition of the acids and formation of CO, CO 2 could also have an impact on the HD/DHD function of the catalyst. Indeed, Leckel reported that the injection of lauric acid during C80 hydrocracking test with the noble metal/silica-alumina based catalyst entailed a loss of activity and a loss of selectivity towards middle distillates. In this case, it was proposed than the inhibited HD/DHD function could not balance anymore the acidic function, resulting in an overcracking of the waxes due to the nonideality of the catalyst. Zhang et al. also reported that the hydrogenation of a FT wax has a huge effect on a Pt/WO 3 /ZrO 2 catalyst with respect to activity and selectivity [55]. Specific process schemes have been patented in order to cope with the presence of oxygenates. For example, it is proposed in one patent to hydrogenate olefinic and oxygen-containing compounds of the feedstock, and remove the C 4 -fraction before further hydrocracking of at least part of the hydrotreated feedstock [65]. In another patent, it is proposed to dehydrate the feedstock on an alumina catalyst and separate the aqueous and organic phases of the dehydrated product before further processing [66]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Conclusions",
                    "paragraphs": [
                        "Hydrocracking of LTFT waxes is a valuable option for the production of high quality middle distillates. A proper choice of operating conditions and catalyst formulation enables the occurrence of ideal hydrocracking. Under the ideal hydrocracking conditions, the production of middle distillates can be maximized. Compared to fossils sources, LTFT feedstocks are virtually free of sulfur and nitrogen but contain significant amounts of coproducts like oxygenates. It appears that such compounds can significantly affect the activity and middle distillates selectivity of the bifunctional hydrocracking catalysts."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "LONG CHAIN n-PARAFFINS SELECTIVE HYDROISOMERIZATION",
            "paragraphs": [
                "A fraction of the Fischer-Tropsch wax may also be used to produce lubricant base oils. However, the presence of high molecular weight linear paraffins in Fischer-Tropsch wax results in a high pour point. These waxes show coagulation at low temperatures. In order to reduce the pour points, such linear paraffins must be eliminated. Previously, various solvent removal techniques were employed to remove waxes. Elimination of linear chains by selective cracking is another popular approach, but catalytic dewaxing processes through skeletal isomerization are more economical [67]. Moreover the LTFT waxes are mostly composed of linear paraffins. Hydroisomerization on a bifunctional zeolite catalyst is the most convenient process for skeletal branching of n-paraffins."
            ],
            "subsections": [
                {
                    "title": "Specificity of Zeolite Catalysts for Selective Hydroisomerization",
                    "paragraphs": [
                        "Skeletal branching of n-alkanes can be achieved using bifunctional zeolite catalysts. According to the bifunctional reaction scheme, the n-alkane is dehydrogenated on the noble ",
                        "Impact of 1-decanol on LTFT waxes hydrocracking with a noble meta /silica-alumina catalyst: a) C 22+ cut hydrocracking conversion as a function of catalytic bed temperature and b) middle distillates and naphtha yield as a function of the hydrocracking conversion. metal and the resulting alkene protonated on the acid site. The alkylcarbenium ion formed upon protonation undergoes skeletal rearrangements and, eventually, cracking through β-scission. β-scission becomes more and more favorable as the branching degree of the carbon chain increases (see Sect. 1.3). This explains why on a bifunctional catalyst, the yield of skeletal isomers obtained from an n-alkane when plotted against conversion always exhibits an optimum owing to the occurrence of hydrocracking consecutive to hydroisomerization (Fig. 10). Minimization of the hydrocracking reaction is mandatory when high yields of skeletal isomers out of n-alkanes must be achieved.",
                        "Zeolites are good candidates for formulating hydroisomerization catalysts because of their shape selectivity. Shape selectivity was first described by workers at the Mobil company in 1960 [69]. Since then, many studies have been carried out on the subject [70,71]. Shape selectivity results from the confined environment for the molecules in the zeolites. The sterical hindering on reaction or diffusion governs the selectivity of a shape selective reaction. Csicsery [70] distinguished three main shape-selectivity effects: reactant shape-selectivity, product shape-selectivity and transition-state shape-selectivity depending on whether the reaction selectivity is determined by diffusion competition among reactants or products, or whether the reaction itself was subjected to sterical effects.",
                        "The hydroisomerization performance of a zeolite depends on several parameters such as the zeolite topology, pore size, window size, and dimensionality of the pore system. Inside a large pore zeolite such as zeolite Y with a three dimensional pore network, alkane molecules, alkene molecules and alkylcarbenium ions with up to 17 carbon atoms can be easily Figure 10 Evolution of the yield of skeletal isomers and cracked products with conversion of a long n-alkane on bifunctional zeolite catalyst, from [68]. accommodated [18]. As there is no shape selectivity in this kind of zeolite, multibranched isomers are easily formed, but their formation is rapidly followed by cracking. The yield of multibranched isomers from n-alkanes over large pore zeolites is limited, since the dibranched and, especially, the tribranched isoalkanes are particularly susceptible to hydrocracking [18,19].",
                        "Several medium pore zeolites with various framework topologies were studied for the conversion of long n-alkanes from C 8 to C 24 , viz. AEL, MFI, MEL, FER, MTT, ATO, AFO and TON [72][73][74][75][76][77].",
                        "ZSM-5 is a zeolite with three-dimensional pores system (MFI framework type). This framework contains two types of pores that intersect at regular distances. The first type of pore is sinusoidal and runs in the [100] direction, the second type of pore is linear and runs in the [010] direction [78]. In the isomerization of relatively \"short\" n-alkanes such as n-decane, the maximum isomerization yield on Pt/ZSM-5 is only 19% at about 82% conversion [79]. With longer n-alkanes such as n-octadecane, there is no formation of isomers. Only cracked products are formed [17]. The reaction intermediates are blocked inside the porosity of ZSM-5 where they undergo successive isomerization steps and rapid cracking [80].",
                        "Medium pore zeolites, with unidirectional 1D pore system, have been studied in a lot of publications dealing with bifunctional conversion of n-alkanes [76,77,81,82]. Given the industrial relevance, many patents claiming isomerization catalysts and processes have been published. This family of zeolites can be used as efficient isomerization dewaxing catalysts because of their pronounced molecular shape selectivity. The common property of all these zeolites is that they present high selectivity for monobranching up to high conversion. The branching takes place preferentially at the end of the chain, at positions C 2 and C 3 . With very long chains, central branching is preferred together with terminal branching. For example, the ZSM-22 zeolite leads to the formation of a lot of monobranched isomers, some dibranched isomers, and small amounts of tribranched isomers [79] out of n-alkanes. For the hydroconversion of n-decane, a maximum isomer yield of 75% was obtained at about 85% conversion by Parton et al. [79], while in the hydroconversion of n-octadecane, a maximum total isomer yield of 85% is reached, together with less than 5% yield of cracked products. So this catalyst is very attractive for its capability to obtain high isomerization yield, with limited cracking [76]. In octadecane conversion, a maximum yield of monobranched isomers of about 65% is reached at 85% conversion, and a maximum of 55% of multibranched isomers at about 99.7% conversion [76].",
                        "In order to improve the isomerization yield, it was proposed to use mixed zeolite catalysts in order to better approach the thermodynamic equilibrium between the n-paraffin and all its skeletal isomers. Literature reports examples of large and medium pore zeolite mixtures [81,83,84] and also a mixture of two medium pore zeolites [80]. Recent studies [85] show that by physically mixing Pt/ZSM-22 and Pt/ZSM-48 zeolites, the yield of skeletal isomerization of octadecane is increased by 9% at the expense of cracking. The synergetic effect is tentatively explained by the different compositions of monobranched isomers that can be obtained on the two zeolites. To some extent there is additivity of isomerization selectivities."
                    ],
                    "subsections": []
                },
                {
                    "title": "Pore Mouth and Key-Lock Catalysis",
                    "paragraphs": [
                        "During paraffin hydroisomerization reaction over a medium pore zeolite with 1D pore system, the positional selectivity can be rationalized by considering pore mouth catalysis, a peculiar form of shape selectivity proposed to occur in the entrances of zeolite pores. The term pore mouth catalysis was introduced by Venuto in 1977 [86] to indicate that the conversion takes place at the pore aperture of the zeolite and not deeper inside the crystal. For the long-chain paraffin molecules the pore mouth can be defined as a pore opening, and the first nanometer inside the pore. In many medium pore zeolites, it comprises a narrow pocket whose width depends on the sinusoidal interior of the pore and on the direction of the crystal cut at the end of the channel. Pore mouths present a particular geometry which is different from the one deeper inside the pores [87]. In Figure 11, molecules positioned in pore mouths and deep inside zeolite pores are sketched. When two or more atom groups of a molecule are adsorbed simultaneously on several closeby positioned pore openings, the term \"key-lock catalysis\" is used [68].",
                        "This type of selectivity allowed to rationalize the high yields in 2-methylnonane and 2,7-dimethyloctane obtained during n-decane conversion on Pt/ZSM-22 (10-MR zeolite, TON framework structure, monodimensional pore system) [81]. The reaction intermediates are too bulky to form within the ZSM-22 channels, therefore Martens et al. concluded that branching was operated at the active sites at the pore mouths. In the past, this concept was questioned by some authors, based on computational chemistry and estimation of the fitting of the different skeletal isomers in theoretical pores [88]. However, recent investigations using zeolites with compositional gradients tend to support the pore mouth model [76,77].",
                        "Claude et al. investigated the monomethylbranching of long n-alkanes in the range from decane to tetracosane on Pt/H-ZSM-22 bifunctional catalyst [76]. Assuming that the selectivity of the skeletal isomerization of heavy n-alkanes is governed by the physisorption process, molecular models for methyluncosane isomers were built and Lennard-Jones interaction potentials with the zeolite surface estimated. Those authors identified the most favorable pore mouth and key lock configurations. Skeletal branching near the end of the chain, and especially at C 2 , occurs when the molecule is adsorbed according to the pore mouth mode. Central branching proceeds according to a key lock adsorption mode. Here the main carbon chain penetrates with its two ends into pores while the central part is stretched over the external surface and subjected to branching. Pores and pore mouths for several combinations of zeolite types and molecules: a) molecules have access to cavities or interrupted channels, b) molecules are «branched» in pore openings, c) key-lock catalysis, d) molecules are converted in the intracrystalline space, from [68].",
                        "A long n-alkane has many skeletal isomers. n-Heptadecane for example has 219 possible dibranched and 1171 tribranched isomers. Out of all the possible dimethylbranched isomers, only five are obtained in significant quantities, namely 2,7-, 2-8, 2,9-, 2,10-and 2,11-methylpentadecane. The formation of these specific isomers cannot be attributed to shape selective reactions inside the uniform tubular micropores of ZSM-22. When 2-methylhexadecane, the preferred monobranched isomers, is stretched across an external [001] crystal face such that the methyl group is pinned in one pore mouth, dibranching appears to occur when a neighboring pore mouth and its active site can be reached. The thickness of the pore wall, that is, the distance between two neighboring pore mouths, thus appears to determine the second branching position according to this key lock catalysis model.",
                        "The far apart position of methylbranchings on the carbonchain is not favorable for cracking via‚ β-scission mechanisms (Table 2) as the branchings in most of the favored skeletal isomerization products are more than 3 C-atom positions apart.",
                        "ZSM-23 is a zeolite with a structure similar to ZSM-22. The hydroisomerization of dodecane on bifunctional ZSM-23 resulted in preferential formation of 2,5-, 2,6-, 2,7-, 2,8and 2,9-dimethyldecane isomers, whereas on bifunctional ZSM-22, the favored dimethylbranching positions are 2,7-, 2,8-and 2,9-dimethyl [75]. These results illustrate how slight differences in framework topology modify the selectivity of a zeolite catalyst.",
                        "The medium pore zeolites and, especially, those with tubular pores such as ZSM-22, ZSM-23, ZSM-48 and SAPO-11 have been shown in literature to be excellent hydroisomerization catalysts for long-chain n-paraffins [89,90]. These catalysts allow reaching a high isomerization yield at high conversion of the n-paraffins."
                    ],
                    "subsections": []
                },
                {
                    "title": "n-Paraffin Selective Hydroisomerization",
                    "paragraphs": [
                        "on Bifunctional ZSM-48 and Related Zeolites"
                    ],
                    "subsections": [
                        {
                            "title": "Review of the Literature",
                            "paragraphs": [
                                "In literature, relatively little attention has been paid to the ZSM-48 materials, which belong to a complicated family of structure types and their intergrowths [86,87]. The first description of the framework topology of ZSM-48 materials was given by Schlenker et al. in 1985 [91], ZSM-48 was described as a high silica zeolite with orthorhombic or pseudoorthorhombic symmetry the X-ray powder pattern of which can be indexed on the basis of a Pmma-orthorhombic cell with a = (14. In contrast to other high-silica zeolites, there is no IUPAC structure code assigned to ZSM-48 and related zeolites because they are structural mixtures. In 2002, a more detailed description of the structural disorder in ZSM-48 type zeolites was given by Lobo et al. [92]. Those authors explained that ZSM-48 materials show structural variation and that these zeolites theoretically may belong to a wider zeolite materials family. The model by Schlenker et al. described the ZSM-48 structure as a random intergrowth of two different but structurally related polytypes with Cmcm and Imma symmetry, respectively. These two theoretical polytypes can be obtained from T 12 units (T = tetrahedral atom) connected into chains, layers and full frameworks. The interpretation by Lobo et al. [92] comprises nine sorts of polytypes (see Fig. 12). Lobo et al. traced some residual differences between the experimental and simulated XRD patterns, assuming the original description of the disorder given by Schlenker et al. [91], was insufficient.",
                                "The local pore topology is the same in all (disordered) models, and the disorder does not block the pores. However, the different connectivities of the periodic building units are expected to lead to different crystal termination patterns. Lobo et al. suggested that differences in catalytic properties could be due to differences in crystal morphology and size or to differences in the distribution of aluminum over the framework [92].",
                                "ZSM-48 zeolite is an efficient catalyst for hydroisomerization dewaxing according to the claims in several patents [93,94]. Only two research papers have been published in the open literature dealing with hydroisomerization over ZSM-48 type catalysts [95,96]. Mériaudeau et al. investigated the catalytic properties of bifunctional ZSM-48 catalyst in n-octane hydroisomerization [97]. Pt-Pd/ZSM-48 was found to be highly selective for skeletal isomerization. An isomer yield of 78% at 80-85% n-C 8 conversion was reached. The ZSM-48 catalyst does not exhibit the pronounced selectivity for terminal branching typical of ZSM-22 catalysts. Concerning the hydrocracking pattern, there was a symmetrical distribution of cracked products peaking at the C 4 fraction, which represents the central cracking of octane and its isomers.",
                                "Zeolites called ZBM-30, EU-11 and EU-2 according to their XRD patterns belong to the family of zeolites ZSM-48 [90,91]. Probably their framework topologies can be described as structural intergrowths discussed by Lobo et al. [92]. Attempts to refine the detailed structures of ZBM-30, EU-2 and EU-11 are lacking for the moment.",
                                "In conclusion, the crystallographic description of the ZSM-48, ZBM-30, EU-11 and EU-2 zeolites is very complex. Many variations in framework connectivity are possible and, consequently, hydroisomerization behavior are possible, especially when the consequence of the framework variations on pore mouth structures is considered. Note that the connectivity Figure 12 Perspective drawing and parallel projection along the pore axis (small drawings) of the unit cell of the periodic polytypes 1 to 9 in the ZSM-48 family [92]. of T-atoms in all polytypes and their intergrowths is the same. In intracrystalline catalysis, any of the polytypes and their intergrowths would display identical shape selectivity. In the following section the hydroisomerization of octadecane on Pt/ZSM-48, Pt/ZBM-30, Pt/EU-11 and Pt/EU-2 catalysts will be presented. Two samples of ZBM-30 were prepared according to [98] following the recipes for the \"two kinds\" of ZBM-30 obtained using two different structure directing agents, viz. hexamethylenediamine (C 6 H 16 N 2 ) and triethylenetetramine (C 6 H 18 N 4 ), respectively. EU-2 zeolite was synthesized using hexamethonium bromide as structure directing agent [99]; EU-11 zeolite using hexamethylenediamine [100]. This is the same structure directing agent than for ZBM-30, but the amount of structure directing agent is substantially smaller than in the ZBM-30 synthesis. Several structure directing agents can be used to synthesize ZSM-48. Two samples of ZSM-48 were prepared according to [101, 102], using octylamine and ethylenediamine as template, respectively.",
                                "Zeolites were calcined, ion exchanged with ammonium and dried in air. Afterwards the zeolite powders were loaded with tetramine platinum(II) chloride according to the incipient wetness technique to obtain a Pt loading of 0.3 wt%. Amounts of 0.5-2.0 g of pellets of compressed zeolite powder, with diameters of 0.25-0.50 mm, were introduced in a stainless steel reactor tube with an internal diameter of 1 cm and fixed between two plugs of quartz wool. The catalyst was activated in situ by calcination under a flow of O 2 at 673 K, followed by reduction in H 2 without intermittent cooling.",
                                "Hydrocarbon feedstock, stored in a tank pressurized with helium at 0.2 MPa, was pumped with a Waters 590 HPLC pump into a vaporization chamber at 553 K, where it was mixed with a stream of hydrogen. The feedstock consisted of 2 mol% octadecane in heptane. Reaction conditions are T = 506 K; P tot = 0.45 MPa; H 2 /HC = 13.1 mol/mol. The contact time, W/F o , was varied by altering the molar flow rate, F o (mol/s) of octadecane at the entrance of the catalyst bed. Downstream of the reactor, the product was diluted with make-up hydrogen in order to reduce the hydrocarbon concentration in the gas mixture for the online analysis with GC."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Zeolites Characterization",
                            "paragraphs": [
                                "The powder XRD patterns of the samples of ZSM-48, ZBM-30, EU-11 and EU-2 are similar in agreement with literature. The broad XRD lines are characteristic of these materials exemplified in Figure 13 and are due to the presence of a structural intergrowth. Discrimination of the zeolite samples based on these XRD powder patterns is not possible. Zeolites framework compositions are listed in Table 6.  "
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Catalytic Activity in n-Octadecane Hydroconversion",
                            "paragraphs": [
                                "The conversion of n-octadecane over the different catalysts is shown Figure 14a (ZSM-48) and Figure 14b (ZBM-30, EU-2, EU-1). The ZSM-48 sample prepared with ethylenediamine is clearly less active than the one prepared with octylamine (Fig. 14a). The ZBM-30 samples show high activity, especially the sample synthesized using hexamethylenediamine, wich is the most active sample investigated. EU-2 and EU-11 samples have very low activity. Surprisingly EU-11 synthesized with the same template as ZBM-30 but using a smaller quantity of it is much less active. Note that there is no obvious relationship between catalytic activity and Si/Al ratio. EU-11 has a Si/Al ratio similar to ZBM-30, but is much less active."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Isomerization and Cracking Product Yields",
                            "paragraphs": [
                                "The isomerization and cracking yield curves in the high conversion range are shown in Figures 15a and15b, for the ZSM-48 and ZBM-30 catalysts, respectively. With EU-2 and EU-11 catalysts insufficient conversion was obtained. These catalysts will not be treated further. The ZBM-30 sample prepared with triethylenetetramine gave the highest isomers yield and the lowest cracking among all samples investigated. The sample prepared with hexamethylenediamine, although more active was less selective for isomerization."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Monobranching and Multibranching Yields",
                            "paragraphs": [
                                "The number of branchings generated in the paraffin chain is an important property regarding product quality. In the chromatograms on apolar columns where elution occurs according to boiling point, monomethylbranched isomers can be easily distinguished from the other isomers. However it is not possible to distinguish between the dibranched and tribranched isomers. In Figure 16a-d, the yield curves for monobranched and multibranched isomers as well as the total isomer and cracked products yield curves are represented. On all catalysts, monobranching and multibranching are clearly consecutive reactions. The maximum yield of multibranched isomers is reached at very high conversion of around 99%.",
                                "The contact time (W/F 0 ) necessary to reach the maximum yield of multibranched isooctadecanes and the corresponding yields of isomers are summarized in Table 7.",
                                "The superiority of ZBM-30 (triethylenetetramine) is apparent from this table. For comparison, on ZSM-22 under similar reaction conditions, the maximum yield of multibranched isooctadecanes was only 48.4% [87] which is lower   than with any of the zeolites tested in the present study. Another important observation is that ZBM-30 catalyst is twice more active than ZSM-22 when considering the contact time that is necessary to reach the maximum multibranching yield."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Distribution of Skeletal Isomers",
                            "paragraphs": [
                                "There is little difference among the catalysts tested regarding the distribution of monobranched isomers (Fig. 17).",
                                "No attempt was made to analyze the dibranched isooctadecane reaction products. With the different investigated catalysts, the chromatograms showed a very similar envelope of overlapping peaks. The selectivity for formation of specific isomers, if any, is mush less pronounced than with ZSM-22 zeolites. Based on GC peak identification [87], it appears that ZSM-48 and ZBM-30 zeolites favor the branching of the chain at more centrally positioned carbon atoms (position 4,5,6) whereas ZSM-22 catalyst favors the positioning of at least one of the methyl branching on the C 2 carbon atom [87]."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Conclusions",
                            "paragraphs": [
                                "In literature, the ability of medium pore zeolites, and especially those with tubular pores without intersections, to isomerize the long paraffins while suppressing cracking amply has been demonstrated. This particular behavior is assigned to pore mouth catalysis.",
                                "Among the medium pore zeolites, the ZBM-30/ZSM-48 zeolite family received little attention in the open literature. These zeolites seem to belong to a same family of intergrowths. The detailed structures remain to be solved. In patent literature it is claimed that members of this zeolite family show excellent performance in isomerization dewaxing.",
                                "In the present study, different members of this family, viz. ZSM-48, ZBM-30, EU-11 and EU-2 were synthesized using different structure directing agents. In spite of similar DRX patterns, and framework composition, catalytic performances in bifunctional catalysis can be very different. EU-11 and EU-2 are rather inactive catalysts. ZSM-48 and ZBM-30 catalysts are very selective towards n-octadecane hydroisomerization. Specifically ZBM-30 synthesized with triethylenetetramine exhibits the highest isomerization selectivity. This result hints at differences among the different samples of the crystal termination, of the crystal morphology and the aluminium location, characteristics that matter to pore mouth catalysis. More work will be needed to clarify this. This work illustrates the extreme sensitivity of this kind of catalysis to minor variations in zeolite properties."
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        },
        {
            "title": "CONCLUSION",
            "paragraphs": [
                "Long chain paraffins produced by the Fischer-Tropsch process can be upgraded either to high quality middle distillates or to high quality lubricant base oil using bifunctional catalysis. The first option involves a hydrocracking step whereas the second option involves a selective hydroisomerization step. For both steps, bifunctional catalysts containing a hydrogenation/dehydrogenation function and an acidic function (Brönsted acidity) are needed. For the selective hydroisomerization as well as for the hydrocracking, the bifunctional catalyst needs to be ideal, meaning that the reactions taking place on the acid function should be the rate limiting steps of the reaction scheme, therefore the use of strong hydrogenation/dehydrogenation functions is recommended. On the contrary, the optimal acidic function required for each kind of catalyst has to fulfill different requirements. In the hydrocracking catalyst, the acidic phase should favour cracking towards isomerized middle distillates. Multibranching of the olefinic intermediates should be favoured in order to reach an optimal β-scission configuration (A or B type) and a quasi statistic cleavage of the carbon-carbon bonds. In order to reduce overcracking, any diffusional limitation or confinement effect or strong Brönsted acidity resulting in a too strong adsorption of the intermediates should be avoided. The use of mesoporous solids with mild Brönsted acidity may be most appropriate. The presence of oxygenates in the Fischer-Tropsch effluent can significantly alter the catalytic properties of bifunctional catalysts, by changing the balance between the acidic and the hydrogenation/dehydrogenation function. One can take advantage of this property of Fischer-Tropsch feedstocks to tune the balance between the functions.",
                "In the selective hydroisomerization catalyst, the acidic phase should favour the isomerization of the long chain nparaffins and minimize cracking reactions. Monodimensional 10 ring zeolites are found to be very selective towards hydroisomerization. This peculiar behaviour is attributed to the occurrence of pore mouth and key lock catalysis which favor the formation of monobranched and specific dibranched isomers. Comparative studies of zeolites in literature and the present comparison of ZSM-48, ZBM-30, EU-2 and EU-11 samples confirm that the pore mouth topology is a crucial parameter with respect to the skeletal isomerization selectivity of the zeolite."
            ],
            "subsections": []
        },
        {
            "title": "ACKNOWLEDGEMENTS",
            "paragraphs": [
                "JAM acknowledges the Flemish government for supporting a concerted action on heterogeneous catalysis (GOA)."
            ],
            "subsections": []
        }
    ]
}